List surah = [
  {
    "chapter": 1,
    "verse": 0,
    "text":
        "Меҳрибон ва раҳмли Аллоҳнинг номи билан бошлайман. (Аллоҳ таоло ўз китобини бисмиллаҳ билан бошлагани мусулмонларга ҳам ўрнак, улар ҳам доим ўз сўзларини ва ишларини бисмиллаҳ билан бошламоқлари лозим. Пайғамбар алайҳиссалом ҳадисларидан бирида: Эътиборли ҳар бир иш бисмиллаҳ билан бошланмас экан, унинг охири кесикдир, деганлар. Яъни, баракаси бўлмайди, охирига етмайди)"
  },
  {
    "chapter": 2,
    "verse": 1,
    "text":
        "Алиф Лом Мим. (Қуръони Каримнинг йигирма тўққиз сураси ҳарфлар билан бошланган. Бу ҳарфларга турлича номлар берилган: баъзилар \"Ҳурифул муқатаот\" кесик ҳарфлар десалар, бошқалар \"Ҳурифул ҳижои\" алифбо ҳарифлари дейдилар, учинчилари эса, \"Фавотуҳус суар\" сураларни очувчилар дейдилар. Бу ҳарфларга турлича ном берилганидек, улар ила бошланишидан кўзланган мурод ҳақида ҳам ҳар хил фикрлар айтилган. Бу ҳақда махсус баҳслар ҳам бор. Баъзи уламолар бу ҳарфларнинг сирини Аллоҳга ҳавола этадилар, бошқалари: \"Бу Аллоҳ билан Пайғамбар алайҳиссалом ўрталаридаги сир\", дейдилар. Бошқа бирлари эса, уларга ўзларича маъно йўйганлар. Ихтилофнинг асосий сабаби-улар ҳақида на Пайғамбар алайҳиссаломнинг ўзларидан ва на саҳобаи киромлардан бирорта ҳам ривоят йўқлигидир)"
  },
  {
    "chapter": 2,
    "verse": 2,
    "text":
        "Бу китобда шак-шубҳа йўқ, у тақводорларга ҳидоятдир. (Яъни, Қуръони Карим шундай китобки, унинг ҳақлигига ҳеч шак-шубҳа йўқ. Унда ҳамма нарса очиқ-ойдин, аниқ-равшандир. Қуръони Каримнинг бир сифати \"тақводорларга ҳидоятдир\". Ҳидоят-мақсадга эриштиргувчи лутф билан йўл кўрсатишдир. Тақводорлар эса, уқубатга элтгувчи нарсалардан сақланадиган шахслардир. Демак, Қуръони Карим ҳидоятидан баҳраманд бўлиш учун тақводор бўлиш керак экан. Тақвосиз қалбга Қуръони Карим ҳидоят солмайди. Кимки Қуръони Каримдан ҳидоят олибдими, демак унда тақво бор экан)"
  },
  {
    "chapter": 2,
    "verse": 3,
    "text":
        "Улар Ғайбга иймон келтирурлар, намоз ўқирлар ва Биз уларга берган ризқдан нафақа қилурлар. (Ушбу оятда Қуръон ҳидоятидан баҳраманд бўла оладиган тақводорларнинг сифатларидан учтаси саналган: Биринчиси-\"ғайбга иймон келтирурлар\". Абул Олия ғайбга иймон келтиришнинг тафсирида: \"Аллоҳга, Унинг фаришталарига, китобларига, Пайғамбарларига, қиёмат кунига, жаннатига, дўзахига, мулоқотига, ўлимдан кейинги ҳаётга ва қайта тирилишга ишонишдир\", деган эканлар. Иккинчиси-\"намоз ўқирлар\". Яъни, Аллоҳга ибодат қиладилар. Бандага қул бўлишдан озод бўлиб, бандаларнинг Парвардигорига қул бўладилар. Намоз орқали банда Аллоҳ таолога боғланади. Ҳаётида ерга қапишиб юришдан юқори нарсани топади. Шунингдек, бошқа улкан яхшиликларга эришади. Учинчиси-\"Биз уларга берган ризқдан нафақа қилурлар\". Мўмин-мусулмоннинг, тақводор одамнинг эътиқоди бўйича, унинг қўлидаги мол-дунё Аллоҳ берган ризқ, ўзи яратган нарса эмас. Шунинг учун ҳам тақводор инсон Аллоҳ берган ризқдан ўзининг заифҳол, муҳтож биродарларига садақа қилади. \"Садақа\" сўзини тасдиқ маъноси бор, мол-дунёсини сарфлаб садақа қилишда эътиқоддаги маънонинг, яъни, яхшилик қилиш маъносининг тасдиғи бор. \"Нафақа\" ўзи умумий сўз бўлиб, закот, хайр-эҳсон, садақа каби маъноларни англатади)"
  },
  {
    "chapter": 2,
    "verse": 4,
    "text":
        "Ва улар сенга ва сендан олдин нозил қилинган нарсага иймон келтирурлар ва охиратга аниқ ишонурлар. (Демак, тақводорларга оид навбатдаги тўртинчи сифат-Муҳаммад алайҳиссаломга нозил қилинган Қуръони Каримга ва у кишидан олдин туширилган самовий китобларга иймон келтириш. Бу нарса, Ислом умматининг буюк сифатларидан бири бўлиб, бошқа ҳеч бир умматда йўқдир. Чунки Ислом умматидан бошқа ҳеч бир уммат Аллоҳдан нозил бўлган барча китобларга бирдек иймон келтирмаган. Ислом уммати Аллоҳ туширган барча китобларга бирдек иймон келтиради)"
  },
  {
    "chapter": 2,
    "verse": 5,
    "text":
        "Ана ўшалар Роббиларидан бўлган ҳидоятидадирлар ва ана ўшалар, ўшаларгина нажот топгувчилардир. (Ким нажот топишни истаса, ўзида тақводорлик сифатларини мужассам қилишга уринсин)"
  },
  {
    "chapter": 2,
    "verse": 6,
    "text":
        "Албатта, куфр келтирганларга қўрқитасанми-қўрқитмайсанми-барибир, иймон келтирмайдилар"
  },
  {
    "chapter": 2,
    "verse": 7,
    "text":
        "Аллоҳ уларнинг қалблари ва қулоқларини муҳрлаб қўйган ва кўзларида парда бор. Ва уларга улкан азоб бордир"
  },
  {
    "chapter": 2,
    "verse": 8,
    "text":
        "Ва Одамлардан, Аллоҳга ва охират кунига иймон келтирдик, дейдиганлари бор. Ҳолбуки, улар мўмин эмаслар"
  },
  {
    "chapter": 2,
    "verse": 9,
    "text":
        "Улар Аллоҳни ва иймон келтирганларни алдамоқчи бўладилар. Ва ҳолбуки, сезмасдан ўзларини алдайдилар"
  },
  {
    "chapter": 2,
    "verse": 10,
    "text":
        "Уларнинг қалбларида касал бор. Аллоҳ касалларини зиёда қилди. Ва уларга ёлғон гапирганлари учун аламли азоб бор"
  },
  {
    "chapter": 2,
    "verse": 11,
    "text":
        "Ва агар уларга, ер юзида фасод қилманг, дейилса, биз фақат ислоҳ қилувчилармиз, дейдилар"
  },
  {
    "chapter": 2,
    "verse": 12,
    "text": "Огоҳ бўлинг, улар, фақат улар фасодчилардир, лекин сезмайдилар"
  },
  {
    "chapter": 2,
    "verse": 13,
    "text":
        "Ва агар уларга, одамлар иймон келтирганидек, иймон келтиринглар, дейилса, \"Эсипастлар иймон келтирганидек иймон келтирамизми?\" дейишади. Огоҳ бўлинг, улар, фақат улар эсипастлардир ва лекин ўзлари билмайдилар"
  },
  {
    "chapter": 2,
    "verse": 14,
    "text":
        "Улар иймон келтирганларни учратсалар, иймон келтирдик, дейдилар, шайтонлари билан ҳоли қолганда эса, биз сизлар биланмиз, фақат истеҳзо қиляпмиз холос, дейдилар"
  },
  {
    "chapter": 2,
    "verse": 15,
    "text":
        "Аллоҳ уларни истеҳзо қилади ва туғёнларида довдирашларига қўйиб беради"
  },
  {
    "chapter": 2,
    "verse": 16,
    "text":
        "Ана ўшалар, ҳидоятга залолатни сотиб олганлардир. Ва тижоратлари фойда келтирмади ҳамда ҳидоят топганлардан бўлмадилар. (Ушбу оятда Аллоҳ таоло мунофиқлар ҳидоятни қўйиб залолат-адашиш йўлини ихтиёр қилганликларини илоҳий таъбирлар билан баён қилмоқда. Агар улар хоҳласалар, ҳидоят қўлларига теккан эди, ундан фойдаланиб юрсалар бўлар эди. Пайғамбар алайҳиссалом бошқалар қатори уларни ҳам даъват қилган эдилар. Аммо улар ҳидоятни бой бериб, залолатни танладилар. Яъни, ҳидоятга залолатни сотиб олдилар. Аммо уларнинг бу тижорат-савдолари фойда келтирмади. Шу билан бирга, улар ҳидоятда-тўғри йўлда юрувчилардан бўлмадилар. Имом Бухорий Абу Ҳурайра розийаллоҳу анҳудан ривоят қилган ҳадисда Пайғамбаримиз алайҳиссалом: \"Мунофиқнинг белгиси учдир: гапирса ёлғон гапиради, ваъда берса, сўзида турмайди ва омонатга хиёнат қилади\", деганлар. Шунингдек, Имом Бухорий Ибн Амр розийаллоҳу анҳудан ривоят қилган ҳадисда: \"Тўрт нарса бор, кимда улар бўлса, тўлиқ мунофиқ бўлади. Кимда улардан бир хислат бўлса, уни ташлагунча, нифоқнинг хислатларидан бири у кишида туради. Омонатга хиёнат қилади, ёлғон гапиради, аҳд қилса, алдайди ва тортишса, фожирлик қилади\", дейилган)"
  },
  {
    "chapter": 2,
    "verse": 17,
    "text":
        "Улар мисоли ёққан ўти энди атрофини ёритганида Аллоҳ нурларини кетказиб, қоронғу зулматларда қолдирган кишиларга ўхшайдилар. Улар кўрмайдилар. (Ҳақиқатда ҳам, мунофиқлар кофирларнинг зидди ўлароқ, аввал бошдан Ислом даъватини эшитдилар. Ислом-иймон калималарини нутқ қилдилар, ҳатто яхшигина қулоқ осдилар, иймон келтирдик, дедилар, ибодат ҳам қилдилар. Кейин эса, ҳаммасини ташлаб, инкор қилиб, куфр, нифоқ, шак-шубҳа зулматларида қолиб кетдилар)"
  },
  {
    "chapter": 2,
    "verse": 18,
    "text": "Улар кар, соқов, кўрдирлар. Бас, улар қайтмаслар"
  },
  {
    "chapter": 2,
    "verse": 19,
    "text":
        "Ёки худди осмондан ёмғир ёғиб, қоронғу босиб, момақалдироқ ва чақмоқ чаққанда, яшиндан қочиб, панжаларини қулоқларига тиқиб, ўлимдан эҳтиёт бўлаётган одамга ўхшарлар. Ва Аллоҳ кофирларни ўраб олувчидир"
  },
  {
    "chapter": 2,
    "verse": 20,
    "text":
        "Чақмоқ уларнинг кўзини олиб қўяй дейди. Ёриган пайтда юришади, қоронғи бўлса, тўхташади. Агар Аллоҳ хоҳласа, уларнинг кўзу қулоқларини кеткизади. Албатта, Аллоҳ ҳар бир нарсага қодирдир. (Аллоҳ таоло ушбу икки оятда мунофиқларнинг ҳайратлари, иккиланишлари ва умумий руҳий ҳолатларини момақалдироқ бўлиб чақмоқ чақиб, осмонни зулмат босиб, қаттиқ ёмғир ёққанда кўчада қолган бечора одамга ўхшатади. У қўрққанидан даҳшатга тушиб, яшиндан қутулмоқчи бўлади, панжаларини қулоқларига тиқиб, шу мени ўлимдан сақлайди, деб туради. Улар куфр ва нифоқ зулматидадирлар; чақмоқ чаққан пайтдаги ёруғдан фойдаланиб бир-икки қадам боса оладилар, чақмоқдан кейин яна қоронғуда туриб қоладилар)"
  },
  {
    "chapter": 2,
    "verse": 21,
    "text":
        "Эй одамлар, сизларни ва сиздан олдингиларни яратган Роббингизга ибодат қилинг. Шоядки тақводор бўлсангиз. (Ушбу оятда умумбашарга қарата нидо этилмоқдаки, сизларни яратган тарбиякунандаларингиз улуғ Аллоҳга ибодат қилинглар! Сизларни яратишда У ягона бўлган, энди ёлғиз Ўзига ибодат қилишингизга ҳақлидир. Ибодатдан мақсад-шоядки тақводор бўлсаларингиз)"
  },
  {
    "chapter": 2,
    "verse": 22,
    "text":
        "У сизларга ерни тўшаб, осмонни бино қилган ва осмондан сув тушириб, у билан сизларга меваларни ризқ қилиб чиқарган зотдир. Билиб туриб Аллоҳга бошқаларни тенглаштирманг"
  },
  {
    "chapter": 2,
    "verse": 23,
    "text":
        "Ва агар бандамизга туширилган нарсамизга шакингиз бўлса, унга ўхшаш бир сура келтиринг ва рост сўзловчилардан бўлсангиз, Аллоҳдан ўзга гувоҳларингизни чақиринг"
  },
  {
    "chapter": 2,
    "verse": 24,
    "text":
        "Бас, агар қила олмасанглар, ҳеч қачон қила олмайсизлар ҳам, ёқилғиси одамлар ва тош бўлган, кофирлар учун тайёрланган ўтдан қўрқинглар. (Аллоҳ субҳонаҳу ва таолонинг, \"ҳеч қачон қила олмайсизлар ҳам\", дейиши улкан мўъжизадир. Бу ерда Қуръон сураларидан биттасига ўхшаш сурани ҳеч қачон келтира олмаслиги таъкидлаб айтилмоқда)"
  },
  {
    "chapter": 2,
    "verse": 25,
    "text":
        "Иймон келтирган ва солиҳ амаллар қилганларга, улар учун остидан анҳорлар оқиб турган жаннатлар борлигининг башоратини бер. Қачонки уларнинг мевасидан баҳраманд бўлсалар, бундан аввал ҳам ризқланган эдик, дейишади. Уларга ўхшаш нарсалар берилгандир. Уларга бу ерда покиза жуфтлар бор ва улар у ерда абадий қолурлар. (Ушбу ояти каримада Аллоҳ субҳонаҳу ва таоло Пайғамбари Муҳаммад алайҳиссаломга хитоб қилиб, иймон келтирган ва солиҳ амал қилганларга башорат-суюнчилик хабар беришни буюрмоқда. Демак, дарахтлари остидан анҳорлар оқиб турувчи жаннатга кириш учун иймон келтириш, яъни, Аллоҳга, Пайғамбарга, Қуръонга ва иймон лозим бўлган бошқа нарсаларга иймон келтириш ҳамда амали солиҳларни, яъни, Қуръон ва суннатда яхши деб таърифланган ишларни қилиш зарурдир)"
  },
  {
    "chapter": 2,
    "verse": 26,
    "text":
        "Албатта, Аллоҳ чивин ёки ундан устунроқ нарсани мисол келтиришдан уялмас. Иймон келтирганлар, албатта, у Роббиларидан келган ҳақлигини биладилар. Аммо куфр келтирганлар. Аллоҳ бу мисолдан нимани ирода қилади, дейишади. У билан кўпчиликни залолатга кеткизади ва кўпчиликни ҳидоятга солади. У билан фақат фосиқларнигина залолатга кеткизади"
  },
  {
    "chapter": 2,
    "verse": 27,
    "text":
        "Улар Аллоҳнинг аҳдини боғлангандан сўнг бузадиган, Аллоҳ боғланишига буюрган нарсаларни кесадиган, ер юзида фасод қиладиган зотлардир. Ана ўшалар ютқазувчилардир. (Яъни, ҳар бир банданинг Яратган билан боғлаган аҳди бор. Кофир ва мунофиқлар ўша аҳдни бузиш билан бошқалардан ажраб туради. Аллоҳ кўп нарсаларни, жумладан, қариндошлик алоқаларини боғлашга, инсоний алоқаларни боғлашга, иймон ва диндошлик алоқаларини боғлашга... ва ҳоказо ишларга буюрган. Фосиқ-кофир ва мунофиқлар ушбу алоқаларни ҳам кесадилар. Фасоднинг тури жуда кўп. Жумладан, юқоридаги икки сифат ҳам ер юзини фасодга тўлдирадиган сифатлардан ҳисобланади. Аммо энг катта фасод-борлиқни яратувчи зот бўлмиш Аллоҳ таоло кўрсатган йўлини тарк этиб, бошқача яшашга ҳаракат қилишидир. Ҳамма фасод шундан келиб чиқади)"
  },
  {
    "chapter": 2,
    "verse": 28,
    "text":
        "Аллоҳга қандай куфр келтирасизлар? Ва ҳолбуки жонсиз эдингиз У сизга жон берди, сўнгра жонингизни олади ва яна тирилтиради ва сизлар Унга қайтажаксизлар"
  },
  {
    "chapter": 2,
    "verse": 29,
    "text":
        "У сизлар учун ер юзидаги барча нарсани яратган зот. Сўнгра осмонга юзланди ва уларни еттита қилиб тўғрилади. Ва У ҳар бир нарсани билувчи зотдир. (Аллоҳ дунёдаги жамики нарсаларни инсонга ҳадя этган экан, инсон ҳам, ўз навбатида, ўша неъматларни берган Зотга шукр қилиб яшамоғи лозим. Ҳол шундай экан, қандай қилиб улар Аллоҳни инкор этадилар ва унга куфр келтирадилар)"
  },
  {
    "chapter": 2,
    "verse": 30,
    "text":
        "Эсла, вақтики Роббинг фаришталарга: \"Мен ер юзида халифа қилмоқчиман\", деди. Улар: \"Унда фасод қиладиган, қон тўкадиган кимсани қилмоқчимисан? Ва ҳолбуки, биз Сенга тасбиҳ, ҳамд айтиб ва Сени улуғлаб турибмиз\", дедилар. У: \"Мен сиз билмаганни биламан\", деди. (Ушбу оятдан маълум бўляптики, Аллоҳ таоло Одамни Ўзининг ер юзидаги ўринбосари-халифаси бўлишини ирода этган экан. Демак, инсонга улкан ишонч билдирилган, улуғ Аллоҳнинг халифаси бўлишдек олий мақомга лойиқ кўрилган. Бундай марҳаматнинг ўзига яраша буюк масъулияти ҳам бор. Инсон шуни англаган ҳолда, уни халифа қилиб қўйган зотнинг топшириқларини бажармоғи, яратган зот муносиб кўрган олий мақомга доғ туширмасликка ҳаракат қилмоғи керак)"
  },
  {
    "chapter": 2,
    "verse": 31,
    "text":
        "Ва У зот одамга исмларнинг барчасини ўргатди, сўнгра уларни фаришталарга рўбарў қилди. Кейин: \"Агар ростгўйлардан бўлсангиз, анавиларнинг исмларини Менга айтиб беринг\", деди"
  },
  {
    "chapter": 2,
    "verse": 32,
    "text":
        "Улар:\"Эй пок Парвардигор! Бизда Сен билдиргандан бошқа илм йўқ. Албатта, Сенинг Ўзинг билувчисан ва ҳикматли зотсан\", дедилар"
  },
  {
    "chapter": 2,
    "verse": 33,
    "text":
        "У зот:\"Эй Одам, буларга у нарсаларнинг исмларини айтиб бер\", деди. Уларга ўша нарсаларнинг исмларини айтиб берган чоғида, \"Мен сизларга осмонлару ернинг ғайбини биламан ва сизлар беркитмагану беркитган нарсаларни ҳам биламан демабмидим\", деди. (Шу билан Одамнинг фаришталардан устунлик тарафи намоён бўлди. У ҳам бўлса, илм-маърифат. Инсон ер юзида фасод қилиши, қон тўкиши ҳам мумкин, неъмати илоҳий бўлмиш илмни ўз ўрнида ишлатиб, фаришталардан устун бўлиши ҳам мумкин)"
  },
  {
    "chapter": 2,
    "verse": 34,
    "text":
        "Эсла, фаришталарга: \"Одамга сажда қилинглар!\" деганимизни. Бас, сажда қилдилар, магар Иблис бош тортди, мутакаббирлик қилди ва кофирлардан бўлди. (Фаришталарга саждани буюриб, Аллоҳ Одамга улкан мартаба ато этди. Аммо бу сажда ибодат учун эмас, балки Одамни-Аллоҳнинг улуғ ижодини табриклаш маъносида эди. Фаришталар дарҳол сажда қилдилар, чунки улар фитратида Аллоҳнинг амрига исён қилиш хусусияти йўқ. Фақат Иблис сажда қилмади)"
  },
  {
    "chapter": 2,
    "verse": 35,
    "text":
        "Ва: \"Эй Одам, сен ўз жуфтинг ила жаннатда маскан топ. Унда нимани хоҳласаларингиз, енглар, ош бўлсин ва мана бу дарахтга яқин келманглар, бас, у ҳолда золимлардан бўласизлар\", дедик"
  },
  {
    "chapter": 2,
    "verse": 36,
    "text":
        "Шайтон уларни ундан оздирди ва бўлган нарсаларидан чиқарди. Ва Биз: \"Баъзингиз баъзингизга душман бўлиб тушинглар, сизларга ер юзида қароргоҳ ва бир муддат ҳузур қилиш бордир\", дедик"
  },
  {
    "chapter": 2,
    "verse": 37,
    "text":
        "Бас, Одам ўз Роббисидан сўзларни қабул қилиб олди, кейин У зот унинг тавбасини қабул қилди. Албатта, У тавбани қабул қилувчи ва раҳмли зотдир"
  },
  {
    "chapter": 2,
    "verse": 38,
    "text":
        "Биз: \"Ундан ҳаммангиз тушинг, бас, Мендан сизга ҳидоят келажак. Ким Менинг ҳидоятимга эргашса, уларга хавф йўқ ва улар хафа ҳам бўлмаслар\", дедик"
  },
  {
    "chapter": 2,
    "verse": 39,
    "text":
        "Ва куфр келтирган ҳамда оятларимизни ёлғонга чиқарганлар эса, улар дўзах эгаларидир, улар унда абадий қолурлар. (Аллоҳнинг ҳидоятига эргашмаганларни Аллоҳ таоло лўнда қилиб, куфр келтирганлар деб қўя қолган. Эришадиган оқибатлари аниқ: улар дўзахга тушадилар, ўша ерда абадий қоладилар)"
  },
  {
    "chapter": 2,
    "verse": 40,
    "text":
        "Эй Бани Исроил, сизга берган неъматларимни эсланг ва Менга берган аҳдингизга вафо қилинг. Мен ҳам сизга берган аҳдимга вафо қиламан. Ва Мендангина қўрқинг"
  },
  {
    "chapter": 2,
    "verse": 41,
    "text":
        "Ва сиздаги нарсани тасдиқловчи қилиб туширган нарсамга иймон келтиринг. Унга биринчи куфр келтирувчи бўлманг. Менинг оятларимни оз баҳога сотманг ва Менгагина тақво қилинг"
  },
  {
    "chapter": 2,
    "verse": 42,
    "text":
        "Ҳақни ботилга аралаштирманг ва ўзингиз билиб туриб ҳақни беркитманг"
  },
  {
    "chapter": 2,
    "verse": 43,
    "text":
        "Намозни тўкис адо қилинг, закот беринг ва рукуъ қилувчилар билан рукуъ қилинг"
  },
  {
    "chapter": 2,
    "verse": 44,
    "text":
        "Одамларни яхшиликка чорлаб туриб, ўзингизни унутасизми? Ҳолбуки, китобни тиловат қиляпсиз-ку. Ақлни ишлатмайсизми"
  },
  {
    "chapter": 2,
    "verse": 45,
    "text":
        "Сабр ва намоз ила ёрдам сўранг. Ва, албатта, у нафси синиқлардан бошқаларга жуда катта ишдир. (Биз ёрдам сўранг деб таржима қилган ибора араб тилида \"истаъийну\" деб келган. Бу сўзнинг маъноси бир ишга уриниб туриб, яна қўшимча ёрдам сўрашни англатади. Демак, мусулмон киши ҳар бир ишга астойдил уринади ва шу уриниш билан бирга, Аллоҳдан ёрдам сўрайди. Сабр ҳам, кўпчилик хаёл қилганидай салбий маънода, яъни, нима бўлса ҳам сабр қиляпман, деб жим-ҳаракатсиз туриш эмас, балки Аллоҳнинг айтганини бажариш жараёнида дуч келадиган машаққатларни енгишдаги сабрдир. Энг бош сабр ҳавою нафсни, роҳат-фароғатни, мансабни тарк қилиб, Аллоҳнинг айтганига юришга чидамдир)"
  },
  {
    "chapter": 2,
    "verse": 46,
    "text":
        "Улар, албатта, Роббиларига рўбарў бўлишлари ва, албатта, Унга қайтиб боришларига ишонган зотлардир"
  },
  {
    "chapter": 2,
    "verse": 47,
    "text":
        "Эй Бани Исроил, сизга берган неъматларимни ва Мен сизларни оламлардан афзал қилиб қўйганимни эсланг! (Ўша пайтларда Пайғамбарлик, илоҳий китоблар ва бошқа афзалликлар Бани Исроилга берилган эди. Лекин улар бу неъматларга шукр этмадилар, аҳдга вафо қилмадилар. Шундан сўнг Аллоҳ уларни лаънатлади, ғазаб қилди, хорлик ва зорликни раво кўрди)"
  },
  {
    "chapter": 2,
    "verse": 48,
    "text":
        "Бир жон бошқасидан ҳеч нарсани адо қила олмайдиган, ундан шафоат қабул қилинмайдиган, ундан тўлов олинмайдиган ва уларга ёрдам берилмайдиган кундан қўрқинг"
  },
  {
    "chapter": 2,
    "verse": 49,
    "text":
        "Сизни ёмон азобларга солиб, ўғилларингизни сўйиб, қизларингизни тирик қолдираётган Фиръавн аҳлидан қутқарганимизни эсланг. Ана ўшанда Роббингиздан улуғ синов бордир. (Фиръавн-қадимги Миср подшоҳининг лақаби. Яъни, ким Мисрга подшоҳ бўлса, Фиръавн бўлади. \"Фиръавн аҳли\" дегани Фиръавннинг одамлари демакдир. Фиръавн Бани Исроилда туғилган ўғил болаларни ўлдириб, қизларни тирик қолдириши ҳам улкан бир азоб)"
  },
  {
    "chapter": 2,
    "verse": 50,
    "text":
        "Ва денгизни ёриб, сизни қутқариб, сизнинг кўз олдингизда Фиръавн аҳлини ғарқ қилганимизни эсланг. (Бани Исроилни Мусо алайҳиссалом Мисрдан олиб чиқиб кетаётганларида, Фиръавн одамлари билан қувиб келиб қолади. Шунда Аллоҳ денгизни иккига бўлиб йўл очади ва Бани Исроил ўтиб оладилар. Ортларидан Фиръавн одамлари билан тушганда, Аллоҳ уларни ғарқ қилади)"
  },
  {
    "chapter": 2,
    "verse": 51,
    "text":
        "Ва Мусо билан қирқ кечага ваъдалашганимизни, у (кетгани) дан сўнг золим бўлган ҳолингизда бузоқни (худо деб) тутганингизни эсланг"
  },
  {
    "chapter": 2,
    "verse": 52,
    "text": "Ўшандан кейин сизни афв этдик. Шоядки шукр қилсангиз"
  },
  {
    "chapter": 2,
    "verse": 53,
    "text":
        "Шоядки ҳидоят топсангиз, деб Мусога китобни ва фурқонни берганимизни эсланг"
  },
  {
    "chapter": 2,
    "verse": 54,
    "text":
        "Мусонинг ўз қавмига: «Эй қавмим, албатта, сиз бузоқни (худо) тутишингиз ила ўзингизга ўзингиз зулм қилдингиз. Энди сизни йўқдан бор қилувчи зотга тавба қилинг, ўзингизни ўзингиз ўлдиринг, шундоқ қилмоғингиз йўқданбор қилувчи зот ҳузурида сиз учун яхшидир. Бас, тавбангизни қабул қилди. Чунки У тавбани кўплаб қабул қилувчи ва раҳмли зотдир», деганини эсланг. (Бузоқни худо деб тутиш инсон учун, унинг ақли учун нақадар улкан ор бўлишига қарамай, Бани Исроил табиатидаги бузуқликдан келиб чиқиб, шу ишни ўзига эп кўрди ва бу билан ўзига ўзи зулм қилди)"
  },
  {
    "chapter": 2,
    "verse": 55,
    "text":
        "«Эй Мусо, Аллоҳни очиқ-равшан кўрмагунимизча сенга ишонмаймиз», деганингизни, шунда сизни ўзингиз назар солиб турганингизда яшин урганини эсланг. (Бани Исроилнинг бу шаккоклиги учун Аллоҳ таоло муносиб жазолади: ўзлари қараб турган ҳолда яшин уриб, ҳалок бўлдилар)"
  },
  {
    "chapter": 2,
    "verse": 56,
    "text":
        "Сўнгра ўлимингиздан кейин қайта тирилтирдик, шоядки шукр қилсангиз. (Аллоҳ таоло уларни қайта тирилтирибгина қўймади. Балки яна қўшимча марҳаматлар кўрсатди)"
  },
  {
    "chapter": 2,
    "verse": 57,
    "text":
        "Ва булутни устингиздан соя солдириб қўйдик, сизга манн ва беданани туширдик. Ризқ қилиб берган нарсаларимизнинг покларини енглар. Бизга зулм қилмадилар. Лекин ўзларига зулм қилар эдилар. (Ибн Касирнинг айтишларича, «Манн» ўзини еса, таом ва ширинлик, сувга қўшиб ичса, ичимлик бўладиган нарсадир. Уни бошқа нарсаларга қўшса ҳам бўлаверади)"
  },
  {
    "chapter": 2,
    "verse": 58,
    "text":
        "«Ушбу қишлоққа кирингиз ва унинг хоҳлаган жойида енглар, еганингиз ош бўлсин ва эшикдан таъзим билан, ҳиттатун, деб киринг, сизнинг хатоларингизни мағфират қиламиз ва яхшиларга зиёда қиламиз», деганимизни эсланг. (Ушбу оятда, «Ушбу қишлоққа кирингиз», деган жумладаги «қишлоқ»дан мурод–Қуддуси шарифдир. Узоқ замонлар Мисрда ватангадо бўлиб юрган Бани Исроилга Аллоҳ таоло ватан ато қилиб, «қишлоққа кирингиз», деяпти. Бунинг устига яна: «Хоҳлаган жойингизда еб-ичинглар, еганларингиз ош бўлсин», деб катта марҳамат кўрсатяпти. Шу билан бирга, қандай ҳолда кириш лозимлигини ҳам ўргатди. Эшикдан сажда қилиб, яъни, одоб билан, «ҳиттатун» деган сўзни айтиб киринг, дейилди. «Ҳиттатун» дегани–афв эт, гуноҳимни кеч, деган маънони англатар экан. Бани Исроил агар қишлоққа сажда қилиб, гуноҳларини кечишини сўраб, Аллоҳ ўргатган сўзни айтиб кирсалар, Парвардигор уларга мағфират ваъда қилди. «Сизнинг хатоларингизни мағфират қиламиз ва яхшиларга зиёда қилиб берамиз», деди)"
  },
  {
    "chapter": 2,
    "verse": 59,
    "text":
        "Бас, зулм қилганлар уларга айтилган сўзни бошқасига алмаштирдилар. Биз зулм қилганларга фисқ қилаётганлари учун осмондан азоб туширдик. ( Бани Исроил яна бузғунчилик қилди. Аллоҳ таоло ўргатган «ҳиттатун» сўзи ўрнига бошқа сўзни алмаштириб айтдилар. Имом Бухорий Абу Ҳурайра розийаллоҳу анҳудан ривоят қиладиларки, Пайғамбар алайҳиссалом: «Бани Исроилга, эшикдан таъзим қилиб, ҳиттатун, деб киринглар, дейилган эди. Улар думбалари билан судралиб, сўзни алмаштириб, ҳаббатун фи шаъратин, деб кирдилар», дедилар. Ушбу ҳадисдан маълум бўладики, улар ҳам амалда, ҳам сўзда хилоф қилганлар. Сажда (таъзим) қилиб киринглар, дейилса, думбалари билан судралиб кирганлар. «Ҳиттатун» деб айтинглар, дейилса, «ҳаббатун фи шаъратин», яъни, арпа дони ичидаги бир дона дон, дейишган. Уларнинг бу ишлари ҳам зулм, ҳам фисқ–Аллоҳнинг амридан чиқиш эди. Шунинг учун Аллоҳ таоло уларга осмондан азоб туширди"
  },
  {
    "chapter": 2,
    "verse": 60,
    "text":
        "Мусо ўз қавмини сероб қилишни сўраганида, «Ҳассанг билан тошни ур!» деганимизни эсланг. Бас, ундан ўн икки булоқ отилиб чиқди. Ҳар қабила ўз сувини билди. Аллоҳ берган ризқдан еб-ичинглар. Ер юзида бузғунчилик устига бузғунчилик қилманглар"
  },
  {
    "chapter": 2,
    "verse": 61,
    "text":
        "«Эй Мусо, бир хил таомга ҳеч чидай олмаймиз, Роббингга дуо қил, бизга ерда ўсадиган нарсалардан–сабзавот, бодринг, саримсоқ, мош, пиёз чиқариб берсин», деганингизни эсланг. У: «Яхши нарсани паст нарсага алмаштиришни сўрайсизларми? Бирорта шаҳарга тушинг, сўраганингизни албатта, топасиз», деди. Уларга хорлик ва мискинлик ёзилди ва Аллоҳнинг ғазабига лойиқ бўлдилар. Бу Аллоҳнинг оятларига куфр келтирганлари, Пайғамбарларни ноҳақ қатл этганлари учундир. Бу исёнга кетганлари ва ҳаддан ошганлари учундир"
  },
  {
    "chapter": 2,
    "verse": 62,
    "text":
        "Албатта, иймон келтирганлар, яҳудий бўлганлар, насоролар ва собиийлардан, қайсилари Аллоҳга ва қиёмат кунига иймон келтирса ва яхши амалларни қилса, ўшаларга Роббилари ҳузурида ажрлар бордир. Уларга хавф йўқ ва улар хафа ҳам бўлмаслар. (Ояти каримадаги «иймон келтирганлар»дан мурод мусулмонлардир. «Яҳудий бўлганлар»–Бани Исроилдир. Яҳудийнинг икки тоифаси бор: биринчиси–Аллоҳга қайтган, иккинчиси–Яҳудонинг фарзандлари. «Насоролар» деганда эса, Ийсо алайҳиссаломга иймон келтирганлар тушунилади. Улар у кишига ёрдам берганлари учун «насоро» (ёрдам берувчилар) деб ном олганлар. «Собиийлар» деб Пайғамбаримиз келишларидан олдин араб мушрикларидан бир гуруҳлари ўз қавмларининг буту санамларга сиғинишларини ёқтирмай, ўзлари янги ақида ахтариб, охири, Иброҳим алайҳиссалом динида юрамиз, деб қавмларидан ажраб чиққан кишиларга айтилади. Бу номни уларга мушриклар берган, яъни, оталарининг динидан бурилганлар, деганидир"
  },
  {
    "chapter": 2,
    "verse": 63,
    "text":
        "Аҳду паймонларингизни олганимизни ва устингизга Турни кўтарганимизни, «Биз сизга берган нарсани қувват билан олинг ва ундаги нарсани эсланг, шоядки тақводор бўлсангиз», деганимизни эсланг"
  },
  {
    "chapter": 2,
    "verse": 64,
    "text":
        "Сўнгра ўшандан кейин юз ўгирдингиз. Сизга Аллоҳнинг фазли бўлмаганида, албатта ютқазганлардан бўлардингиз"
  },
  {
    "chapter": 2,
    "verse": 65,
    "text":
        "Батаҳқиқ, сизлардан шанба куни тажовузкорлик қилганларни билдингиз. Биз уларга: «Қувилган, хор-зор маймунга айланинг», дедик"
  },
  {
    "chapter": 2,
    "verse": 66,
    "text":
        "Биз бу (ҳодиса) ни унинг олдидагиларга ва кейинидагиларга ва тақводорларга мавъиза қилдик. (Ушбу хабарлардан Бани Исроилнинг яна икки ахлоқини билиб олса бўлади. 1. Кўп таъкидлашга қарамай, ўзларига тушган ваҳийдан, илоҳий кўрсатмалардан юз ўгириш. 2. Буйруқ ва қайтариқларга юзаки амал қилган бўлиб, аслида, хилоф иш тутиш. Имом Аҳмад ривоят қилган ҳадисда Пайғамбар алайҳиссалом: «Яҳудийлар қилган ишни сизлар қилманглар, Аллоҳ харом қилган нарсаларни ҳар хил ҳийлалар билан ҳалол ҳисобламанглар», дейдилар)"
  },
  {
    "chapter": 2,
    "verse": 67,
    "text":
        "Мусо ўз қавмига: «Аллоҳ сизга сигир сўймоқни буюрмоқда», деганини эсланг. Улар: «Бизни масхара қиляпсанми?» дедилар. У: «Жоҳиллардан бўлишимдан Аллоҳдан паноҳ сўрайман», деди"
  },
  {
    "chapter": 2,
    "verse": 68,
    "text":
        "Улар: «Роббингга дуо қил, унинг қандай эканини баён қилиб берсин», дедилар. У: «У қари ҳам, ёш ҳам бўлмаган, икковининг ўртасидаги сигир, деяпти. Бас, буюрилган нарсани бажаринг», деди"
  },
  {
    "chapter": 2,
    "verse": 69,
    "text":
        "Улар: «Роббингга дуо қил, унинг рангини баён қилиб берсин», дедилар. У: «У, ранги сап-сариқ, қараганларни хурсанд қиладиган сигир, деяпти», деди"
  },
  {
    "chapter": 2,
    "verse": 70,
    "text":
        "Улар: «Роббингга дуо қил, унинг қандай эканини бизга баён қилиб берсин, сигир бизга ноаниқ бўлиб қолди, биз, иншааллоҳ, албатта ҳидоят топувчимиз», дедилар"
  },
  {
    "chapter": 2,
    "verse": 71,
    "text":
        "У: «У, ўша сигир минилмаган, ер ҳайдаш, экин суғоришда ишлатилмаган, айблардан саломат, аралашган ранги йўқ, деяпти», деди. Улар: «Ана энди ҳақни келтирдинг», дедилар. Бас, уни сўйдилар. Сал бўлмаса, қилмасдилар"
  },
  {
    "chapter": 2,
    "verse": 72,
    "text":
        "Бир жонни ўлдириб қўйиб, у ҳақида ихтилофга тушганингизни эсланг. Аллоҳ сиз беркитган нарсани чиқаргувчидир"
  },
  {
    "chapter": 2,
    "verse": 73,
    "text":
        "«Бас, уни у(сигир)нинг баъзи жойи билан уринг», дедик. Аллоҳ худди шундай қилиб ўликларни тирилтиради ва оят-аломатларини сизга кўрсатади. Шоядки ақл ишлатсангиз"
  },
  {
    "chapter": 2,
    "verse": 74,
    "text":
        "Сўнгра, шундан кейин қалбларингиз қаттиқ бўлди, улар тошдек ёки тошдан ҳам қаттиқ. Ва ҳолбуки, тошларнинг баъзиларидан анҳорлар отилиб чиқади, баъзилари ёрилиб ундан сув чиқади ва баъзилари Аллоҳдан қўрққанидан қулаб тушади. Ва Аллоҳ қилаётган ишларингиздан ғофил эмас. (Ушбу оятда Аллоҳ таоло Бани Исроилнинг охирги ҳодисадан кейинги ҳолатини васф қилмоқда. Шунча мўъжиза кўрган инсон, ким бўлишидан қатъий назар, қалби эриб, Аллоҳга бўлган эътиқоди зиёда бўлиши керак эди. Аммо Бани Исроилнинг қалблари қаттиқ бўлди. Қаттиқ бўлганда ҳам, тошдек қаттиқ, балки тошдан ҳаим қаттиқ бўлди)"
  },
  {
    "chapter": 2,
    "verse": 75,
    "text":
        "Уларнинг иймон келтиришларини тамаъ қиласизларми? Ва ҳолбуки, улардан бир гуруҳлари Аллоҳнинг каломини эшитар эдилар ва сўнгра уни тушунганларидан кейин билиб туриб бузар эдилар. (Иймон ўзига яраша поклик, мусаффолик, нурни қабул қилиб олишга истеъдод талаб қилади. Аммо яҳудийларда бу нарсага яқинлик ҳеч сезилмаяпти. Уларнинг энг яхши вакиллари бўлмиш диний олимларики Аллоҳнинг каломини эшитиб, уни тушуниб етгандан сўнг, билиб туриб бузсалар, қолганлари нима ҳам қилар эди)"
  },
  {
    "chapter": 2,
    "verse": 76,
    "text":
        "Улар иймон келтирганларни учратсалар, иймон келтирдик, дейдилар. Баъзилари баъзилари билан холи қолсалар: «Уларга Аллоҳ сизга очган нарса ҳақида Роббингиз ҳузурида ҳужжат талашишлари учун гапиряпсизми? Ақлни ишлатмайсизми?» дейдилар. (Шунақа сифат эгаларининг иймонга келишидан умидвор бўлса бўладими? Улар иккиюзлама қавмдир. Мусулмонлар билан учрашиб қолганда, иймонга келдик, Муҳаммад алайҳиссаломга уммат бўлдик, дейишади. Чунки Тавротда у киши ҳақларида башоратлар бор ва яҳудийлар у зотнинг Пайғамбар бўлиб келишларини кутаётган эдилар. Аллоҳ таоло ўша Пайғамбар туфайли бизни душманларимизга ғолиб қилади, дейишар эди... Аммо ўзлари бир-бирлари билан ёлғиз қолганларида, бу ҳақиқатни ошкор қилганларни сўка бошлар эдилар)"
  },
  {
    "chapter": 2,
    "verse": 77,
    "text":
        "Аллоҳ уларнинг сир тутгану ва ошкор қилган нарсаларини, албатта, билишини англамайдиларми? (Зикр қилинган бу ҳол яҳудийларнинг диний олимларига оид)"
  },
  {
    "chapter": 2,
    "verse": 78,
    "text":
        "Уларнинг ичида китобдан бехабар, хомхаёлдан бошқани билмайдиган омийлар бор. Улар фақат гумон қиладилар халос. (Яъни, яҳудийлар ичида Тавротдан бехабар, унда нима гап борлигини билмайдиган саводсиз омийлар ҳам бор. Ўша омийларнинг билгани фақат хомхаёл, холос. Турли нарсаларни гумон қилиб, ўша гумонига ишониб юраверади. Бу омийларнинг шундай ҳолга тушиб қолишига нима сабаб? Асосий сабабларидан бири–залолатга кетган уламолар)"
  },
  {
    "chapter": 2,
    "verse": 79,
    "text":
        "Китобни ўз қўли билан ёзиб, сўнгра уни арзон баҳога сотиш учун: «Бу Аллоҳнинг ҳузуридан», дейдиганларга ҳалокат бўлсин! Уларга қўллари билан ёзган нарсаларидан ҳалокат бўлсин! Уларга топган фойдаларидан ҳалокат бўлсин! (Ояти карима зикр қилган «арзон баҳо» ҳақида Имом Ҳасан Басрий: «Арзон баҳо–дунё ва унинг нарсаларидир» деган эканлар. Дунёга молу бойлик, мансаб ва бошқалар киради)"
  },
  {
    "chapter": 2,
    "verse": 80,
    "text":
        "Ва улар: «Бизга (дўзах) ўти ҳеч тегмайди, тегса ҳам саноқли кунларгина тегади», дедилар. Сен: «Аллоҳдан аҳд олдингизми? Зотан, Аллоҳ аҳдига ҳеч хилоф қилмайди. Ёки Аллоҳнинг номидан билмаган нарсангизни гапиряпсизми?» деб айт"
  },
  {
    "chapter": 2,
    "verse": 81,
    "text":
        "Йўқ! Ким гуноҳ қилса ва уни хатолари ўраб олган бўлса, ана ўшалар дўзах эгаларидир. Улар унда абадий қолурлар"
  },
  {
    "chapter": 2,
    "verse": 82,
    "text":
        "Ва иймон келтириб, яхши амалларни қилганлар, ана ўшалар жаннат эгаларидир. Улар унда абадий қолурлар"
  },
  {
    "chapter": 2,
    "verse": 83,
    "text":
        "Бани Исорилдан Аллоҳдан бошқага ибодат этмайсиз, ота-онага, қариндошларга, етимларга, мискинларга яхшилик қиласиз, одамларга яхши гаплар айтинг, намозни қоим қилинг, закот беринг, деб аҳду паймон олганимизни эсланг. Сўнгра озгинангиздан бошқангиз юз ўгириб, ортга қараб кетдингиз. (Мулоҳаза қилинса, Аллоҳ таоло Бани Исроилдан аҳду паймон олган ишлар Ислом дини ҳам буюрган ишлардир. Шундан ҳамма самовий динларнинг бирлиги келиб чиқади. Тавҳид ақидасининг асоси–Аллоҳдан бошқага ибодат қилмаслик–аҳду паймон олинган ишларнинг бошида саналяпти. Ота-онага яхшилик қилиш ҳар бир фарзанднинг муқаддас бурчи ҳисобланади. Қариндошларнинг қариндошлик ҳаққи бор, уларга ҳам яхшилик қилиш лозим. Етимлар–боқувчисиз қолган ёш болалардир. Жамиятда уларнинг ҳам ҳаққи бор. Шунингдек, мискинлар ҳам турли сабабларга кўра, ҳаёти ноқулай ҳолларга тушиб қолган шахслардир, уларга ҳам яхшилик кўрсатиш инсоннинг инсонийлик бурчи ҳисобланади)"
  },
  {
    "chapter": 2,
    "verse": 84,
    "text":
        "Сизлардан бир-бирингизнинг қонларингизни тўкмайсиз ва диёрингиздан чиқармайсиз, деб аҳду паймонингизни олганимизни эсланг. Сўнгра гувоҳлик бериб туриб иқрор бўлдингиз"
  },
  {
    "chapter": 2,
    "verse": 85,
    "text":
        "Сўнгра сиз ўзингизни ўзингиз ўлдирасиз ва бир гуруҳингизни диёридан чиқарасиз ҳамда уларга қарши гуноҳ ва душманлик йўлида ёрдам берасиз. Агар улар асир бўлсалар, қутқариб оласиз. Ва ҳолбуки, уларни чиқариш ҳаром эди. Ёки китобнинг баъзисига иймон келтириб, баъзисига куфр келтирасизми?! Сизлардан ўшани қилганларнинг жазоси бу дунёда фақат расво бўлишликдир, қиёмат кунида эса, энг шиддатли азобга қайтарилурлар. Аллоҳ қилаётганингиздан ғофил эмас"
  },
  {
    "chapter": 2,
    "verse": 86,
    "text":
        "Ана ўшалар дунё ҳаётини охиратга сотиб олганлардир. Улардан азоб енгиллатилмас ва уларга ёрдам ҳам берилмас"
  },
  {
    "chapter": 2,
    "verse": 87,
    "text":
        "Ва батаҳқиқ, Мусога китобни бердик ва унинг ортидан Пайғамбарларни кетма-кет юбордик. Ва Ийсо ибн Марямга равшан (мўъжизалар)ни бердик ва уни руҳул қудс билан қўлладик. Ҳар қачон Пайғамбар сизнинг ҳавою нафсингизга ёқмайдиган нарса келтирса, мутакаббирлик қилиб, баъзиларини ёлғончига чиқариб, баъзиларини ўлдираверасизми"
  },
  {
    "chapter": 2,
    "verse": 88,
    "text":
        "Ва улар: «Қалбимиз ғилофланган», дейишади. Йўқ, ундай эмас, куфрлари сабабли Аллоҳ уларни лаънатлаган. Бас, озгинагина иймон келтирадилар. (Яҳудийлар Исломга даъват қилинганларида: «Бизнинг қалбимиз ғилофланган, янги даъват кирмайди, янги даъватчини қабул қилмайди», деб айтишар эдилар. Аллоҳ таоло ушбу оятда уларнинг бу гаплари ёлғон эканини фош этиб, ҳақиқатни баён қилмоқда. Ҳақиқат нима? Ҳақиқат шулки, улар аввалдан куфр келтириб, иймондан қочиб юрганлари учун Аллоҳ уларни лаънатлаб, яъни, раҳматидан қувиб, ҳидоят неъматидан маҳрум этган. Шу сабабдан улар иймонга кела олмайдмлар. Агар мабодо келсалар ҳам, жуда оз келадилар)"
  },
  {
    "chapter": 2,
    "verse": 89,
    "text":
        "Уларга Аллоҳнинг ҳузуридан ўзларидаги нарсани тасдиқловчи китоб келганда, ва ҳолбуки, кофирларга қарши (ундан) ёрдам кутардилар, ўзлари билган нарса келганда, унга куфр келтирдилар. Кофирларга Аллоҳнинг лаънати бўлсин. (Ибн Касир раҳматуллоҳи алайҳи ривоят қиладиларки, яҳудийлар Авс ва Хазраж қабилаларига қарши, яқинда бизнинг китобларимиз хабарини берган Пайғамбар чиқади, биз унга иймон келтириб, сизларнинг устингиздан ғалаба қозонамиз, дер эдилар. Аллоҳ таоло Пайғамбарни араблар ичидан танлаб юборгач эса, у кишига куфр келтирдилар. Аввалги гапларини ўзлари инкор қилдилар. Шунда Муоз ибн Жабал, Башир ибн ал-Барраа ибн Маъруф ва Довуд ибн Саламалар уларга қарата: «Эй яҳудийлар жамоаси, Аллоҳдан қўрқинглар! Мусулмон бўлинглар! Биз ширк аҳли бўлган давримизда, бизга қарши у кишидан ёрдам топишингизни айтар эдингизлар. У кишининг Пайғамбар қилиб юборилиши хабарини берар эдингизлар. Сифатларини айтиб берар эдингизлар», дедилар. Бунга жавобан Бани Назийр яҳудийларидан Салом ибн Мушкам дегани: «У биз билган нарсани олиб келди. Биз сизга айтган бу эмас», деди)"
  },
  {
    "chapter": 2,
    "verse": 90,
    "text":
        "Улар ўзларини сотган нарса, Аллоҳ бандаларидан хоҳлаганига Ўз фазлидан туширганига ҳасад қилиб, Аллоҳ туширган нарсага куфр келтирмоқлик, қандоқ ҳам ёмон. Улар ғазабнинг устига ғазабни лозим тутдилар. Кофирларга хор қилувчи азоб бордир"
  },
  {
    "chapter": 2,
    "verse": 91,
    "text":
        "Агар уларга: «Аллоҳ туширган нарсага иймон келтиринг», дейилса, «Бизга туширилган нарсага иймон келтирамиз», дейишади. Ва ундан кейинги нарсага куфр келтиришади. Ҳолбуки, у улардаги нарсани тасдиқловчи ҳақдир. Айт: «Агар мўмин бўлсангиз, нимага илгари Аллоҳнинг Пайғамбарларини ўлдирдингиз?!»"
  },
  {
    "chapter": 2,
    "verse": 92,
    "text":
        "Ва батаҳқиқ, Мусо сизларга равшан (мўъжиза)лар ила келди. Сўнгра сиз ундан кейин золим бўлган ҳолингизда бузоқни (худо) тутдингиз"
  },
  {
    "chapter": 2,
    "verse": 93,
    "text":
        "Сиздан аҳду паймонингизни олиб, устингизга Турни кўтариб: «Сизга Биз берган нарсани қувват билан тутинг ва тингланг», деганимизни эсланг. Улар: «Тингладик ва исён қилдик», дедилар. Куфрлари сабабли қалбларига бузоқ ўрнаштирилди. Айт: «Агар мўмин бўлсангиз сизнинг иймонингиз қандай ҳам ёмон нарсага буюради!» (Бани Исроилнинг хиёнаткорлиги, алдамчилиги ва бошқа кирдикорларни назарда тутган ҳолда Аллоҳ таоло улардан таъкидланган, ҳужжатлаштирилган аҳду паймон олган ва устиларига Тур тоғини кўтариб туриб: «Сизга Биз берган нарсани қувват билан тутинг ва тингланг», деб айтган эди. Иймони бор халққа шу етарли бўлиши керак эди. Аммо Бани Исроил нима қилди?! Улар тилда «эшитдик», дейишди, аммо амаллари билан, «исён қилдик», дейишди. Яъни, тил бошқа, амал бошқа бўлди)"
  },
  {
    "chapter": 2,
    "verse": 94,
    "text":
        "Айт: «Агар Аллоҳнинг ҳузуридаги охират ҳовлиси бошқа одамларсиз холис сизга бўладиган бўлса, гапингизда ростгўй бўлсангиз, ўлимни орзу қилинг»"
  },
  {
    "chapter": 2,
    "verse": 95,
    "text":
        "Улар қўллари тақдим қилган нарсалар сабабидан, уни абадий, ҳеч-ҳеч орзу қилмаслар ва Аллоҳ зулм қилувчиларни билувчи зотдир. (Оятдаги «қўллари тақдим қилган нарсалар» жумласи, «гуноҳлар» маъносида келгандир. Араб тилида бирор нарсанинг аҳамиятини бўрттириб кўрсатилмоқчи бўлинса, ушбу услуб ишлатилади. Демак, яҳудийлар ўлимни орзу қила олмайдилар. Чунки улар ўзларининг гуноҳларини яхши биладилар. Ушбу гуноҳлар билан ҳеч-ҳеч жаннатга кириб бўлмайди. Ўлсалар, беш кунлик дунёнинг матосидан ажралиб қолишларидан қўрқиб, бу дунё ҳаётига маҳкам ёпишиб оладилар)"
  },
  {
    "chapter": 2,
    "verse": 96,
    "text":
        "Уларнинг ҳаётга энг ҳирс қўйган одамлар эканлигини биласан. Мушриклардан бирлари минг йил умр кўришни суяди. Аммо узоқ умр кўриши уни азобдан қутқармайди. Ва Аллоҳ уларнинг қилаётганларини кўрувчидир"
  },
  {
    "chapter": 2,
    "verse": 97,
    "text":
        "Жиброилга душман бўлганларга айт, албатта у(Қуръон)ни сенинг қалбингга Аллоҳнинг изни билан, ўзидан олдингини тасдиқловчи ва мўминлар учун ҳидоят ва башорат қилиб туширди. («Жиброилга душман бўлганлар»–яҳудийлардир. Улар Жиброил фаришта алайҳиссаломни ўзларига душман ҳисоблашар эдилар. Бунга далил ўлароқ Имом Аҳмад Ҳанбал ривоят қилишича яҳудийлар Пайғамбаримиз Муҳаммад алайҳиссалом билан узоқ суҳбат қурган эдилар. Шунда, «Улар: «Ҳар бир Пайғамбарнинг унга хабар келтирадиган фариштаси бўлади. Бизга айт-чи, сенинг соҳибинг ким?» дедилар. У киши: «Жиброил алайҳиссалом», дедилар. Улар: «Жиброил урушни, жангни, азобни туширади, бизнинг душманимиз, агар раҳмат, ёмғир ва набототларни олиб тушадиган Микоил деганингда, яхши бўларди», дедилар)"
  },
  {
    "chapter": 2,
    "verse": 98,
    "text":
        "Ким Аллоҳга, унинг фаришталарига, Пайғамбарларига, Жиброилга ва Микоилга душман бўлса, албатта, Аллоҳ кофирларнинг душманидир"
  },
  {
    "chapter": 2,
    "verse": 99,
    "text":
        "Батаҳқиқ, сенга равшан оятларни туширдик, уларга фақат фосиқларгина куфр келтирадир"
  },
  {
    "chapter": 2,
    "verse": 100,
    "text":
        "Ҳар қачон аҳд қилишсалар, улардан бир гуруҳи уни бузаверадими?! Йўқ! Уларнинг кўплари иймон келтирмаслар"
  },
  {
    "chapter": 2,
    "verse": 101,
    "text":
        "Улардаги нарсани тасдиқлаб, Аллоҳнинг ҳузуридан уларга Пайғамбар келса, китоб берилганлардан бир гуруҳи, худди билмагандек, Аллоҳнинг китобини ортларига қараб отдилар. («Аллоҳнинг китоби» Таврот бўлиши мумкин, чунки унда Муҳаммад алайҳиссаломнинг Пайғамбар бўлиб келишлари башорати бор. Тавротнинг башоратини тан олмаганларни китобни орқаларига қараб отиш деб васф этилмоқда. Айни чоқда, у китоб Қуръони Карим ҳам бўлиши мумкин, чунки яҳудийлар уни ҳам қабул қилмадилар)"
  },
  {
    "chapter": 2,
    "verse": 102,
    "text":
        "Ва Сулаймон подшолигида шайтонлар тиловат қилган нарсага эргашдилар. Сулаймон куфр келтиргани йўқ. Лекин шайтонлар одамларга сеҳрни ўргатиб, кофир бўлдилар. Ва Бобилда Ҳорут ва Морут номли икки фариштага тушган нарсага эргашдилар. Икковлари ҳатто: «Биз фитна-синов учунмиз, кофир бўлмагин», демасдан олдин ҳеч кимга ўргатмасдилар. Бас, икковларидан эр-хотиннинг ўртасини бузадиган нарсани ўрганишар эди. Ва улар Аллоҳнинг изнисиз бирор кишига зарар етказувчи эмасдилар. Ва икковларидан зарар келтирадиган, фойда келтирмайдиган нарсани ўрганадилар. Ва, батаҳқиқ, биладиларки, уни сотиб олган кишига охиратда насиба йўқ. Агар билсалар, ўзларини сотган нарса қандоқ ҳам ёмон! (Аллоҳ Сулаймон алайҳиссаломга берган мазкур мўъжизаларни кўриб, одамлардан баъзилари иймонга келди, иймонлиларнинг иймонлари мустаҳкамланди. Аммо кофирлар, душманлар ва шайтонлар: «Сулаймон сеҳргар, у ўз сеҳрининг кучи билан турли ҳайвонлар ила муносабатда бўлмоқда, жинларни ишлатмоқда, деган гапларни тарқатишди. Пайғамбарлик мўъжизаси илоҳий неъмат бўлиб, фақат Аллоҳ томонидан берилади. Сеҳр эса, ўргатувчидан ўрганса бўладиган, ёмонликка ишлатиладиган бир нарсадир. Шундай қилиб, мўъжиза нимаю сеҳр нима–кишиларга амалда кўрсатилган экан. Ушбу ояти карима мазкур масалани муолажа қиларкан, Сулаймон сеҳргар бўлган, деган даъвога «Сулаймон кофир бўлмаган» деган жавоб келмоқда. Шундан англашиладики, сеҳр куфрга тенглаштирилмоқда. Бу маънони «Лекин шайтонлар одамларга сеҳрни ўргатиб кофир бўлдилар», деган жумла янада таъкидламоқда. Кофирликни бўйнига олиб сеҳрни ўрганганлар нимага ишлатишади сеҳрларини? «Эр-хотиннинг ўртасини бузишга». Демак, ёмон нарсага. Cеҳрни ўрганган, уни ёмонликка ишлатганларга охиратда ҳеч қандай насиба қолмайди. Буни уларнинг ўзлари ҳам яхши биладилар)"
  },
  {
    "chapter": 2,
    "verse": 103,
    "text":
        "Агар улар иймон келтириб, тақво қилганларида, гар билсалар, Аллоҳнинг ҳузуридаги савоб яхши эди"
  },
  {
    "chapter": 2,
    "verse": 104,
    "text":
        "Эй иймон келтирганлар! «Роъина» деманглар, «унзурна» денглар ва тингланглар. Ва кофирларга аламли азоб бўлур. (Cаҳобаи киромлар ўрганиши лозим бўлган нарсаларни сабоқ олсалар, Пайғамбаримиз алайҳиссалату вассаламга, «Роъина», яъни, кузатиб туринг, тушуниб, ўзлаштириб олайлик, дейишар экан. Аммо пасткаш яҳудийлар мусулмонларни таҳқирлаш учун шу ҳолатдан ҳам фойдаланишибди. Ўзларининг иброний тилларида худди «роъина» каби талаффуз этиладиган, лекин сўкиш, масхара маъносида ишлатиладиган сўзни Расули акрам c. а. в. ҳузурларига келганда айтадиган бўлишибди)"
  },
  {
    "chapter": 2,
    "verse": 105,
    "text":
        "Аҳли китоб ва мушриклардан бўлган кофирлар сизларга Роббингиздан яхшилик туширилишини ёқтирмайдилар. Ва ҳолбуки, Аллоҳ Ўз раҳматини кимга хоҳласа, ўшанга хос қилади. Аллоҳ улуғ фазл эгасидир"
  },
  {
    "chapter": 2,
    "verse": 106,
    "text":
        "Оятлардан биронтасини насх қилсак ёки унутдирсак, ундан яхшисини ёки унга ўхшашини келтирамиз. Аллоҳ ҳар нарсага қодир эканини билмадингми"
  },
  {
    "chapter": 2,
    "verse": 107,
    "text":
        "Албатта, осмонлару ернинг мулки Аллоҳники эканини ва сизларга Аллоҳдан ўзга дўст йўқ, ёрдамчи ҳам йўқлигини билмадингми? («Насх» сўзи луғатда ўзгартиш, бекор қилиш маъносини билдиради. Шариат таърифида эса, бир шаръий ҳукмнинг ундан кейин келган шаръий далил билан бекор қилинишига айтилади. Тушуниш учун оддий бир мисол келтирадиган бўлсак, кўпчилик бўлар-бўлмасга Пайғамбар алайҳиссалом ҳузурларига кириб, бекорчи гаплар билан у зотнинг вақтларини олишаверганидан сўнг, Аллоҳ таоло оят тушириб, ким Пайғамбар алайҳиссалом билан ҳузурларида ёлғиз қолиб гаплашмоқчи бўлса, гаплашишдан олдин садақа қилишга буюрди. Одамлар бу орқали Пайғамбар алайҳиссаломнинг қимматли вақтларини бекор ўтказмаслик лозим эканлигини англаб бўлганларидан сўнг, бошқа оят тушириб, аввалги ҳукм бекор қилингани эълон этилди)"
  },
  {
    "chapter": 2,
    "verse": 108,
    "text":
        "Ёки Пайғамбарингиздан, бундан аввал Мусодан сўралганидек, савол сўрашни хоҳлайсизми?! Ким иймонни куфрга алмаштирса, батаҳқиқ, тўғри йўлдан адашган бўлади. (Аллоҳ таоло мусулмонларни яҳудийларга ўхшаб ғаразли саволлар беришдан қайтармоқда. Пайғамбар алайҳиссаломдан Мусо алайҳиссаломдан Бани Исроил сўраган нарсаларга ўхшаш нарсаларни сўрашнинг ёмонлигини баён қиляпти ва бу ишни, иймонни куфрга алмаштириш, деб атаяпти)"
  },
  {
    "chapter": 2,
    "verse": 109,
    "text":
        "Аҳли китоблардан кўплари уларга ҳақ равшан бўлганидан кейин, ўзларича ҳасад қилиб, сизларни иймонли бўлганингиздан кейин кофирликка қайтармоқчи бўладилар. Аллоҳнинг амри келгунча афв этинг, кечиримли бўлинг. Албатта, Аллоҳ ҳар бир нарсага қодирдир"
  },
  {
    "chapter": 2,
    "verse": 110,
    "text":
        "Намозни қоим қилинг, закот беринг, ўзингиз учун қилган яхшиликларни Аллоҳнинг ҳузурида топасиз. Албатта, Аллоҳ қилаётганингизни кўрувчидир"
  },
  {
    "chapter": 2,
    "verse": 111,
    "text":
        "Ва улар: «Жаннатга яҳудий ва насронийлардан бошқа ҳеч ким кирмайди», дедилар. Бу уларнинг хом хаёлларидир. «Агар ростгўй бўлсангиз, ҳужжатингизни келтиринг», деб айт"
  },
  {
    "chapter": 2,
    "verse": 112,
    "text":
        "Йўқ! Кимки яхшилик қилган ҳолида юзини Аллоҳга топширса, унга Робби ҳузурида ажр бордир. Уларга хавф йўқ ва улар хафа ҳам бўлмаслар. (Демак, ҳам маънавий, ҳам моддий тарафдан фақат Аллоҳ учун бўлган иш ўз эгасини мукофотга етказади. Аввало, «Робби ҳузурида ажр бордир». Яна унга келажакда хавф йўқ. Яна у бўлиб ўтган ишлардан афсусланмайди. Булар Аллоҳнинг ваъдаларидир ва, муҳаққақ, шундай бўлгусидир)"
  },
  {
    "chapter": 2,
    "verse": 113,
    "text":
        "Яҳудийлар: «Насронийлар арзимас нарсададирлар», дедилар. Насронийлар: «Яҳудийлар арзимас нарсададирлар», дедилар. Ва ҳолбуки, улар китоб тиловат қиладилар. Шунингдек, билмайдиган кимсалар ҳам уларнинг гапига ўхшаш гап айтдилар. Бас, қиёмат куни ораларида Аллоҳ улар ихтилоф қилган нарса ҳақида ҳакамлик қилади. (Самовий китоб эгаси бўлмаган халқлар оятда илоҳий таълимотларни «билмайдиган кимсалар» деб аталяпти. Улар ҳам яҳудий ва насронийларнинг гапларига ўхшаш гапларни айтадилар, яъни, булар иккаласи ҳам ҳеч нарсага арзимайди, дейдилар. Улар тортишишган масаланинг ҳақиқий ҳукмини Аллоҳ таоло қиёмат куни Ўзи чиқаради)"
  },
  {
    "chapter": 2,
    "verse": 114,
    "text":
        "Аллоҳнинг масжидларида Унинг исми зикр қилинишини ман этган ва уларни бузишга ҳаракат қилгандан ҳам золимроқ одам борми? Ана ўшалар у жойларга фақат қўрққан ҳолларидагина киришлари керак эди-ку! Уларга бу дунёда хорлик бордир ва уларга охиратда улуғ азоб бордир"
  },
  {
    "chapter": 2,
    "verse": 115,
    "text":
        "Машриқу мағриб Аллоҳникидир, қаёққа қарасангиз, Аллоҳнинг юзи бор. Албатта, Аллоҳ кенг қамровли, билувчи зотдир. (Бутун ер юзи–мағрибу машриқ мусулмонлар учун масжид қилинган. Чунки ер юзи Аллоҳ таолоники. Унга ибодат қилмоқчи бўлган одам ҳар жойда қилаверса бўлаверади)"
  },
  {
    "chapter": 2,
    "verse": 116,
    "text":
        "Улар: «Аллоҳ ўзига фарзанд тутди», дейдилар. У покдир. Балки осмонлару ердаги барча нарсалар Уникидир. Ҳамма Унга бўйсунувчидир"
  },
  {
    "chapter": 2,
    "verse": 117,
    "text":
        "У осмонлару ерни пайдо қилувчидир. Бирор ишни қилмоқчи бўлганида, унга: «Бўл!» деса, бўлаверадир. (Кофирлар ушбу ояти каримада келганидек, «Аллоҳ ўзига фарзанд тутди», дейдилар. Бу оятлар тушаётган пайтда мусулмонлар билан юзма-юз тўқнашиб турган уч тоифа кофирлар уччаласи ҳам улкан жиноятга бориб, Аллоҳга туҳмат қилишарди: Яҳудийлар: «Узайр Аллоҳнинг ўғли», дейишарди; насоролар: «Ийсо Масиҳ Аллоҳнинг ўғли», дейишарди; кофирларнинг учунчи гуруҳи бўлмиш мушриклар: «Фаришталар Аллоҳнинг қизлари», дейишарди. Исломий тасаввурдан бошқа тасаввурлар фалсафаларнинг катта хатоси Холиқ (яратувчи) билан махлуқ (яратилмиш) орасидаги фарқни тушунмасликдадир. Ислом назарияси бўйича, маҳлуқлар тамом бошқа, Холиқ тамом бошқа мавжудлик. Холиқнинг асло ўхшаши йўқ, Уни тасаввурга сиғдириб ҳам бўлмайди, махлуққа қиёсан таърифланмайди ҳам. Яъни, Аллоҳнинг хотини ҳам, фарзанди ҳам бўлиши мумкин эмас"
  },
  {
    "chapter": 2,
    "verse": 118,
    "text":
        "Билмайдиган кимсалар: «Аллоҳ биз билан гаплашса эди ёки мўъжиза келса эди», дейишди. Улардан олдингилар ҳам уларнинг сўзига ўхшаш гапирган эдилар. Қалблари ўхшаш бўлди. Батаҳқиқ, Биз яхши билувчи қавмларга мўъжизаларни баён қилганмиз"
  },
  {
    "chapter": 2,
    "verse": 119,
    "text":
        "Албатта, Биз сени ҳақ билан суюнчли хабар берувчи ва огоҳлантирувчи қилиб юбордик. Ва дўзахилар ҳақида сўралмайсан"
  },
  {
    "chapter": 2,
    "verse": 120,
    "text":
        "Сендан яҳудийлар ҳам, насронийлар ҳам уларнинг миллатига эргашмагунингча ҳеч-ҳеч рози бўлмаслар. «Албатта, Аллоҳнинг ҳидояти ҳақиқий ҳидоятдир», деб айт. Агар сенга келган илмдан кейин ҳам уларнинг ҳавои нафсларига эргашсанг, сени Аллоҳдан (қутқарувчи) дўст ҳам, ёрдамчи ҳам йўқдир"
  },
  {
    "chapter": 2,
    "verse": 121,
    "text":
        "Биз китоб берганлардан уни ўрнига қўйиб тиловат қиладиганлари, ана ўшалари унга иймон келтиради. Ким унга куфр келтирса, ана ўшалар, ўзларигина ютқазганлардир. (Агар яҳудийлар ҳақиқий Тавротни инсоф билан, ўрнига қўйиб ўқисалар, Муҳаммад алайҳиссаломга иймон келтириш зарурлигини тушуниб етадилар. Насронийлар ҳам Инжилни бузмасдан, инсоф билан, ўрнига қўйиб ўқисалар, Муҳаммад алайҳиссаломга иймон келтириш зарурлигини англаб етадилар. Кимки Қуръони Каримни инсоф билан, ўрнига қўйиб ўқиса, унга иймон келтириш зарурлигини тушуниб етади)"
  },
  {
    "chapter": 2,
    "verse": 122,
    "text":
        "Эй Бани Исроил, сизга берган неъматларимни ва Мен сизларни оламлардан афзал қилиб қўйганимни эсланг"
  },
  {
    "chapter": 2,
    "verse": 123,
    "text":
        "Бир жон бошқа жондан ҳеч нарсани адо қила олмайдиган, ундан шафоат қабул қилинмайдиган, ундан тўлов олинмайдиган ва уларга ёрдам берилмайдиган Кундан қўрқинг"
  },
  {
    "chapter": 2,
    "verse": 124,
    "text":
        "Иброҳимни Роббиси калималар ила синаб кўрганда, у уларни батамом адо этганини эсла! У зот: «Мен, албатта, сени одамларга имом қилмоқчиман» деди. У: «Зурриётимдан ҳамми?» деди. У зот: «Золимлар аҳдимга ҳеч қачон эриша олмайдилар», деди"
  },
  {
    "chapter": 2,
    "verse": 125,
    "text":
        "«Уй»ни одамлар учун масаба ва омонлик жойи қилганимизни эсланг. Ва Иброҳимнинг мақомини намозгоҳ тутинг. Ва Иброҳим ва Исмоилга: «Уйимни тавоф қилувчилар, муқим турувчилар, рукуъ ва сажда қилувчилар учун поклаб қўйинглар», деб амр қилдик. («масаба» зиёрат қилиб тўймайдиган макон)"
  },
  {
    "chapter": 2,
    "verse": 126,
    "text":
        "Иброҳимнинг: «Роббим, буни омонлик юрти қилгин ва аҳлидан Аллоҳга ва қиёмат кунига иймон келтирганларини мевалар ила ризқлантиргин», деганини эсла. У зот: «Ким куфр келтирса, озгина ҳузур бахш этаман, сўнгра дўзах азобига мажбур қиламан ва у қандай ҳам ёмон жой!» деди. (Ушбу оятда иккинчи марта, энди Иброҳим алайҳиссалом тилларидан, Байтуллоҳнинг омонлик маскани бўлиши хабари келяпти. Аммо, одобли, сермулаҳаза Пайғамбар Иброҳим алайҳиссалом аввалги дарсдан сабоқ олиб, Аллоҳнинг мукофотини бу гал ҳаммага эмас, балки мўминларгагина сўрамоқдалар. Асосий қоида эса ўзгармасдир: «Ким куфр келтирса, озгина ҳузур бахш этаман, сўнгра дўзах азобига мажбур қиламан ва у қандай ҳам ёмон жой!» «Озгина ҳузур» кофирлар учун бу дунёда бериладиган зоҳирий ҳузурдир. Сўнгра эса, охиратда уларни дўзах азоби кутади)"
  },
  {
    "chapter": 2,
    "verse": 127,
    "text":
        "Иброҳим билан Исмоил: «Эй Роббимиз, биздан қабул эт, албатта, Сенинг Ўзинг эшитувчи, билувчи зотсан», деб, байтнинг пойдеворларини кўтараётганини эсла"
  },
  {
    "chapter": 2,
    "verse": 128,
    "text":
        "«Роббимиз, икковимизни Ўзингга мусулмон бўлганлардан қил ва зурриётимиздан ҳам Ўзингга мусулмон уммат қил, бизга ибодатларимизни кўрсат, тавбамизни қабул эт. Албатта, Сенинг Ўзинг тавбаларни кўплаб қабул этувчи, раҳмли зотсан»"
  },
  {
    "chapter": 2,
    "verse": 129,
    "text":
        "«Роббимиз, ўзларининг ичидан уларга оятларингни тиловат қилиб берадиган, китобни ва ҳикматни ўргатадиган, уларни поклайдиган Пайғамбар юбор. Албатта, Сенинг Ўзинг азиз ва ҳикматли зотсан». (Юқоридаги оятлар Байтуллоҳнинг қурилиш жараёнини жонлантириб кўз олдимизга олиб келади. Иброҳим ва Исмоил алайҳиссаломлар Байтуллоҳни қурар эканлар, фурсатни қулай билиб, кўнгилларидаги дуоларни ҳам қилиб олдилар. Ақида иши муҳим иш, у мўмин инсон учун энг аҳамиятли масаладир. Шунинг учун аввалги оятларда аҳли ҳарамга ризқ сўраган ота-бола Пайғамбарлар энди зурриётларига Аллоҳдан иймон-ислом сўрамоқдалар. Улар яна Аллоҳдан: «Бизга ибодатларимизни кўрсат, тавбамизни қабул эт», деб сўраяптилар. Биз, «ибодатларимизни» деб таржима қилган сўз арабчада «манасикана» дейилган. «Маносик» сўзи аслида ибодат маъносини англатса ҳам, урфда ҳаж ибодатлари маъносида ишлатилади. Шунинг учун бу дуода, мана, сенинг уйингни қуряпмиз, энди уни ҳаж қилишни ҳам ўзинг ўргат, маъноси бўлади)"
  },
  {
    "chapter": 2,
    "verse": 130,
    "text":
        "Ўзини эси паст санаганларгина Иброҳимнинг миллатидан юз ўгиради. Албатта, Биз уни бу дунёда танлаб олдик ва, албатта, у охиратда солиҳлардан бўлгай"
  },
  {
    "chapter": 2,
    "verse": 131,
    "text":
        "Чунки Робби унга: «Мусулмон бўл!» деганида, у: «Оламларнинг Роббига мусулмон бўлдим», деди"
  },
  {
    "chapter": 2,
    "verse": 132,
    "text":
        "Иброҳим ўша (миллат)ни болаларига васият қилди. Яъқуб ҳам: «Эй болаларим, албатта, Аллоҳ сизларга динни танлади, сизлар мусулмон бўлмасдан туриб ўлмайсиз» деди"
  },
  {
    "chapter": 2,
    "verse": 133,
    "text":
        "Ёки Яъқубга ўлим ҳозир бўлиб, у ўз болаларига: «Мендан кейин нимага ибодат қиласизлар?» деганида, улар: «Сенинг илоҳингга ва оталаринг Иброҳим, Исмоил ва Исҳоқларнинг илоҳига, ёлғиз илоҳга ибодат қиламиз ҳамда биз Унга мусулмон бўлувчимиз», деганларида гувоҳ бўлганмисиз"
  },
  {
    "chapter": 2,
    "verse": 134,
    "text":
        "Улар бир уммат эди, ўтиб кетдилар. Уларга ўзлари касб қилганлари бўлади. Сизларга ўзингиз касб қилганингиз бўлади. Уларнинг қилган амалларидан сиз сўралмайсиз"
  },
  {
    "chapter": 2,
    "verse": 135,
    "text":
        "Улар: «Яҳудий ёки насроний бўлинг, ҳидоят топасиз», дейдилар. Балки: «Иброҳимнинг ҳаниф миллатига (динига) эргашамиз ва у мушриклардан бўлмаган», деб айт. (Яҳудий ва насронийларнинг гапи битта: униси, яҳудий бўлинг, ҳидоят топасиз, деса, буниси, насроний бўлинг, ҳидоят топасиз, дейди. Бунга жавобан эса, Аллоҳ Пайғамбаримиз Муҳаммад алайҳиссаломга: «Яхшиси ҳаммамиз–сизлар ҳам, биз ҳам Иброҳим алайҳиссаломнинг ҳаниф миллатига эргашайлик», дейишни буюрмоқда. «Ҳаниф» дегани барча ботил динларни ташлаб ҳақ дин томон бурилишни англатади)"
  },
  {
    "chapter": 2,
    "verse": 136,
    "text":
        "Айтинглар: «Аллоҳга ва бизга туширилган нарсага, Иброҳим, Исмоил, Исҳоқ, Яъқуб, асботларга туширилган нарсага, Мусо ва Ийсога берилган нарсага ва Пайғамбарларга Роббиларидан берилган нарсага иймон келтирдик. Уларнинг орасидан бирортасини фарқламаймиз ва биз Унга мусулмонлармиз». (Қуръони Каримда зикри келган «асботлар»дан мурод–Яъқуб алайҳиссаломнинг ўн икки нафар ўғлидан тарқалган зурриётлари. Демак, мусулмонлар уларнинг Пайғамбарликларига ҳам иймон келтиришлари лозим)"
  },
  {
    "chapter": 2,
    "verse": 137,
    "text":
        "Агар сиз иймон келтирганга ўхшаш иймон келтирсалар, батаҳқиқ, ҳидоят топадилар. Ва агар юз ўгирсалар, бас, албатта, улар хилофдан бошқа нарсада бўлмайдилар. Аллоҳ сенга улар (ёмонлиги)дан кифоя қилади. Ва У эшитувчи, билувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 138,
    "text":
        "Аллоҳнинг бўёғини (лозим тутинг). Аллоҳнинг бўёғидан чиройлироқ бўёқ бергувчи ким бор?! Ва биз Унга ибодат қилувчилармиз. (Оятдаги «бўёқ» калимаси рамзан динни англатади. Инсонни гўзал қилиб кўрсатадиган нарса диндир. Ҳақиқий диндор шахсда унинг аломатлари яққол кўзга ташланиб туради. Шу маънода, инсон агар гўзал бўлиш учун турли бўёқлардан–дин ва тузумлардан бирини танлаши лозим бўлса, нимани танлаши керак? Албатта, ҳеч қандай гап-сўзсиз, Аллоҳнинг бўёғини (динини) тутиши лозим. Чунки Аллоҳнинг бўёғидан (динидан) ўзга чиройлироқ бўёқ йўқ"
  },
  {
    "chapter": 2,
    "verse": 139,
    "text":
        "Айт: «Биз билан Аллоҳ ҳақида тортишасизми?! Ва ҳолбуки, У бизнинг Роббимиз ва сизнинг Роббингиз, бизнинг ўз амалларимиз бор, сизнинг ўз амалларингиз бор. Ва биз Унга мухлисмиз»"
  },
  {
    "chapter": 2,
    "verse": 140,
    "text":
        "Ёки: «Албатта, Иброҳим, Исмоил, Исҳоқ, Яъқуб ва асботлар яҳудий ва насроний бўлган», дейсизларми?! «Сизлар билимдонроқми ёки Аллоҳми?» дегин. Ҳузуридаги Аллоҳдан бўлган гувоҳликни беркитган кимсадан ҳам золимроқ одам борми?! Ва Аллоҳ қилаётган ишларингиздан ғофил эмасдир"
  },
  {
    "chapter": 2,
    "verse": 141,
    "text":
        "Улар бир уммат эдилар, ўтиб кетдилар. Уларга ўзлари касб қилганлари бўлади. Сизларга ўзингиз касб қилганингиз бўлади. Уларнинг қилган амалларидан сизлар сўралмайсизлар"
  },
  {
    "chapter": 2,
    "verse": 142,
    "text":
        "Одамлардан эси пастлари: «Буларни қиблаларидан нима юз ўгиртирди экан?» дейдилар. «Машриқу мағриб Аллоҳники, кимни хоҳласа, ўшани тўғри йўлга бошлайди», деб айт. (Ояти карима келажакда рўй берадиган муҳим бир ишнинг хабарини бермоқда. Вақти етиб, Аллоҳнинг амри ила қибла Байтул Мақдисдан Каъбаи Муаззамага ўзгартирилганда, яъни, мусулмонлар аввалги қиблани қўйиб бошқасига юз ўгирганларида, яҳудийлар–одамлардан эси пастлари, буларни қиблаларидан нима юз ўгиртирди экан, дейдилар. Бундай кўнгилсиз гаплар бўлишини аввалдан билдириб қўяётганининг бир боиси, бўлғуси ёмон таъсирни кесишдир)"
  },
  {
    "chapter": 2,
    "verse": 143,
    "text":
        "Шунингдек, сизларни одамлар устидан гувоҳ бўлишингиз ва Пайғамбар сизларнинг устингиздан гувоҳ бўлиши учун ўрта миллат қилдик. Сен аввал юзланган қиблани ортга бурилиб кетадиганлар ким-у Пайғамбарга эргашувчилар ким эканини билиш учунгина қилганмиз. Гарчи бу иш Аллоҳ ҳидоятга солганлардан бошқаларга оғир бўлса ҳам. Аллоҳ иймонингизни зое қилмайди. Албатта, Аллоҳ одамларга меҳрибон ва раҳмлидир. (Аллоҳ таоло мусулмонларни ўрта уммат қилган. Биз «ўрта» деб таржима қилган сўз арабчада «васат» деб келган ва яхши, ўрта, марказ ва адолатли маъноларини англатади. «Ўрта» маънода кўпроқ ишлатилгани учун таржимага шу маъно ихтиёр қилинди. Ўртанинг яхши дейилаётганига боис шуки, четлар чет бўлгани учун ҳам ҳар хил таъсирларга кўп учрайди ва бузилиш эҳтимоли кўпроқ. Аммо ўрта бузилмай, яхши ҳолича қолади. Ўртага адолат маъноси берилишининг сабаби эса, «ўрта» атрофларга нисбатан бир хил туради, бирор томонга оғиб, адолатни бузмайди. Оятдан, худди сизлар ўзларингиз ўрта уммат бўлганингиз учун қиблаларингизни ҳам шундоқ қилдик, деган маъно чиқади)"
  },
  {
    "chapter": 2,
    "verse": 144,
    "text":
        "Гоҳо юзингни осмонга тез-тез бурилганини кўрамиз. Бас, албатта, сени ўзинг рози бўлган қиблага қаратамиз. Юзингни Масжидул Ҳаром томон бур. Қаерда бўлсангиз ҳам, юзингизни у томон бурингиз. Албатта, китоб берилганлар уни Роббиларидан бўлган ҳақ эканини биладилар. Ва Аллоҳ уларнинг қилаётган амалларидан ғофил эмасдир"
  },
  {
    "chapter": 2,
    "verse": 145,
    "text":
        "Агар китоб берилганларга барча ҳужжатларни келтирсанг ҳам, сенинг қиблангга эргашмаслар. Сен ҳам уларнинг қибласига эргашувчи эмассан. Ва улар бир-бирларининг қибласига эргашувчи эмаслар. Агар сенга келган илмдан кейин ҳам уларнинг ҳавою нафсларига эргашсанг, унда, албатта, золимлардан бўлурсан. (Ушбу ояти каримада аҳли китобларнинг табиати, феълидаги муҳим нуқта тушунтириляпти: уларга ҳужжат-мужжат керак эмас, уларнинг Исломга нисбатан душманликлари далил ва тушунчанинг етишмаслигидан эмас, балки билиб, тушуниб туриб қилинаётган душманликдир. Аҳли китоблар қиблангга эргашмайдилар, дейилишидан ҳам қибла бутун бошли дин ва миллатнинг рамзи эканлиги кўриниб турибди)"
  },
  {
    "chapter": 2,
    "verse": 146,
    "text":
        "Китоб берилганлар уни худди болаларини танигандек танийдилар. Ва, албатта, улардан бир гуруҳлари билиб туриб ҳақни беркитадилар. (Инсон ўз боласини ҳаммадан яхши танийди. Чунки бола унинг жигарбанди, унда ўзининг қони, ҳис-туйғулари ва бутун вужуди аксини топган. Баъзи ҳолларда боланинг ўзи у ёқда турсин, ҳидидан ҳам танийди. Шунга қиёсан зарбулмасал қилиб айтиляптики, «Китоб берилганлар уни (Муҳаммад алайҳиссаломни) худди болаларини танигандек танийдилар». Чунки уларнинг муқаддас китоблари Таврот ва Инжилда охирзамон Пайғамбари ҳақида ойдин хабарлар келган. Яҳудийлардан инсофлилари ўша хабар асосида Пайғамбар алайҳиссаломга иймон келтириб, саҳобалик бахтига–муяссар бўлганлар. Лекин аҳли китоблардан бир гуруҳлари ҳақни билиб туриб, ҳасад қилишиб, беркитадилар. Шу жумладан, қибла ҳақидаги илмни ҳам. Улардаги мавжуд ҳасад ва ҳақ доимо ўзини кўрсатиб туради"
  },
  {
    "chapter": 2,
    "verse": 147,
    "text": "Бу ҳақ Роббингдандир, ҳеч-ҳеч шак қилувчилардан бўлма"
  },
  {
    "chapter": 2,
    "verse": 148,
    "text":
        "Ҳар кимнинг юзланадиган тарафи бор. У ўшанга боқади. Яхшиликларга шошилинг. Қаерда бўлсангиз ҳам, Аллоҳ сизларни жамлайди. Албатта, Аллоҳ ҳар бир нарсага қодирдир"
  },
  {
    "chapter": 2,
    "verse": 149,
    "text":
        "Қаердан чиқсанг ҳам, юзингни Масжидул Ҳаром томон бур. Ва, албатта, бу Роббингдан бўлган ҳақдир"
  },
  {
    "chapter": 2,
    "verse": 150,
    "text":
        "Ва қаердан чиқсан ҳам, юзингни Масжидул Ҳаром томон бур. Қаерда бўлсангиз ҳам, юзингизни у томонга буринг. Одамларда сизга қарши ҳужжат бўлмаслиги учун. Улардан зулм қилганларидан қўрқманглар, Мендан қўрқинглар. Ва сизга неъматимни батамом этиш учун, шоядки ҳидоят топсангиз"
  },
  {
    "chapter": 2,
    "verse": 151,
    "text":
        "Шунингдек, ичингизга ўзингиздан, сизларга оятларимизни тиловат қиладиган, сизларни поклайдиган, сизларга китобни, ҳикматни ва билмайдиган нарсаларингизни ўргатадиган Пайғамбар юбордик"
  },
  {
    "chapter": 2,
    "verse": 152,
    "text":
        "Бас, Мени эслангиз, сизни эслайман. Ва Менга шукр қилингиз, куфр қилмангиз"
  },
  {
    "chapter": 2,
    "verse": 153,
    "text":
        "Эй иймон келтирганлар! Сабр ва намоз ила мадад сўранглар. Албатта, Аллоҳ сабрлилар биландир. (Демак, мўмин-мусулмон банда мазкур қийинчиликларни енгиш учун катта миқдордаги сабрга эга бўлиши керак. Аммо ҳамма нарсанинг чегараси бўлганидек, гоҳида сабр ҳам тугаши, сусайиши мумкин, бундай ҳолатда намоз ёрдамга келади. Намоз битмас-туганмас ёрдамчи, кучга-куч, қувватга-қувват бахш этувчи, қалбга мадад берувчи, сабрга-сабр қўшувчи, сокинлик ва хотиржамлик манбаидир. У ожиз, заиф одамни қувват ва ёрдамнинг асл манбаи бўлмиш Аллоҳ таолога боғловчи воситадир)"
  },
  {
    "chapter": 2,
    "verse": 154,
    "text":
        "Аллоҳнинг йўлида қатл бўлганларни ўликлар деманг. Балки улар тирикдирлар, лекин сиз сезмайсиз"
  },
  {
    "chapter": 2,
    "verse": 155,
    "text":
        "Албата, Биз сизларни бир оз қўрқинч ва очлик билан, мол-мулкга, жонга меваларга нуқсон етказиш билан синаймиз. Ва сабрлиларга башорат бер"
  },
  {
    "chapter": 2,
    "verse": 156,
    "text":
        "Улар мусибат етганда: «Албатта, биз Аллоҳникимиз ва, албатта, биз Унга қайтувчимиз», дерлар"
  },
  {
    "chapter": 2,
    "verse": 157,
    "text":
        "Ана ўшаларга Роббиларидан саловатлар ва раҳмат бор. Ана ўшалар ҳидоят топганлардир. (Бу улкан тарбиянинг ёрқин мисолидир. Шунча синов ва машаққатларга мукофот қилиб ғалаба, нусрат ва бошқа нарсалар эмас, Аллоҳнинг саловатлари, меҳри ва шафқати ҳамда раҳмати ваъда қилинмоқда! Шунинг учун мўминлар доимо Аллоҳнинг розилигини кўзлаб иш қилишлари лозим бўлади. Бу дунёда ҳосил бўладиган баъзи бир натижалар охирги мақсад бўлиб қолмаслиги керак. Ҳатто ақиданинг ғолиб келиши ҳам юқорида айтилган мукофотнинг ўрнини боса олмайди)"
  },
  {
    "chapter": 2,
    "verse": 158,
    "text":
        "Албатта, Сафо ва Марва Аллоҳ(дини)нинг белгиларидандир. Ким Байтуллоҳни ҳаж ёки умра қилса, икковлари ўртасида саъйи қилиш гуноҳ эмас. Ким яхшиликни холисона қилса, бас, албатта, Аллоҳ шукр қилувчи ва билувчидир. (Оятда Аллоҳ таоло: «Ким Байтуллоҳни ҳаж ёки умра қилса, икковлари ўртасида саъйи қилиш гуноҳ эмас», дейди. Ушбу оят ҳужжат бўлиб шариатимизда Сафо ва Марва тепаликлари ўртасида саъйи қилиш вожиб амал, деб белгиланган. Оятда саъйи қилиш вожиб бўлади, дейиш ўрнига, «Саъйи қилиш гуноҳ бўлмайди», дейилишининг боиси шуки, иккала тепаликда бут борлиги учун, саъйи қилиш мушрикларнинг иши, гуноҳ бўлади, деб ўйлаб мусулмонлар саъйи қилмай қўйган эдилар. Шунинг учун Аллоҳ таоло гуноҳ бўлмайди, саъйи қилинглар, демоқда)"
  },
  {
    "chapter": 2,
    "verse": 159,
    "text":
        "Албатта, Биз нозил қилган равшан оятларни ва ҳидоятни одамларга китобда баён қилиб берганимиздан кейин беркитганларни–ўшаларни Аллоҳ лаънатлайди. Ва лаънатловчилар лаънатлайди"
  },
  {
    "chapter": 2,
    "verse": 160,
    "text":
        "Магар тавба қилиб, аҳли солиҳ бўлиб, баён қилганларнинг, ана ўшаларнинг тавбасини қабул қиламан. Ва Мен тавбаларни кўплаб қабул қилувчи ва раҳмлидирман"
  },
  {
    "chapter": 2,
    "verse": 161,
    "text":
        "Албатта, куфр келтирган ва кофирлик ҳолида ўлганларга–ана ўшаларга Аллоҳнинг, фаришталарнинг ва одамларнинг–барчанинг лаънати бўлгай"
  },
  {
    "chapter": 2,
    "verse": 162,
    "text":
        "Унда абадий бўлурлар. Улардан азоб енгиллатилмас. Ва уларга назар ҳам солинмас"
  },
  {
    "chapter": 2,
    "verse": 163,
    "text":
        "Ва илоҳингиз бир илоҳдир. Роҳман ва Раҳийм бўлмиш Ундан ўзга ибодатга сазовор зот йўқдир"
  },
  {
    "chapter": 2,
    "verse": 164,
    "text":
        "Албатта, осмонлару ернинг яратилишида, кечаю кундузнинг алмашиб туришида, одамларга манфаатли нарсалари ила денгизда юриб турган кемада, Аллоҳнинг осмондан сув тушириб, у билан ўлган ерни тирилтириши ва унда турли жондорларни таратишида, шамолларни йўналтиришида, осмону ер орасидаги итоатгўй булутда ақл юритувчи қавмлар учун белгилар бор. (Ушбу оятларда зикр қилинган ҳолатларни доим кўриб, уларнинг ичида яшаб юрамиз. Шу қадар кўникиб кетганмизки, алоҳида эътибор бермай қўйганмиз. Ҳолбуки, буларнинг ҳар бири Аллоҳ таолонинг борлигига катта бир далилдир. Дарҳақиқат, инсоф билан, ақлни жойига қўйиб, бир ўйлаб кўрайлик-чи: осмонлару ерни ким яратган? Осмонларнинг чегарасини ҳали биров чегаралаб билгани йўқ. Ундаги бор нарсалар, ҳамма-ҳаммасини ким яратган? Аллоҳнинг борлигини инкор қилаётган худосизларми? Ёки бошқа бирорта яратувчи борми)"
  },
  {
    "chapter": 2,
    "verse": 165,
    "text":
        "Одамлар ичида Аллоҳдан ўзга тенгдошларни тутадиганлар ва уларни Аллоҳни севгандек севадиганлар бор. Иймон келтирганларнинг Аллоҳга муҳаббатлари қаттиқдир. Зулм қилганлар азобни кўрган чоғларида, албатта, барча қувват Аллоҳга хослигини ва, албатта, Аллоҳнинг азоби шиддатли эканини билсалар эди"
  },
  {
    "chapter": 2,
    "verse": 166,
    "text":
        "У пайтда пешволар (ўзларига) эргашганлардан тонурлар ва азобни кўрурлар, уларнинг боғланишлари кесилур"
  },
  {
    "chapter": 2,
    "verse": 167,
    "text":
        "Ва эргашганлар: «Қани энди бизга бир ортга қайтиш бўлса эди, биздан тонганларидек, биз ҳам улардан тонар эдик», дерлар. Шундай қилиб, Аллоҳ уларга амалларининг ўзларига ҳасрат бўлганини кўрсатур. Ва улар дўзахдан чиқувчи эмаслар. (Қиёматдан бир кўриниш: ҳамма ўзи билан овора, биров билан бировнинг иши йўқ. Пешволар, бошлиқлар, бу дунёда бошқаларни ўз ортидан эргаштириб юрганлар ўзларига эргашганлардан тонадилар. Чунки ўзининг иши чатоқ бўлиб турганда, бошқанинг ташвиши ортиқча бўлади уларга. Азобни кўргач, ораларидаги барча боғланишлар, алоқалар, яқинликлар кесилади)"
  },
  {
    "chapter": 2,
    "verse": 168,
    "text":
        "Эй одамлар! Ер юзидаги нарсалардан ҳалол-покларини енглар. Ва шайтон изидан эргашманглар, чунки у сизларга очиқ душмандир. (Ояти карима ҳалол-пок ризқларни ейишга зид қилиб шайтоннинг изидан эргашиш қўйилмоқда. Яъни, шайтоннинг йўлида юрганларгина ҳалол-пок емайдилар, деганидир бу. Шайтон инсонларга ҳалол едирмаслик билан уларни Аллоҳнинг итоатидан чиқаради. Шайтоннинг етовига тушиб қолган нодон инсон эса, ҳалол-ҳаромни фарқламай нақадар улкан гуноҳ қилаётганини ўзи билмайди, ҳатто ҳис этмайдиган даражага тушади)"
  },
  {
    "chapter": 2,
    "verse": 169,
    "text":
        "Албатта, у сизларни ёмон ва фаҳш ишларга ҳамда Аллоҳга қарши билмаган нарсангизни гапиришингизга буюради"
  },
  {
    "chapter": 2,
    "verse": 170,
    "text":
        "Уларга: «Аллоҳ нозил қилган нарсага эргашингиз», дейилса, улар: «Йўк, биз оталаримизни нимада топсак, шунга эргашамиз», дейдилар. Оталари ҳеч нарсага ақли етмаган ва ҳидоят топмаган бўлсалар ҳам-а"
  },
  {
    "chapter": 2,
    "verse": 171,
    "text":
        "Куфр келтирганлар мисоли худди қичқириқ ва сасдан бошқа нарсани эшитмайдиганларга бақираётганга ўхшайди. Улар кар, соқов ва кўрдирлар. Улар ақл ишлатмаслар. (Аллоҳ таоло бу ояти каримада кофирларни чўпонни овозини эшитиб, маъносини тушинмайдиган чорва ҳайвонларига, Пайғамбарларни уларни ҳайдаб юрувчи чўпонга ўхшатмоқда)"
  },
  {
    "chapter": 2,
    "verse": 172,
    "text":
        "Эй иймон келтирганлар! Сизларга ризқ қилиб берганимиз пок нарсалардан енглар ва Аллоҳга шукр қилинглар, агар Унга ибодат қиладиган бўлсаларингиз"
  },
  {
    "chapter": 2,
    "verse": 173,
    "text":
        "Албатта, У зот сизларга фақат ўлимтикни, қонни, чўчқанинг гўштини ва Аллоҳдан бошқага сўйилганни ҳаром қилди. Кимки мажбур бўлса-ю, зулм қилмай, ҳаддан ошмай (еса), унга гуноҳ бўлмайди. Албатта, Аллоҳ мағфиратли ва раҳмлидир. (Саъд ибн Аби Ваққос розийаллоҳу анҳу Пайғамбаримиз алайҳиссаломга: «Эй Аллоҳнинг Расули, дуо қилинг, Аллоҳ мени дуоси қабул бўладиганлардан қилсин», дедилар. Шунда Пайғамбар алайҳиссалом: «Эй Саъд, таомингни ҳалол қил, дуоси қабул бўладиган бўласан. Муҳаммаднинг жони қўлида бўлган зот билан қасамки, бир одам ҳаром луқмани қорнига ташласа, Аллоҳ унинг дуосини қирқ кунгача қабул қилмайди. Қайси банданинг гўшти ҳаромдан ва рибодан ўсса, унга дўзах муносибдир», дедилар)"
  },
  {
    "chapter": 2,
    "verse": 174,
    "text":
        "Албатта, Аллоҳ китобда туширган нарсани беркитганлар ва уни озгина баҳога сотганлар, ана ўшалар қоринларига оловдан бошқа нарсани емаслар, уларга Аллоҳ қиёмат куни гапирмас ва уларни покламас. Уларга аламли азоблар бор. (Ибн Аббос розийаллоҳу анҳудан ривоят қилинадики, у киши: «Ушбу оят яҳудийларнинг Каъб ибн Ашраф, Молик ибн ас-Сойф ва Ҳаййи ибн Ахтобга ўхшаш бошлиқлари ҳақида тушган. Улар ўзларига эргашганлардан ҳадялар олар эдилар. Муҳаммад алайҳиссалом Пайғамбар этиб юборилганларидан сўнг, мазкур манфаатлардан маҳрум бўлишдан қўрқиб, у киши ҳақидаги ҳақиқатни беркитдилар», дедилар)"
  },
  {
    "chapter": 2,
    "verse": 175,
    "text":
        "Ана ўшалар адашувни ҳидоятга, азобни мағфиратга сотиб олганлардир. Дўзах ўтига қандоқ чидайдилар-а"
  },
  {
    "chapter": 2,
    "verse": 176,
    "text":
        "Бунинг сабаби, албатта, Аллоҳ китобни ҳақ билан нозил қилган эди. Китоб хусусида ихтилоф қилганлар эса, тубсиз тортишувдадирлар. (Қўлларидаги ҳидоят ва мағфиратни бой бериб, қаттиқ азобга дучор бўлишларининг сабаби–улар «Аллоҳ китобни ҳақ билан нозил қилган»ини тан олмадилар. Ҳолбуки, бу ҳақ китобга амал қилиб, бахт-саодатда яшасалар бўлар эди. Аммо улар Аллоҳнинг китоби хусусида ихтилоф қилдилар, тубсиз талашув ва туганмас ихтилоф гирдобига тушиб қолдилар. Оқибатда мазкур азобларга дучор бўлдилар)"
  },
  {
    "chapter": 2,
    "verse": 177,
    "text":
        "Яхшилик юзингизни машриқ ёки мағриб томонга буришингизда эмас. Лекин яхшилик ким Аллоҳга, охират кунига, фаришталарга, китобга, Пайғамбарларга иймон келтирса ва яхши кўрган молини қариндошларга, етимларга, мискинларга, ватангадоларга, тиланчиларга, қул озод қилишга берса, намозни қоим қилса, закот берса. Аҳд қилганда аҳдига вафо қилувчилар, камбағаллик, қийинчилик пайтида ва шиддат вақтида ҳам сабр қилувчиларга, ана ўшалар содиқ бўлганлардир. Ана ўшалар тақводорлардир"
  },
  {
    "chapter": 2,
    "verse": 178,
    "text":
        "Эй иймон келтирганлар! Сизга ўлдирилганлар учун қасос фарз қилинди: ҳурга ҳур, қулга қул, аёлга аёл. Кимга ўз биродаридан бир нарса афв қилинса, бас, яхшилик ила сўралсин ва адо этиш ҳам яхшиликча бўлсин. Бу Роббиларингиздан енгиллик ва раҳматдир. Ундан кейин ким душманлик қилса, унга аламли азоб бор. (Бу ояти каримада Аллоҳ таоло қасос олишда адолат бўлишини, ҳаддан ошмасликни уқдириб, «ҳурга ҳур, қулга қул, аёлга аёл», деб тушунтирмоқда. Лекин ояти каримага биноан, одам ўлдирган шахсни қасос учун, албатта, ўлдириш шарт эмас, балки ўликнинг эгалари кечиб юборса, ўлдирмай қўйиб юборса, ўрнига хун пули олса ҳам бўлади. Бунда ўлик эгаси ҳақини яхшилик билан сўраши лозим, айбдор тараф ҳам уларнинг ҳақини яхшилик билан адо этиши зарур)"
  },
  {
    "chapter": 2,
    "verse": 179,
    "text":
        "Сизларга қасос олишда ҳаёт бор. Эй ақл эгалари! Шоядки тақводор бўлсангиз. (Бу ояти карима қасоснинг шариатга киритилишининг ҳикматини баён қилмоқда. Демак, қасос олишда кишилар учун ҳаёт бор экан. Қасос қалбдаги нафратни қондириш эмас, балки олий мақсад–ҳаёт учун экан. Қасос олиш йўлга қўйилса, инсон ҳаётини сақлаб қолишда катта иш қилинган бўлади. Чунки ҳар бир одам бошқа бировни ўлдирса, қасосига ўзининг ҳам ўлдирилишини билади ва ҳеч қачон одам ўлдиришга қўл урмайди)"
  },
  {
    "chapter": 2,
    "verse": 180,
    "text":
        "Сизлардан бирортангизга ўлим келганда, агар у бойлик қолдираётган бўлса, ота-онаси ва яқинларига тўғрилик билан васият қилиш тақводорларнинг бурчи сифатида фарз қилинди. (Бу ояти карима мерос ҳақидаги оятдан аввал тушган, кейинчалик мерос ояти тушиб, васият қилмаса ҳам, ўлгандан қолган мол мерос сифатида яқин кишиларга бўлиб берилиши баён қилинди. Ўша оятда кимга қанча тегиши ҳам айтилди. Ота-она меросхўрлар қаторига кирдилар)"
  },
  {
    "chapter": 2,
    "verse": 181,
    "text":
        "Ким уни эшитгандан сўнг ўзгартирса, бас, гуноҳи фақат ўзгартирганларнинг ўзига бўлади. Албатта, Аллоҳ эшитувчи ва билувчидир. (Яъни, ўлаётган одамнинг васиятини эшитган одам у ўлгач, васиятини ўзгартириб, мол-дунёсининг васиятга мувофиқ тақсимланмаслигига сабаб бўлса, гуноҳкорлардандир. Гуноҳ васият қилувчи ёки васият қилинган кишига эмас, балки ўша ўзгартирувчининг ўзига бўлади. Аллоҳ эшитувчи ва билувчи зотдир)"
  },
  {
    "chapter": 2,
    "verse": 182,
    "text":
        "Кимки васият қилувчидан тойилиш ёки гуноҳ содир бўлишидан қўрқса, бас, уларнинг орасини ислоҳ қилса, унга гуноҳ бўлмайди. Албатта, Аллоҳ мағфиратли ва раҳмли зотдир. (Биз «тойилиш» деб таржима қилган сўз ояти каримада «жанафан» дейилган. Бу сўз хато қилиб ҳақдан бурилишни билдиради. Яъни, билмасдан. «Гуноҳ» эса, билиб туриб ҳақсизлик қилишдир. Демак, васият қилувчи билибми-билмайми нотўғри васият қилган бўлса, унинг васиятини бузган одам бундан аввалги оятда келгани каби гуноҳкор бўлмайди. Мисол учун, бир одам молининг учдан бири миқдоридан кўпини васият қилиб юборса, васияти фақат учдан бирига ўтади, қолганига амал қилмаган одам гуноҳкор бўлмайди)"
  },
  {
    "chapter": 2,
    "verse": 183,
    "text":
        "Эй иймон келтирганлар! Сизлардан аввалгиларга фарз қилганидек, сизларга ҳам рўза фарз қилинди. Шоядки тақводор бўлсангиз"
  },
  {
    "chapter": 2,
    "verse": 184,
    "text":
        "Саноқли кунлар. Сизлардан ким бемор ёки мусофир бўлса, бас, саноғини бошқа кунларда тутади. Уни қийналиб тутадиганлар зиммасида бир мискин таоми фидя лозимдир. Ким яхшиликни ўз ихтиёри ила қилса, ўзи учун яхшидир. Агар билсангиз, рўза тутмоғингиз сиз учун яхшидир"
  },
  {
    "chapter": 2,
    "verse": 185,
    "text":
        "Рамазон ойики, унда одамларга ҳидоят ҳамда ҳидояту фурқондан иборат очиқ баёнотлар бўлиб, Қуръон туширилгандир. Сиздан ким у ойда ҳозир бўлса, рўзасини тутсин. Ким бемор ёки сафарда бўлса, бас, саноғини бошқа кунлардан тутади. Аллоҳ сизларга енгилликни хоҳлайди ва сизларга қийинчиликни хоҳламайди. Саноғини мукаммал қилишингиз ва сизни ҳидоятга бошлаган Аллоҳни улуғлашингиз учун. Шоядки шукр қилсаларингиз. (Аллоҳ таоло Ўзининг абадий мўъжизаси, қиёматгача инсониятга ҳидоят бўладиган китоби Қуръони Каримни тушириш вақти қилиб Рамазони шариф ойини ихтиёр қилганининг ўзи бу ойнинг фазилатини юксакка кўтарган. Энди эса, нур устига нур, фазилат устига фазилат қўшиб, рўза ибодатини ҳам шу Рамазон ойида тутишни фарз қилмоқда)"
  },
  {
    "chapter": 2,
    "verse": 186,
    "text":
        "Агар бандаларим сендан Мени сўрасалар, Мен, албатта, яқинман. Дуо қилгувчи дуо қилганда ижобат қиламан. Бас, Менга ҳам ижобат қилсинлар ва иймон келтирсинлар. Шоядки тўғри йўлни топсалар. (Абдуллоҳ ибн Амр розийаллоҳу анҳудан имом Аҳмад Ривоят қиладиларки, Пайғамбаримиз алаҳиссалом: «Қалблар идишга ўхшайди. Баъзилари баъзисидан кўпроқ жойлаштиради. Агар Аллоҳдан бирор нарса сўрайдиган бўлсангиз, ижобат бўлишига қаттиқ ишониб сўранг. Ғофил қалб билан дуо қилган банданинг дуосини Аллоҳ қабул қилмайди», дедилар. Имоми Бухорий Абу Ҳурайра розийаллоҳу анҳудан ривоят қилган ҳадисда, Пайғамбаримиз алайҳиссалом: «Агар банда шошилишмаса, дуосига ижобат бўлади. Дуо қилдим, қабул бўлмади, демасин», деганлар)"
  },
  {
    "chapter": 2,
    "verse": 187,
    "text":
        "Сизларга рўза кечасида хотинларингизга яқинлик қилиш ҳалол қилинди. Улар сизга либосдир, сиз уларга либосдирсиз. Аллоҳ сизнинг ўзингизга ҳиёнат қилаётганингизни билди, тавбангизни қабул этди ва сизларни афв этди. Энди уларга яқинлашаверинг ва Аллоҳ сизга ёзган нарсани талаб қилинг. Тонг пайтида оқ ип қора ипдан ажрагунча еб-ичаверинг. Сўнгра рўзани кечасигача батамом қилинг. Масжидларда, эътикофдалигингизда уларга яқинлик қилманг. Булар Аллоҳнинг чегараларидир, унга яқинлашманг. Аллоҳ одамларга Ўз оятларини шундоқ баён этади. Шоядки тақво қилсалар. («Эътикоф» сўзи бир нарсани лозим тутиш маъносини билдиради. Шариатда эса, масжитда Аллоҳга яқинлик ҳосил қилиш ниятида ибодатни лозим тутишга айтилади. Пайғамбаримиз алайҳиссолату вассалам Рамазони шарифнинг охирги ўн кунлигида эътикофда ўтирар эдилар. Эътикоф ўтирган одам иложи борича масжиддан чиқмай ибодат билан машғул бўлади. Унда банда Аллоҳ учун ҳамма нарсадан ажраб чиқади. Шунинг учун аёлларга яқинлик қилишдан ҳам ўзини тияди. Ушбу зикр қилинган нарсаларнинг барчаси Аллоҳ таолога боғлиқ нарсалар, Унинг чегаралари. Аллоҳ уларга яқинлашмасликка буюрмоқда, чунки чегарага қанча яқинлашилса, чегарани бузиш эҳтимоли шунча кўпаяди)"
  },
  {
    "chapter": 2,
    "verse": 188,
    "text":
        "Бир-бирларингизнинг молларингизни ботил йўл билан еманг. Билиб туриб одамларнинг молларидан бир қисмини ейишингиз учун уни ҳокимларга гуноҳкорона ташламанг. (Имом Қуртубий деганларки: «Оятдаги «ботил йўл билан емаслик»ка ҳаромнинг барча турлари киради. Қимор, алдамчилик, ҳаром нарсаларни сотиб мол топишлик, ҳаром касбларни қилиб мол топишлик ва бошқалар»)"
  },
  {
    "chapter": 2,
    "verse": 189,
    "text":
        "Сендан ҳилоллар ҳақида сўрарлар. «Улар одамлар ва ҳаж учун вақт ўлчовидир», деб айт. Яхшилик уйларнинг орқасидан киришингизда эмас, лекин яхшилик, ким тақводорлик қилса, шундадир. Ва уйларга эшикларидан киринг. Аллоҳга тақво қилинг. Шоядки нажот топсангиз. (Ҳажга боғлиқ улуғ рукнлар кунини ва яна бошқа вақтларни аниқлаш учун, албатта, ҳилолга қаралади ва вақт унинг чиқишидан белгиланади. Демак, ҳаж ва ҳилолда ўзаро боғлиқлик бор. Шу боғлиқлик туфайли ҳилол ҳақида жавоб тушган оят ҳажга боғлиқ яна бир масалани ҳам ойдинлаштиради. Имом Бухорий ва Имом Муслимлар саҳиҳ китобларида ал-Барро розийаллоҳу анҳудан ривоят қиладиларки: «Ансорийларда (мадиналик мусулмонларда) ҳаждан қайтиб келганда уйнинг эшигидан кирмаслик одат бор эди. Улардан бир киши ҳаждан қайтганда уйининг эшигидан кирибди. Бу иши унга айб қилгандек қаралишига сабаб бўлибди. Шунда «Яхшилик уйларнинг орқасидан киришингизда эмас...», ояти тушди», деганлар"
  },
  {
    "chapter": 2,
    "verse": 190,
    "text":
        "Сизга уруш қилаётганларга қарши Аллоҳнинг йўлида уруш қилинг. Ва тажовузкор бўлманг. Албатта, Аллоҳ тажовузкор бўлганларни хуш кўрмас"
  },
  {
    "chapter": 2,
    "verse": 191,
    "text":
        "Уларни топган ерингизда қатл қилинг. Ва сизларни чиқарган жойдан уларни ҳам чиқаринг. Фитна қатл этишдан ёмонроқдир. Масжидул Ҳаром олдида сизга қарши урушмагунларича, сиз урушманг. Агар урушсалар, бас, сиз ҳам урушинг. Кофирларнинг жазоси шундай"
  },
  {
    "chapter": 2,
    "verse": 192,
    "text": "Агар тўхтасалар, албатта, Аллоҳ мағфиратли ва раҳмлидир"
  },
  {
    "chapter": 2,
    "verse": 193,
    "text":
        "Фитна бўлмаслиги ва дин Аллоҳга бўлиши учун улар билан жанг қилинг. Агар тўхтасалар, золимлардан бошқаларга душманлик йўқ"
  },
  {
    "chapter": 2,
    "verse": 194,
    "text":
        "Ҳаром ойга ҳаром ой. Ҳаром қилинган нарсаларда қасос бор. Ким сизга душманлик қилса, сиз ҳам унга шунга ўхшаш душманлик қилинг. Ва Аллоҳга тақво қилинг ҳамда, билингки, албатта, Аллоҳ тақводорлар биландир. (Ояти каримадаги «Аш-шаҳрул-ҳарому» деб келган таъбирни «ҳаром ой» деб таржима қилдик. «Ҳаром ой» дегани уруш ҳаром қилинган ой, деганидир. «Ҳаром ойга ҳаром ой», яъни, ким уруш ҳаром қилган ойнинг ҳурматини бузса, унга бу ой берган ҳурматлар бекор қилинади. Агар у бу ойни ҳурмат қилмай уруш бошласа, унга қарши уруш қилинади. Мусулмонларга қарши уруш очиб, ҳаром қилинган нарсани бузиб тажовузкорлик қилганлардан ўч олинади. Аммо ўч олишда маълум чегара бўлиб, мусулмонлар ундан чиқмайдилар. Қилган душманлигига яраша жавоб қилинади, ошириб юборилмайди ёки камайтириб қўйилмайди)"
  },
  {
    "chapter": 2,
    "verse": 195,
    "text":
        "Ва Аллоҳнинг йўлида нафақа қилинг. Ўзингизни ҳалокатга дучор қилманг. Эҳсон қилинг, албатта. Аллоҳ эҳсон қилувчиларни хуш кўради. (Бу ояти каримада Аллоҳ таоло мусулмонларни ўзининг йўлида пул-мол нафақа қилишга амр қилмоқда. Бунга жиҳод учун ҳам, бошқа хайрли ишлар учун ҳам нафақа қилиш киради. «Ўзингизни ҳалокатга дучор қилманг» жумласида бир неча хил маъно бор. Бири: Аллоҳнинг йўлида нафақа қилмай, ўзингизни ҳалокатга дучор қилманг. Яъни, бахиллигингиз ҳалокатга сабаб бўлмасин, дегани. Яна бир маъноси: ўзингизни ўзингиз ўлдирманг. Бир киши ўзининг ўлимига ўзи сабаб бўлса, ўзини ўзи ўлдирди, дейилади)"
  },
  {
    "chapter": 2,
    "verse": 196,
    "text":
        "Аллоҳ учун ҳаж ва умрани тугал адо этинг. Агар ушланиб қолсангиз, муяссар бўлганича қурбонлик қилинг. Қурбонлик ўз жойига емагунча, сочингизни олдирманг. Сиздан ким бемор бўлса ёки бошида озор берувчи нарса бўлса, рўза тутиш ёки садақа бериш ёхуд қурбонлик сўйиш ила тўлов тўласин. Агар тинч бўлсангиз, ким умрадан ҳажгача ҳузур қилган бўлса, муяссар бўлган қурбонликни қилсин. Ким топмаса, уч кун ҳажда, етти кун қайтганингизда–ҳаммаси ўн кун тўлиқ рўза тутсин. Бу аҳли Масжидул Ҳаромда яшамайдиганлар учун. Ва Аллоҳга тақво қилинг ҳамда, билингки, албатта, Аллоҳ иқоби шиддатли зотдир"
  },
  {
    "chapter": 2,
    "verse": 197,
    "text":
        "Ҳаж маълум ойлардир. Кимки уларда ўзига ҳажни фарз қилса, ҳажда шаҳвоний нарсалар, фисқ ва жанжал йўқдир. Нима яхшилик қилсангиз, Аллоҳ уни билади. Озуқа олинг, энг яхши озуқа тақводир. Менга тақво қилинг, эй ақл эгалари! (Ўзига ҳажни фарз қилиш–ҳажни ният қилиб, иҳромга кириш деганидир. Демак, ундай одамга шаҳвоний ишлар, яъни, жинсий яқинлик ва унинг ҳақидаги гап-сўзларни сўзлаш мумкин бўлмайди. Фисқ–катта-кичик гуноҳ ишларни қилиш. Жанжал–одамлар билан талашиб-тортишиш ва сўкишиб, аччиқ чиқариш. Бу ишлар ҳам мумкин эмас. Чунки ҳаж қилувчи инсон улуғ мақомга эришган бўлади. У дунёнинг ҳаммасидан юз ўгириб, ажраб, Аллоҳга юзланади, Роббул Оламийннинг уйини зиёрат қилгани чиққан бўлади. Шу боис олий даражадаги одоб билан одобланиши зарур. Ҳамма ёмон нарсаларни тарк этиб, яхши ишларни кўпроқ қилиши лозим)"
  },
  {
    "chapter": 2,
    "verse": 198,
    "text":
        "Сизга ўз Роббингиздан фазл исташингизда гуноҳ йўқдир. Арофатдан қайтиб тушганингизда, Аллоҳни машъарул ҳаромда зикр қилинг. Илгари адашганлардан бўлсангиз ҳам, сизни ҳидоятга бошлагани учун Уни зикр қилинг. (Оятда зикр қилинган «фазл» сўзи ризқ, касб маъносини англатади. Одамлар ўртасида ҳажга борган киши тижорат билан ёки бошқа бирор касб билан шуғулланса бўлмайди, деган тушунча бор эди. Имом Насафий ривоят қилишларича, бир қавм: «Ҳаммоллик ва тожирлик қилган одамнинг ҳажи ҳаж бўлмайди», деган гапни тарқатганида, шу оят нозил бўлган экан. Шунга ўхшаш маънолар бошқа ривоятларда ҳам келган. Имом Аҳмад қилган ривоятда, Абу Умома айтадиларки: «Абдуллоҳ ибн Умардан, биз кирага ишлаймиз, ҳаж қилсак бўларми?» деб сўрасам, «Байтуллоҳни тавоф қилиб, Арофатда вуқуф қилиб, тош отиб, сочингизни олдирасизми?» деди. «Албатта» дедим. У киши: «Бир одам Расулуллоҳнинг ҳузурларига келиб, сен ҳозир мендан сўраган нарсани сўраган эди, жавоб бермай турдилар. Сўнг Жиброил «Сизга ўз Роббингиздан фазл исташингизда гуноҳ йўқдир», деган оятни олиб тушди, дедилар. Илгари мусулмонлар Исломдан олдинги ҳаётлари билан мусулмон бўлганларидан кейинги ҳаётларини солиштириб кўриб, бу улуғ неъматларни тушуниб етар эдилар ва уни берган Аллоҳга шукр қилар эдилар)"
  },
  {
    "chapter": 2,
    "verse": 199,
    "text":
        "Сўнгра одамлар қайтиб тушган жойдан тушинглар. Ва Аллоҳга истиғфор айтинглар. Албатта, Аллоҳ мағфиратли, раҳмли зотдир"
  },
  {
    "chapter": 2,
    "verse": 200,
    "text":
        "Ибодатларингизни тугатганигизда, Аллоҳни оталарингизни эслагандек, балки ундан ҳам кучлироқ эсланг. Одамлардан баъзилари: «Роббимиз бизга бу дунёда бергин», дейди ва унга охиратда насиба йўқдир"
  },
  {
    "chapter": 2,
    "verse": 201,
    "text":
        "Ва улардан баъзилари: «Роббимиз, бизга бу дунёда ҳам яхшиликни, охиратда ҳам яхшиликни бергин ва бизни дўзах олови азобидан сақлагин», дейди"
  },
  {
    "chapter": 2,
    "verse": 202,
    "text":
        "Ана ўшаларга қилган касбларидан насиба бор. Ва Аллоҳ тез ҳисоб қилувчидир"
  },
  {
    "chapter": 2,
    "verse": 203,
    "text":
        "Аллоҳни саноқли кунларда эсланг. Бас, ким икки кундан кейин шошилиб, кетса, унга гуноҳ йўқ. Ким кечикиб қолса, унга гуноҳ йўқ. Тақво қилувчилар учун. Аллоҳга тақво қилинглар ва, билингларки, албатта сиз Унга тўпланурсиз. (Пайғамбаримиз алайҳиссалом: «Арафа, қурбонлик ва ташриқ кунлари биз аҳли Исломнинг байрами–емоқ, ичмоқ кунларидир», деганлар. Шундан чиқадики, арафа ва қурбон ҳайити кунлари ташриқ кунлари қаторига кирмайди. Ушбу оятда Аллоҳ таоло саноқли кунларда, яъни, ташриқ кунларида Ўзини эслашга, зикр қилишга буюрмоқда. Икрима розийаллоҳу анҳудан ривоят қилинадики: «Саноқли кунларда Аллоҳни эсланг», дегани ташриқ кунларида фарз намозларидан кейин, «Аллоҳу акбар», «Аллоҳу акбар», деб такбир айтинг, деганидир»)"
  },
  {
    "chapter": 2,
    "verse": 204,
    "text":
        "Одамлар ичида дунё ҳаётидаги гапи сени ажаблантирадиганлари бор. У қалбидаги нарсага Аллоҳни гувоҳ ҳам қилади. Ҳолбуки, у ашаддий хусуматчидир"
  },
  {
    "chapter": 2,
    "verse": 205,
    "text":
        "Ва бурилиб кетганда, ер юзида фасод учун ҳамда экин ва насилни ҳалок қилиш учун ҳаракат этади. Ва ҳолбуки, Аллоҳ фасодни хуш кўрмас"
  },
  {
    "chapter": 2,
    "verse": 206,
    "text":
        "Агар унга, Аллоҳдан қўрқгин, дейилса, уни кибру ҳавоси гуноҳга етаклайди. Жаҳаннам унга етарлидир. У қандай ҳам ёмон ўрин-а"
  },
  {
    "chapter": 2,
    "verse": 207,
    "text":
        "Ва одамлардан Аллоҳнинг розилигини тилаб жонини сотадиганлар бор. Ва Аллоҳ бандаларга меҳрибондир. (Бу ҳақиқий мухлис мўминнинг васфи. Унинг ягона мақсади–Аллоҳнинг розилигини топиш. Бу йўлда у ҳамма нарсани сарфлашга, ҳатто жонини беришга ҳам тайёр. Фақат Аллоҳ таолонинг розилигини топса бўлди)"
  },
  {
    "chapter": 2,
    "verse": 208,
    "text":
        "Эй иймон келтирганлар! Исломга тўлиғича киринг. Ва шайтоннинг изидан эргашманг. Албатта, у сизга очиқ душмандир"
  },
  {
    "chapter": 2,
    "verse": 209,
    "text":
        "Агар очиқ баёнотлар келгандан кейин ҳам тойилсангиз, билингки, албатта, Аллоҳ азиз ва ҳикматлидир"
  },
  {
    "chapter": 2,
    "verse": 210,
    "text":
        "Улар Аллоҳ ва фаришталар сояли булутларда келиши ҳамда ишнинг тугашидан бошқага интизор бўлмаяптилар шекилли?! Ва барча ишлар Аллоҳга қайтажак. (Очиқ-ойдин баёнотлар, ҳужжат ва далиллар келгандан кейин ҳам Исломга юрмай, шайтоннинг изидан юришларидан улар худди қиёматни интизор бўлиб кутаётганга ўхшайди. Иш тугаб, ҳамма нарса охирига етадиган кунни кутаётганга ўхшайди. Бўлмаса, ҳамма нарса аниқ бўлган бўлса ҳам, нима учун Исломга кирмай турибдилар? Нима уларнинг йўлини тўсяпти? Улар билиб қўйсинларки, «барча ишлар Аллоҳга қайтажак»)"
  },
  {
    "chapter": 2,
    "verse": 211,
    "text":
        "Бани Исроилдан уларга қанча оятларни берганимизни сўра. Кимки ўзига келган Аллоҳнинг неъматини ўзгартирса, бас, албатта, Аллоҳ иқоби қаттиқ зотдир"
  },
  {
    "chapter": 2,
    "verse": 212,
    "text":
        "Куфр келтирганларга бу дунё ҳаёти зийнатланди ва улар иймон келтирганларни масхара қиладилар. Ва ҳолбуки, қиёмат куни тақво қилганлар улардан устундир. Аллоҳ кимни хоҳласа, беҳисоб ризқ беради. (Кофирларнинг Аллоҳ йўлига юрмасликларининг сабаби дунё ҳаётининг зийнатидир. Уларнинг бирдан бир мақсади, фикри-зикри ва орзу-умиди–шу беш кунлик дунёнинг ҳой-ҳаваси, зийнатидир. Кофирлар ҳаётнинг маъносини шунда, деб тушунадилар. Иймонсиз бўлганлари учун ҳайвоний тасаввур ва чегарадан ташқарига чиқа олмайдилар. Мўмин киши учун эса, бу дунёнинг зийнати ҳақир ва аҳамиятсиз нарса ҳисобланади. Улар дунё ҳой-ҳавасига ўч бўлишни ўзларига ор ҳисоблайдилар. Ҳақиқий ҳаёт–охират ҳаёти келган чоқда эса, ҳамма нарса ўз ўрнига тушади. Ўшанда, яъни, қиёмат кунида мўминлар, тақво қилганлар кофирлардан устун бўладилар. Ризқи рўзга келадиган бўлсак, уни Аллоҳ таоло кимга хоҳласа, беҳисоб беради. Ризқ берувчи Унинг Ўзи. Мўминга ҳам, кофирга ҳам бераверади)"
  },
  {
    "chapter": 2,
    "verse": 213,
    "text":
        "Одамлар бир миллат эдилар. Бас, Аллоҳ хушхабар ва огоҳлантириш берувчи Набийларни юборди ва уларга одамлар ўртасида, улар ихтилоф қилган нарсаларда ҳукм қилиш учун ҳақ китоб туширди. У тўғрисида ихтилофни очиқ ҳужжатлар келгандан сўнг, кимга берилган бўлса, ўшаларгина ҳаддан ошиб қилдилар. Иймон келтирганларни ҳақ тўғрисида ихтилоф қилган нарсаларида Аллоҳ Ўз изни ила ҳидоятга солади. Аллоҳ кимни хоҳласа, тўғри йўлга бошлайди. (Аллоҳ ирода қилган тўғри йўл Исломга тўлиғича кириш билан бўлади. Буни амалга ошириш учун шайтоннинг изидан юрганлар, ҳасад, тамаъ, ҳирс ва ҳавою нафс туфайли ҳақ китоб тўғрисида ихтилофга тушганлар билан бўладиган тўқнашувларда ғолиб келиш керак. Улардан бўладиган зулм ва душманликларга чидаш керак)"
  },
  {
    "chapter": 2,
    "verse": 214,
    "text":
        "Сиздан аввал ўтганларга келганга ўхшаш нарса сизларга келмасдан туриб, жаннатга кирамиз, деб ўйладингизми? Уларни бало ва мусибатлар тутган ва ларзага туширилганлар. Ҳаттоки, Пайғамбар ва у билан иймон келтирганлар: «Аллоҳнинг нусрати қачон бўлади?» деганлар. Огоҳ бўлинглар, албатта, Аллоҳнинг нусрати яқиндир. (Демак, жаннатга кириш осон эмас, иймон, Исломни оғизда эълон қилиб қўйиш билангина бўлавермайди. Жаннатга киришнинг бир шарти–аввалги умматлардан унга киришга ҳақдор бўлганларга юборилган оғир синовларни бошдан ўтказиш зарур)"
  },
  {
    "chapter": 2,
    "verse": 215,
    "text":
        "Сендан нимани нафақа қилишни сўрарлар. Сен: «Нафақа қилган яхшилигингиздан ота-оналарга, яқин кишиларга, етимларга, мискинларга ва ватангадоларга бўлсин. Қандай яхшилик қилган бўлсангиз, албатта, Аллоҳ уни билувчидир», деб айт"
  },
  {
    "chapter": 2,
    "verse": 216,
    "text":
        "Сизга ёқмаса ҳам, жанг қилишингиз фарз қилинди. Шоядки ёқтирмаган нарсангиз сиз учун яхши бўлса. Ва шоядки ёқтирган нарсангиз сиз учун ёмон бўлса. Аллоҳ билади, сиз билмайсиз. (Аллоҳ таоло бандаларининг ҳамма ҳолатларини яхши билади. Уларнинг жангни ёқтирмасликларини ҳам билади. Инсоннинг табиати шундоқ: машаққатни, қийинчиликни ёқтирмайди. Лекин Ислом одамларга ёқадиган нарсаларни эмас, балки уларга фойда, икки дунёда бахт–саодат келтирадиган амалларни таклиф қилади. Инсонга ёқмайдиган жанг, нафақа каби нарсалар аслида ўзи учун яхши бўлади. Шунингдек, урушга бормай уйда ўтириши каби ўзига яхши кўринган нарсалар аслида унинг учун ёмонлик бўлиши мумкин. Бундай ишларнинг оқибатини Аллоҳ билади, банда билмайди)"
  },
  {
    "chapter": 2,
    "verse": 217,
    "text":
        "Сендан ҳаром ойда уруш қилиш ҳақида сўрайдилар. Сен: «Унда уруш қилиш катта гуноҳ. Аллоҳнинг йўлидан тўсиш, унга куфр келтириш, Масжидул Ҳаромдан тўсиш, унинг аҳлини ундан чиқариш Аллоҳнинг ҳузурида энг катта гуноҳдир. Фитна ўлдиришдан каттароқдир», деб айт. Улар агар қодир бўлсалар, сизларни динингиздан қайтаргунларича сизга қарши уруш қилаверадилар. Сиздан кимки диндан қайтиб, кофир ҳолида ўлиб кетса, ана ўшалар бу дунёю охиратда амали ҳабата бўлганлардир. Ана ўшалар дўзах эгаларидир. Улар унда абадий қолгувчилардир"
  },
  {
    "chapter": 2,
    "verse": 218,
    "text":
        "Албатта, иймон келтирганлар, ҳижрат қилганлар ва Аллоҳнинг йўлида жиҳод қилганлар–ана ўшалар Аллоҳнинг раҳматини умид қиладилар. Аллоҳ мағфиратли ва раҳмли зотдир. (Ҳукм умумий: ким бўлишидан қатъий назар, иймон келтирса. мўминлик сифатига эришса, динию диёнатини сақлаб қолиш ниятида ҳижрат қилса, Аллоҳнинг йўлида жиҳод қилса, улар Аллоҳнинг раҳматидан умид қиладилар. Аллоҳнинг раҳмати уларга бўлмаса, кимга бўлар эди)"
  },
  {
    "chapter": 2,
    "verse": 219,
    "text":
        "Сендан хамр ва қимор ҳақида сўрарлар. Сен: «Иккисида катта гуноҳ ва кишилар учун манфаат бор ва гуноҳлари нафларидан каттадир», деб айт. Ва сендан нимани нафақа қилишни сўрарлар. Сен: «Ортиқчасини», деб айт. Аллоҳ шундоқ қилиб сизга Ўз оятларини баён қилади. Шоядки тафаккур қилсангиз. (Оятдаги «хамр» сўзини ичкилик, ароқ ёки вино деб таржима қилмадик. Чунки «хамр» сўзи умумий бўлиб, истеъмол қилган кишининг ақлини тўсувчи, яъни, бир оз бўлса-да таъсир ўтказувчи барча нарсага айтилади. Бунинг ичига наша, қорадори, кўкнори ва бошқалар ҳам киради. Дунёда адолат ўрнатиш, ер юзида Аллоҳнинг халифаси бўлиш вазифаси юклатилган шахс ароқхўр ёки қиморбоз ва молини ноўрин сарфлайдиган бўлиши мумкинми? Албатта, йўқ. Ҳолбуки, хамр ичиш, қимор ўйнаш ва ноўрин нафақа қилиш ҳоллари жоҳилият вақтида кишилар ҳаётига сингиб кетган эди. Хамрсиз ҳаётни тасаввур қила олмас эдилар)"
  },
  {
    "chapter": 2,
    "verse": 220,
    "text":
        "Бу дунё ва охират ҳақида. Сендан етимлар ҳақида сўрарлар. Сен: «Уларга ислоҳ қилиш яхшидир», деб айт. Агар уларнинг (молларини) аралаштириб юборсангиз, бас, биродарларингиз. Аллоҳ бузғунчини ҳам, ислоҳчини ҳам билади. Агар хоҳласа, Аллоҳ сизларни қийинчиликка соларди. Албатта, Аллоҳ азиз ва ҳикматли зотдир. (Абдуллоҳ ибн Аббос розияллоҳу анҳу айтишларича, етимларни ўз кафолатига олган кишилар, етимларнинг ҳаққини еб қўймайлик, деб уларнинг овқатларини ҳам, ичимликларини ҳам алоҳида қилиб қўйишган экан. Ҳатто етимдан бирор овқат ортиб қолса, ўзи емаса, бузилиб кетса ҳам, биров емайдиган бўлибди. Бундай қийин ҳолни Пайғамбаримиз Муҳаммад алайҳиссаломга зикр қилишганида, Аллоҳ таоло: «Сендан етимлар ҳақида сўрайдилар», оятини нозил қилган экан)"
  },
  {
    "chapter": 2,
    "verse": 221,
    "text":
        "Мушрика аёлларни иймон келтирмагунларича никоҳингизга олманг. Шубҳасиз, мўмина чўри мушрикадан, гар у сизни ажаблантирса ҳам, яхшидир. Ва мушриклар иймонга келмагунларича (мўминани)уларга никоҳлаб берманг. Шубҳасиз, мўмин қул мушрикдан, гар сизни ажаблантирса ҳам, яхшидир. Анавилар дўзах ўтига чақирадилар. Аллоҳ эса, Ўз изни ила жаннатга ва мағфиратга чақиради ҳамда одамларга Ўз оятларини баён қилади. Шоядки эсга олсалар. (Никоҳ инсоний алоқалар ичида энг муқаддас ва аҳамиятлисидир. Бу алоқа одам боласининг кўплаб хоҳиш истакларига жавоб беради. Никоҳдаги икки шахс бир-бирига энг яқин шахслар ҳисобланади. Бу ҳолга эришиш аввало қалбларнинг бирлашмоғини, қалбларнинг бирлашмоғи эса, ақида бирлигини тақозо этади. Чунки ҳар бир инсоннинг ҳаётий йўлини белгилайдиган ўлчов диний нуқтаи назари бўлади. Шу боисдан Исломда ақидаси бузуқ аёлларга уйланиш, мушрик эркакларга турмушга чиқиш ман қилинади)"
  },
  {
    "chapter": 2,
    "verse": 222,
    "text":
        "Сендан ҳайз ҳақида сўрарлар. Сен: «У кўнгилсиз нарсадир. Ҳайз чоғида аёллардан четда бўлинг. Уларга пок бўлмагунларича яқинлашманглар. Агар пок бўлсалар, уларга Аллоҳ амр қилган жойдан келинг. Албатта, Аллоҳ тавба қилувчиларни севади ва покланувчиларни севади», деб айт"
  },
  {
    "chapter": 2,
    "verse": 223,
    "text":
        "Аёлларингиз экинзорларингиздир. Бас, экинзорингизга хоҳлаганингизча келинг. Ўзингиз учун (яхшилик) тақдим қилинг. Ва Аллоҳга тақво қилинг ҳамда, билингки, албатта, Унга рўбарў келувчисиз. Мўминларга башорат бер. (Эр-хотин орасидаги ҳассос ва нозик алоқа Қуръони Карим оятларида ўзига хос услуб билан тасвирланади. Аввалги оятлардан бирида эр-хотинни бир-бирига нисбатан кийим-либос деб таъриф қилинган эди. Бу оятда эса, аёллар экинзорга ўхшатиляпти)"
  },
  {
    "chapter": 2,
    "verse": 224,
    "text":
        "Аллоҳга ичган қасамларингизни яхшилик қилиш, тақво қилиш ва одамлар орасини ислоҳ этишингизга тўсиқ қилманг. Аллоҳ эшитувчи, билувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 225,
    "text":
        "Аллоҳ сизларнинг бехуда қасамларингиз учун тутмайди. Лекин қалбдан касб қилганингиз учун тутади. Ва Аллоҳ мағфиратли, раҳмли зотдир"
  },
  {
    "chapter": 2,
    "verse": 226,
    "text":
        "Хотинларидан ийлаа қилганлар учун кутиш тўрт ойдир. Агар қайтсалар, бас, албатта, Аллоҳ мағфиратли, раҳмли зотдир"
  },
  {
    "chapter": 2,
    "verse": 227,
    "text":
        "Ва агар талоқни қасд қилсалар, бас, албатта, Аллоҳ эшитувчи, билувчи зотдир. (Ийлаа–эр кишининг ўз хотинига яқинлик қилмасликка қасам ичишидир. Жоҳилият даврида одамлар хотинидан аччиғи чиқса ёки уни жазоламоқчи бўлса, ийлаа қилиб, унга жинсий яқинлик қилмасликка қасам ичиб қўяр экан. Шу билан бир-икки йил ёки ундан ҳам кўпроқ бепарво юраверар экан. Аёл бечора азобда қолар экан. Ийлаанинг узоқ вақти айнан тўрт ой бўлишининг ҳикмати шуки, аёл киши эрсиз шу муддатга сабр қила олади. Бундан ўтиб кетса, чидай олмаслик эҳтимоли бор)"
  },
  {
    "chapter": 2,
    "verse": 228,
    "text":
        "Талоқ қилинган аёллар уч қуръу кутадилар. Агар Аллоҳга ва қиёмат кунига иймон келтирган бўлсалар, Аллоҳ раҳмларида ҳалқ қилинган нарсани беркитишлари ҳалол бўлмайди. Ўшанда эрлари уларни, агар ислоҳни ирода қилсалар, ўзларига қайтариб олишга ҳақлироқдирлар. Ва яхшилик ила уларнинг бурчлари муқобилида ҳақлари ҳам бордир. Ва эркакларга улардан устун даража бордир. Аллоҳ азиз ва ҳакимдир. (Ушбу ояти каримадаги ҳукм эри билан бирга яшаган, ҳайз кўрадиган ва талоқ қилинган аёлларга оиддир)"
  },
  {
    "chapter": 2,
    "verse": 229,
    "text":
        "Талоқ икки мартадир. Сўнгра яхшиликча ушлаб қолиш ёки яхшиликча қўйиб юбориш. Сизга уларга берган нарсангиздан бирор нарсани олиш ҳалол бўлмайди, магар икковлари Аллоҳнинг чегараларида тура олмасликдан қўрқсалар (бўлади). Бас, агар икковларининг Аллоҳнинг чегараларида тура олмаслигидан қўрқсангиз, хотин берган эвазда икковларига гуноҳ йўқдир. Ушбулар Аллоҳнинг чегараларидир. Бас, улардан тажовуз қилманг. Ва ким Аллоҳнинг чегараларида тажовуз қилса, бас, ўшалар, ана ўшалар, золимлардир"
  },
  {
    "chapter": 2,
    "verse": 230,
    "text":
        "Бас, агар яна талоқ қилса, бундан кейин у аёл токи бошқа эрга тегиб чиқмагунча унга ҳалол бўлмайди. Агар у ҳам талоқ қилса, гар Аллоҳнинг чегараларида туришга ишонсалар, бир-бирларига қайтсалар, гуноҳ бўлмайди. Ушбулар Аллоҳнинг билган қавмларга баён қилаётган чегараларидир. (Яъни, агар аввалги иккита устига яна бир бор талоқ қилса, жами учта бўлади. Уч талоқ бўлгандан кейин аёл талоқ қилган эркакка ҳалол бўлмайди. Эру хотин бўлиб яшашлари мумкин эмас. Фақат бир йўл бор, у ҳам бўлса, у аёл бошқа эрга тегса-ю у эр билан эр-хотин бўлиб ҳаёт кечириб юрганда, иккинчи эр вафот этиб қолса ёки талоқ қилса, шундан кейингина яна аввалги эри билан қайта турмуш қурса бўлади. «Агар у ҳам талоқ қилса, гар Аллоҳнинг чегараларида туришга ишонсалар, бир-бирларига қайтсалар, гуноҳ бўлмайди», дейилишининг маъноси шу)"
  },
  {
    "chapter": 2,
    "verse": 231,
    "text":
        "Хотинларни талоқ қилишингизда, муддатлари охирига етганда, уларни яхшилик билан ушлаб қолинг ёки яхшилик билан қўйворинг. Уларни тажовуз учун, зарар етказиш юзасидан ушлаб турманг. Ким ўшандоқ қилса, шубҳасиз, ўзига зулм қилади. Аллоҳнинг оятларини ҳазил билманг. Аллоҳнинг сизга берган неъматини ва ваъз этиб туширган китоби ва ҳикматини эсда тутинг. Аллоҳга тақво қилинг ва, билингки, албатта, Аллоҳ ҳар бир нарсани билувчидир. (Аллоҳнинг улуғ неъмати–Исломни дин ва Муҳаммад алайҳиссаломни Пайғамбар қилиб юборишидир. Ваъз этиб туширган китоби–Қуръони Карим. Ҳикмат–Пайғамбар алайҳиссаломнинг суннатлари. Бу нарсаларни доимо эсда тутиш, улар асосида илоҳий кўрсатмаларга амал қилиб яшашгина инсонга бахт келтиради, шу жумладан, оилавий ҳаётда ҳам)"
  },
  {
    "chapter": 2,
    "verse": 232,
    "text":
        "Хотинларни талоқ қилганингизда, муддатлари охирига етганда, яхшилик билан ўзаро рози бўлишиб, эрларига қайта никоҳланишларини ман қилиб, қийинлаштирманг. Ушбу ила сизлардан Аллоҳга ва охират кунига иймон келтирганлар ваъзланади. Шундоқ қилишингиз сиз учун тозароқ ва покроқдир. Ва Аллоҳ билади, сиз эса билмайсиз. (Маъқал ибн Ясар розийаллоҳу анҳу Пайғамбаримиз алайҳиссаломнинг даврларида синглисини мусулмонлардан бир кишига эрга берибди. Эру хотин бир муддат бирга яшашибди. Кейин эр хотинини бир талоқ қўйиб, қайтмабди. Иддаси чиқиб кетибди. Кейин икковлари ҳам афсус қилиб, эр хотинга, хотин эрга муҳаббат қилибди. Ва бошқа совчилар қатори совчи қўйибди. Шунда Маъқал ибн Ясар унга: «Пасткашнинг ўғли пасткаш! Сени ҳурмат қилиб синглимни берган эдим, сен бўлса уни талоқ қилдинг. Аллоҳга қасамки, у сенга абадий қайтмайди», дебди. Сўнгра Аллоҳ таоло эрнинг хотинга, хотиннинг эрга ҳожатини билиб, «Хотинларни талоқ қилганингизда, муддатлари етганда...» деб бошланиб, «... сиз эса билмайсиз», деб туговчи оятни нозил қилди. Маъқал ибн Ясар розийаллоҳу анҳу ояти каримани эшитишлари билан: «Парвардигорнинг сўзини эшитдик ва итоат қиламиз, –дедилар-да, куёвни чақириб: «Синглимни сенга никоҳлаб бераман ва сени ҳурмат қиламан», дедилар)"
  },
  {
    "chapter": 2,
    "verse": 233,
    "text":
        "Ким эмизишни батамом қилишни ирода қилса, оналар фарзандларни тўлиқ икки йил эмизадилар. Уларни яхшилаб едириб, кийинтириш отанинг зиммасидадир. Ҳеч бир жонга имкондан ташқари таклиф бўлмайди. Она ҳам, ота ҳам боласи сабабидан зарар тортмасин. Меросхўрга ҳам худди шундоқ. Агар ўзаро рози бўлиб, сутдан ажратишни ирода қилсалар, икковларига гуноҳ бўлмайди. Агар фарзандларингизга эмизувчи талаб қилишни ирода қилсангиз, берадиганингизни яхшилик билан аввалдан топширсангиз, гуноҳ бўлмайди. Ва Аллоҳга тақво қилинг ҳамда, билингки, албатта, Аллоҳ қилаётганингизни кўриб турувчидир"
  },
  {
    "chapter": 2,
    "verse": 234,
    "text":
        "Сизлардан вафот этиб жуфтларини қолдирганларнинг аёллари ўзларича тўрт ой-у ўн кун кутадилар. Муддатлари етганда ўзлари ҳақида яхшилик билан қилган ишларида сизга гуноҳ йўқ. Аллоҳ қилаётган амалингиздан хабардордир. (Жоҳилият аҳлининг одатига биноан, эри ўлган хотиннинг устига эрининг қариндошларидан бири ридосини ташлаб қўйса, аёл бечора ўз-ўзидан ўша одамнинг мулкига айланиб қолар эди. Хоҳласа ҳалиги одам ўзи хотин қилар, хоҳласа, бошқа эрга бериб, маҳрини олар ёки умуман сотиб юборар эди. Ислом бу зулмни аёлнинг елкасидан кўтариб ташлади. Эри ўлган аёлнинг иддасини маълум муддатга чегаралаб қўйди: «тўрт ой-у ўн кун». Бунинг ҳикмати кўп. Аввало, бу муддат ичида раҳмининг (бачадоннинг) ҳомиладан бўш ёки бўш эмаслиги билинади. Иддалари чиққанидан кейин, аёллар шариат йўли билан ўзларига совчи кутсалар, айб эмас. Демак, эри ўлганидан тўрт ой-у ўн кун битгач, хотини ясаниб, пардоз қилиб, эрга тегиши учун совчи кутса, ўзининг иши, ҳеч кимга гуноҳ бўлмайди. Уни бу ишдан тўсишга ҳеч кимнинг ҳаққи ҳам йўқ. Шариатнинг ҳукми шу. Ҳаётда бундан бошқа ҳолларнинг учраб туриши эса, бидъат ёки хурофотдир. Хурофотдан сақланиш лозим. Чунки: «Аллоҳ қилаётган амалингиздан хабардордир». Иддада ўтирган аёлга нисбатан шариат кўрсатмаларидан бошқа йўл тутмаслик керак"
  },
  {
    "chapter": 2,
    "verse": 235,
    "text":
        "У аёлларга ишора ила совчилик қилишингиз ёки уни ўз ичингизда тутишингизда гуноҳ йўқ. Аллоҳ сиз уларни, албатта, эслашингизни билади. Лекин улар билан хуфёна ваъдалашманг. Магар яхши гап гапирсангиз, майли. Идда ўз муддатига етмагунча, никоҳ боғлашни қасд қилманг. Ва билингки, албатта, Аллоҳ ичингиздагини билади. Бас, Ундан огоҳ бўлинг. Ва билингки, албатта, Аллоҳ мағфиратли ва ҳалимдир"
  },
  {
    "chapter": 2,
    "verse": 236,
    "text":
        "Агар хотинларга қўл теккизмай туриб ёки уларнинг маҳрни аниқламай туриб талоқ қилсангиз, сизга гуноҳ бўлмайди. Уларни бой борича, йўқ ҳолича яхшилик ила фойда билан фойдалантиринг. Бу яхшилик қилувчилар бурчидир. (Бу оятда никоҳдан кейин маҳрни аниқламаган ҳолатда духулдан олдин талоқ қилганда нима бўлиши ҳақида сўз кетмоқда)"
  },
  {
    "chapter": 2,
    "verse": 237,
    "text":
        "Агар уларга қўл тегизмай талоқ қилсангиз ва маҳрни аниқлаб қўйган бўлсангиз, аниқланганнинг ярмини берасиз, магар аёл ёки никоҳ тугуни қўлида бўлган киши афв қилса, бермайсиз. Ва афв қилишингиз тақвога яқиндир. Орангиздаги фазилатни унутманг. Албатта, Аллоҳ қилаётган амалларингизни кўриб турувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 238,
    "text":
        "Намозларни ва ўрта намозни муҳофаза этинг. Ва Аллоҳ учун хушуъ ила қоим бўлинг. (Намозни муҳофаза этиш–уларни ўз вақтида, яхшилаб, камчиликсиз ўқиш маъноларини билдиради. «Ўрта намоз» ҳақида уламолар турли фикрларни айтганлар. Лекин далилларни солиштириб кўрган уламолар «ўрта намоз»дан мурод–аср намози, деганлар. Имом Муслим қилган ривоятда Пайғамбаримиз алайҳиссалом Аҳзоб урушида: «Бизни ўрта намоз, аср намозидан машғул қилдилар. Аллоҳ уларнинг қалбларини ҳам, уйларини ҳам оловга тўлдирсин», деганлар)"
  },
  {
    "chapter": 2,
    "verse": 239,
    "text":
        "Агар хавфда қолсангиз, юрган ва минган ҳолингизда, хотиржам бўлганингизда, билмаган нарсангизни қандоқ ўргатган бўлса, Аллоҳни шундоқ зикр қилинг. (Одамлар кўп нарсаларни билмайдилар, Аллоҳ ўргатмаса ҳеч нарсани билмас эдилар. Шунингдек, Аллоҳ ўргатмаса, намоз ўқишни ҳам билмасдилар. Хотиржам бўлганларида, Аллоҳ қандай ўргатган бўлса, шундоқ қилиб намоз ўқисинлар)"
  },
  {
    "chapter": 2,
    "verse": 240,
    "text":
        "Сизлардан вафот этганда жуфтларини қолдираётганлар, хотинлари чиқмасдан бир йилгача фойдаланишини васият қилсинлар. Агар улар чиқсалар, ўз хусусларида яхшилик билан қилган ишларида сизга гуноҳ йўқ. Аллоҳ азиз ва ҳаким зотдир"
  },
  {
    "chapter": 2,
    "verse": 241,
    "text":
        "Талоқ қилинган аёлларга мақбул тарзда фойда бериш тақводорлар бурчидир"
  },
  {
    "chapter": 2,
    "verse": 242,
    "text":
        "Аллоҳ шундай қилиб сизларга Ўз оятларини баён этади. Шоядки ақл ишлатсангиз"
  },
  {
    "chapter": 2,
    "verse": 243,
    "text":
        "Диёрларидан ўлимдан қочиб чиққан мингларча кишиларнинг (хабарини) билмадингми?! Бас, Аллоҳ уларга, ўлинг, деди. Сўнгра уларни тирилтирди. Албатта, Аллоҳ одамларга фазл қилувчидир. Лекин кўп одамлар шукр қилмаслар. (Демак, бир вақтлар катта бир қавм ўлимдан қочиб, диёрларини ташлаб чиққан эканлар. Ўлимдан қочишларининг сабаби турлича бўлиши мумкин. Балки вабо тарқалган бўлса, шундан қочишгандир. Ёки душман билан жанг қилиш керак бўлса, урушда ўлиб кетмайлик, деб қочишгандир. Мақсадларининг тескариси бўлди. «Ўлинг» деган бир оғиз сўз билан ўлиб қолишди. Демак, Аллоҳнинг қазои қадаридан қочиб бўлмас экан. Аллоҳдан ўзга қайтиб борадиган жой йўқ экан. Аллоҳнинг Ўзи хоҳлаган вақтида ўлдирар экан)"
  },
  {
    "chapter": 2,
    "verse": 244,
    "text":
        "Аллоҳнинг йўлида жанг қилинг. Ва билингки, албатта, Аллоҳ эшитувчи ва билувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 245,
    "text":
        "Аллоҳга яхши қарз берадиган ким бор?! Бас, токи У зот унга берганини кўп марта кўпайтириб берса. Ва ҳолбуки, Аллоҳ (ризқни) тор қилур ва кенг қилур. Ва Унгагина қайтарилурсиз"
  },
  {
    "chapter": 2,
    "verse": 246,
    "text":
        "Мусодан кейинги Бани Исроилдан бўлган аъёнларни билмадингми?! Вақтики ўз Набийларига: «Бизга бир подшоҳ тайин қилгин, Аллоҳнинг йўлида уруш қилайлик», дедилар. У: «Агар сизларга уруш фарз қилинса, урушмасаларингиз-чи?!» деди. Улар: «Бизга нима бўлибдики, диёримиздан ва фарзандларимиздан жудо қилинсак ҳам, Аллоҳнинг йўлида урушмасак», дедилар. Уруш фарз қилинганда эса, озгиналаридан бошқалари юз ўгириб кетдилар. Ва Аллоҳ зулм қилувчиларни билувчидир. (Мусо алайҳиссалом вафот этиб кетганларидан кейин Бани Исроилнинг аъёнлари, катталари, ишбошиларидан бир гуруҳи ўз набийлари олдига келиб: «Бизга бир подшоҳ–бошлиқ тайин қилиб бер, унинг раҳбарлигида Аллоҳнинг йўлида урушмоқчимиз», дейишди. Улар «Аллоҳнинг йўлида уруш»қилмоқчилар. Лекин қуруқ хавас билан иш битмаслигини англаб етмайдилар. Ҳозир кенгликда туриб, бир-бирингизга қизиқиб, бизга подшҳ тайин қилгин, Аллоҳнинг йўлида уруш қилайлик, демоқдалар. Ҳақиқатан шу иш йўлга қўйилса, уруш фарзга айланади ва унда орқага қайтишнинг иложи қолмайди. Ортга қайтган гуноҳкор бўлади)"
  },
  {
    "chapter": 2,
    "verse": 247,
    "text":
        "Набийлари уларга: «Албатта, Аллоҳ Толутни сизга подшоҳ қилиб тайинлади», деди. Улар: «У бизга қаёқдан подшоҳ бўлсин. Ундан кўра подшоҳликка биз ҳақлироқмиз. Қолаверса, унга кўпроқ мол ҳам берилмаган» дедилар. У: «Албатта, уни Аллоҳнинг Ўзи сизларга танлади ва илмда, жисмда кенглигини зиёда қилди. Аллоҳ подшоҳлигини кимга хоҳласа, ўшанга беради. Ва Аллоҳ кенг қамровли ва билувчидир», деди. (Бани Исроилнинг талабига биноан, Толут уларга подшоҳ этиб тайинланганида, улар уни ризолик ила қабул қилишнинг ўрнига, Аллоҳнинг амрига исён қилишди. Аллоҳ тайин қилган Толутнинг подшоҳ бўлишини инкор этишди. Унинг подшоҳликка тайинланишини хато деб эълон қилишди)"
  },
  {
    "chapter": 2,
    "verse": 248,
    "text":
        "Набийлари уларга: «Албатта, унинг подшоҳлигининг белгиси, сизларга Роббингиздан тобут келмоғидир, унда хотиржамлик ва Мусо ҳамда Ҳорун аҳлидан қолган қолдиқ бўлиб, фаришталар кўтариб келур. Агар мўмин бўлсаларингиз, албатта бу нарсада сизларга белги бор», деди. (Толутнинг ҳақиқатда Аллоҳ томонидан тайин қилинган подшоҳ эканини Бани Исроилга исбот этиш учун уларга қоил қолдирадиган, одатдан ташқари, Аллоҳдан бошқа ҳеч кимнинг қўлидан келмайдиган бир мўъжиза содир этиляпти. Маълумки, Уламоларимиз ушбу ҳодисани Пайғамбарлардан қолган нарсаларни табаррук тутишга далилдир, деганлар. Пайғамбарлари, тобутни фаришталар кўтариб келиши Толутнинг подшоҳлигига белгидир, деди)"
  },
  {
    "chapter": 2,
    "verse": 249,
    "text":
        "Толут аскар билан чиққанда: «Албатта, Аллоҳ сизни дарё билан синовчидир, ким ундан ичса, у мендан эмас. Ва ким уни тановвул қилмаса, у, албатта, мендандир. Магар биров қўли билан бир ҳўплам ҳўпласа, майли», деди. Озгиналаридан бошқалари ундан ичдилар. У ва у билан бирга иймон келтирганлар дарёдан ўтганларида улар: «Бугун бизда Жолут ва унинг аскари билан жанг қилишга тоқат йўқ», дедилар. Аллоҳга рўбарў бўлишга ишонганлар: «Қанчадан-қанча оз сонли гуруҳлар Аллоҳнинг изни билан кўп сонли гуруҳларга ғолиб келган. Аллоҳ сабрлилар биландир», дедилар. (Асл нарса ўзи оз бўлади. Ҳақиқий мўминлар ҳам оз бўладилар. Чунки улар хатарли сўқмоқлардан қийинчиликларни енгиб ўтиб, мақсадга етадилар, Аллоҳ танлаган, муқарраб бандалар қаторига кирадилар. Аллоҳниг Ўзидан сабр тилаб, қўрқмай, кўп сонли ва қувватли душманнинг кўзига тик боқиб бораверадилар)"
  },
  {
    "chapter": 2,
    "verse": 250,
    "text":
        "Жолут ва унинг аскарларига рўбарў келганларида: «Роббимиз, бизга сабр тўккин, бизни собитқадам қилгин ва кофир қавмларга қарши нусрат бергин», дедилар"
  },
  {
    "chapter": 2,
    "verse": 251,
    "text":
        "Бас, Аллоҳнинг изни билан урушда енгдилар ва Довуд Жолутни қатл этди. Сўнгра Аллоҳ унга подшоҳлик ва ҳикматни берди ва хоҳлаган нарсасини ўргатди. Агар Аллоҳнинг баъзи (одам)ларни баъзиларига дафъ қилиш бўлмаса эди, ер юзи бузиларди. Лекин Аллоҳ оламлар устидан фазл эгасидир. (Довуд Толут аскари ичида ёш йигит эди. Жолут эса, катта кучга эга бўлган подшоҳ, ҳамманинг қалбига даҳшат солиб турувчи аскарбоши эди. Аллоҳ таоло ушбу золим подшоҳ ва аскарбошининг ёшгина йигитча қўлида қатл бўлишини ирода қилди. Бу билан одамларга, Аллоҳ хоҳласа, ҳар қандай жаббор бўлса ҳам, бир ёш йигит унинг ўлимига сабаб бўлиши мумкинлигини кўрсатди. «Сўнгра Аллоҳ унга подшоҳлик ва ҳикматни берди ва хоҳлаган нарсасини ўргатди». Довуд Аллоҳнинг инояти билан Толутдан кейин Бани Исроилга подшоҳ бўлди. Унинг подшоҳлик даври олтин давр бўлди. Аллоҳ таоло унга подшоҳликка қўшиб ҳикматни, яъни, Пайғамбарликни ҳам берди. Шу билан бирга, унга уруш асбобларини ясашни ҳам ўргатди)"
  },
  {
    "chapter": 2,
    "verse": 252,
    "text":
        "Булар Аллоҳнинг оятларидир. Уларни сенга ҳақ ила тиловат қилурмиз. Ва, албатта, сен Пайғамбарлардандирсан. («Булар»-мингларча одамларни ўлдириш ва тирилтириш, тобутни фаришталар кўтариб келиши, оз сонли мўминларнинг кўп сонли кофирларнинг устидан ғолиб келиши ҳақидаги хабарларни ўз ичига олган оятлардир. Уларни Аллоҳ таоло Ўз Пайғамбарига ҳақ ила ҳикоя қилиб бермоқда. «Ҳақ билан» дегани–қандай бўлган бўлса, шундай, воқеъликдаги ҳодисанинг ўзини айтиб бермоқда, деганидир)"
  },
  {
    "chapter": 2,
    "verse": 253,
    "text":
        "Ўшалар Пайғамбарлар. Уларнинг баъзиларини баъзиларидан фазллик қилдик. Улардан Аллоҳ гаплашгани бор ва баъзиларининг даражасини кўтарган. Ва Ийсо ибн Марямга ойдин (мўъжиза)ларни бердик ва уни муқаддас руҳ билан қўлладик. Агар Аллоҳ хоҳлаганида, улардан кейин қолганлар ўзларига очиқ-ойдин баёнотлар келганидан сўнг урушмас эдилар. Лекин ихтилоф қилдилар. Улардан кимдир иймон келтирди, кимдир куфр келтирди. Агар Аллоҳ хоҳлаганида, урушмас эдилар. Лекин Аллоҳ нимани ирода қилса, шуни қилади. («Муқаддас руҳ» деб таржима қилинган «Руҳул қудус»дан мурод Жиброил фаришта алайҳиссаломдир)"
  },
  {
    "chapter": 2,
    "verse": 254,
    "text":
        "Эй иймон келтирганлар! Сизга ризқ қилиб берган нарсаларимиздан, на олди-сотди, на ошна-оғайничилик ва на шафоатчилик йўқ кун келмасдан олдин нафақа қилинг. Ва кофирлар–ўшалар, золимлардир"
  },
  {
    "chapter": 2,
    "verse": 255,
    "text":
        "Аллоҳ Ундан ўзга илоҳ йўқ зотдир. У тирик ва қаййумдир. Уни мудроқ ҳам, уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида Ўзининг изнисиз ҳеч ким шафоат қила олмас. У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар Ўзи хоҳлаганини, халос. Унинг курсиси осмонлару ерни қамраган. Уларни муҳофаза қилиш Уни чарчатмас. Ва У Олий ва Азим зотдир. (Имом Муслим ва Имом Аҳмад Убай ибн Каъб розийаллоҳу анҳудан ривоят қилган ҳадисда, Аллоҳдаги китобидаги энг улуғ оят Курси ояти эканлиги таъкидланган. Имом Насаий Абу Умомадан ривоят қилган ҳадисда Пайғамбаримиз алайҳиссалом: «Ким ҳар фарз намоздан кейин «Оятул Курсий»ни ўқиса, унинг жаннатга киришини фақат ўлим тўсиб туради, холос», деганлар. Яъни, ўлмагани учун жаннатга кирмайди, агар вафот этса, уни жаннатдан тўсадиган ҳеч нарса қолмайди, дегани)"
  },
  {
    "chapter": 2,
    "verse": 256,
    "text":
        "Динга мажбур қилиш йўқ. Батаҳқиқ, ҳақ ботилдан ажради. Ким тоғутга куфр келтириб, Аллоҳга иймон келтирса, батаҳқиқ, узилмайдиган мустаҳкам тутқични ушлаган бўлур. Ва Аллоҳ эшитувчи, билувчи зотдир. (Ақида, иймон масаласи инсон қалбига боғлиқ жуда ҳам нозик бир масаладир. Бу нарсани мажбур этиб, куч билан сингдириб бўлмайди. Балки ҳар бир инсон баён қилинган нарсаларга тушуниб иймон келтиргандагина мақсад ҳосил бўлади. Исломда ушбу қоидага қаттиқ риоя қилинади. Аллоҳ таоло Ўзи «Динга мажбур қилиш йўқ. Батаҳқиқ, ҳақ ботилдан ажради», деб қўйган. Яъни, Аллоҳ таоло Ўз Пайғамбари Муҳаммад алайҳиссаломга Қуръони Каримни тушириб, Исломни жорий қилгандан сўнг тўғри йўл нотўғрисидан, ҳақ ботилдан ажради. Ҳамма нарса ўз ўрнини топди. Шундай бўлгандан кейин «Динга мажбур қилиш йўқ». Ҳар кимга Аллоҳ ақл берган, ўзига керак йўлни танлаб олсин)"
  },
  {
    "chapter": 2,
    "verse": 257,
    "text":
        "Аллоҳ иймон келтирганларнинг дўстидир. Уларни зулматлардан нурга чиқарур. Куфр келтирганларнинг дўстлари тоғутдир. Уларни нурдан зулматларга чиқарурлар. Ана ўшалар дўзах эгаларидир. Улар унда абадийдирлар. (Биз оятда «дўст» деб таржима қилган ибора арабчада «валий» деб келган бўлиб, бу сиз билан бизнинг тушунчамиздаги «дўст»дан кўра кенгроқ тушунчани ифода қилади. Бу дўст ишбоши, ҳамма керакли нарсаларни тайёрлаб, ишларни тўғри изга солиб турувчи ғамхўрдир.) «Тоғут»-Аллоҳдан бошқа ибодат қилинадиган нарсалар"
  },
  {
    "chapter": 2,
    "verse": 258,
    "text":
        "Аллоҳ подшоҳлик бериб қўйгани сабабидан Иброҳим билан Роббиси ҳақида ҳужжат талашганни билмадингми? Иброҳим: «Менинг Роббиим тирилтиради ва ўлдиради», деганда, у: «Мен тирилтираман ва ўлдираман», деди. Иброҳим: «Албатта, Аллоҳ қуёшни Машриқдан чиқаради, бас, сен уни Мағрибдан чиқаргин-чи», деди. Бас, куфр келтирган лол қолди. Ва Аллоҳ золим қавмларни ҳидоятга солмас. (Ушбу ояти карима Иброҳим алайҳиссалом билан у кишининг даврларида ўтган бир ҳукмдор подшоҳнинг тортишувини ҳикоя қилади)"
  },
  {
    "chapter": 2,
    "verse": 259,
    "text":
        "Ёки шифтлари устига қулаган қишлоқдан ўтган кишига ўхшашни кўрмадингми? У: «Аллоҳ буни ўлимидан кейин қандай тирилтиради?» деди. Бас, Аллоҳ уни юз йил ўлдирди, сўнгра қайта тирилтирди. У зот: «Қанча ётднг?», деди. У: «Бир кун ёки бир куннинг баъзисича ётдим», деди. У зот: «Балки юз йил ётдинг, таомингга ва шаробингга назар сол, ўзгаргани йўқ ва эшагингга ҳам қара. Сени одамларга ибрат қилиш учун шундай қилдик. Ва суякларга назар сол, уларни қандоқ ҳаракатга соламиз ва уларга қандоқ гўшт кийгизамиз», деди. Унга равшан бўлганда: «Албатта, Аллоҳ ҳар бир нарсага қодирлигини билдим», деди. (Демак, ўша киши Аллоҳ таолонинг ҳар бир нарсага қодир эканига шубҳа билан қарарди. Шунда Аллоҳ таоло унга, ўлган нарсаларни қандай қилиб тирилтиришини тушунтириб ўтирмади-да, у банданинг ўзини тажриба қилиб қўя қолди: «Бас, Аллоҳ уни юз йил ўлдирди, сўнгра қайта тирилтирди». Бўлиб ўтган воқеани тушуниб етиш учун Аллоҳ унга: «Қанча ётдинг?» деди». У одам ўзининг қанча ётганини қаердан билсин. Вақтни сезиш тирик, ҳаёт нашидасини суриб турган кишиларга хос хусусият. У бўлса, юз йил ўлиб ётди. Бунинг устига, ҳис-туйғу одамни алдайди ҳам. Шунинг учун: «У: «Бир кун ёки бир кунининг баъзисича ётдим», деди». Ўзининг билганича жавоб берди. Ўзининг юз йил ўлиб ётиб, яна қайта тирилгани унга бир кун ёки бир кундан ҳам озроқ ётгандай бўлиб кўринди. Бу ҳолати ўзига тасдиқлатиб олингандан сўнг, бўлган ишнинг ҳақиқати унга айтилди: «Балки юз йил ётдинг», дейилди)"
  },
  {
    "chapter": 2,
    "verse": 260,
    "text":
        "Эсла, Иброҳим: «Эй Роббим, менга ўликларни қандай тирилтиришингни кўрсат», деганда, У зот: «Ишонмадингми?» деди. У: Оре, лекин қалбим хотиржам бўлиши учун», деди. У зот: «Қушдан тўртта олгин-да, ўзингга тортиб, кесиб майдала, сўнгра улардан ҳар бир тоққа бўлакларини қўйгин, кейин уларни ўзингга чақир, ҳузурингга тезлаб келурлар ва билгинки, албатта, Аллоҳ азиз ва ҳаким зотдир», деди. (Иброҳим алайҳиссалом Аллоҳ таоло ўликларни тирилтира олишига ҳеч қандай шубҳа қилмас эдилар. У зотнинг бунга ишончлари комил эди. Шунинг учун ҳам Аллоҳ таоло «Ишонмадингми?» деб сўраганида: «Оре (ишондим), лекин қалбим хотиржам бўлиши учун», дедилар. Дилда ишонган нарсани, кўз билан кўриб, Аллоҳ таолонинг қудратига қоил қолиб, мўмин банда ўз Роббининг мўъжизаларини кўриб маза қилгандек маза қилиб, кўнгли хотиржам бўлиши учун сўраганлар"
  },
  {
    "chapter": 2,
    "verse": 261,
    "text":
        "Молларини Аллоҳнинг йўлида сарфлайдиганларнинг мисоли, худди бир дона донга ўхшайди. Ундан етти бошоқ ўсиб чиқади, ҳар бошоқда юзтадан дон бор. Ва Аллоҳ кимга хоҳласа, яна кўпайтириб берадир. Ва Аллоҳ қамраб олувчи ва билувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 262,
    "text":
        "Аллоҳнинг йўлида молларини сарфлаб, сўнгра сарфлари кетидан миннат қилмай ва озор бермайдиганларнинг ажрлари Роббилари ҳузуридадир. Уларга хавф йўқ ва улар хафа ҳам бўлмаслар. (Аллоҳнинг йўлида сарфланган молнинг савобини тўлиқ олишнинг шарти ҳам бор, у ҳам бўлса, мол сарфловчи миннат қилмаслиги ва молни олганларга озор бермаслиги керак. Миннат қилишлик ёмон одат бўлиб, инсон қалбида оғир яра қолдиради)"
  },
  {
    "chapter": 2,
    "verse": 263,
    "text":
        "Яхши сўз ва кечириш, ортидан озор келадиган садақадан кўра яхшироқдир. Ва Аллоҳ ғаний ва ҳалим зотдир. («Ортидан озор келадиган садақа»нинг кераги йўқ. Ундан кўра бир оғиз ширин сўз ва кечиримли бўлиш яхшироқдир. Бир оғиз бўлса ҳам, ширин сўз қалбнинг жароҳатига малҳам бўлади, кишининг кўнглини кўтаради. Кечириш эса, ҳасад ва ёмонликни ювиб ташлаб, ўрнига муҳаббат ва дўстликни солади)"
  },
  {
    "chapter": 2,
    "verse": 264,
    "text":
        "Эй иймон келтирганлар! Садақаларингизни миннат ва озор бериш билан, молини Аллоҳга ва охират кунига иймон келтирмаса ҳам кишиларга риё учун нафақа қилганга ўхшаб бекорга кетгазманг. У мисоли бир устини тупроқ босган силлиқ тошга ўхшайди. Бас, кучли ёмғир ёғса, силлиқ бўлиб қоладир. Касб қилганларидан ҳеч нарсага қодир бўлмаслар. Ва Аллоҳ кофир қавмларни ҳидоятга бошламас. (Ушбу ояти каримада садақадан кейин миннат қилиб, озор бериб, қилган яхшилигининг савобидан бебаҳра қолишлик ажойиб бадиий васф билан тасвирланяпти. Бу билан мусулмонлар ҳиссида бу ишнинг нақадар ёмон иш эканлигини жонли тасвир қилинмоқда)"
  },
  {
    "chapter": 2,
    "verse": 265,
    "text":
        "Молларини Аллоҳнинг розилигини истаб, ўзларидаги ишонч билан сарфлайдиганлар худди тепаликдаги боққа ўхшарлар. Унга қаттиқ ёмғир ёғса, мевасини икки баробар беради. Агар қаттиқ ёмғир ёғмаса, майдалаб ёққани ҳам бўлаверади. Ва Аллоҳ қилаётганларингизни кўриб турувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 266,
    "text":
        "Сизлардан бирортангиз остидан анҳорлар оқиб турган хурмозор ва узумзор, турли мевали боғи бўлатуриб, ёши бир жойга етганда, заифҳол зурриёти бор пайтда унга ўтли бўрон келиб ёниб битишини хоҳлайдими?! Аллоҳ сизларга шу тариқа Ўз оятларини баён қиладир, шоядки фикр юритсангиз. (Аллоҳнинг йўлда қилинган садақа худди дарахтлари остидан шарқираб сувлар оқиб турган хурмозор ва узумзор, турли мевали боққа ўхшайди. Боғдан ҳаммага фойда–кўрган ҳам, кирган ҳам, еган ҳам ҳурсанд. Худди шунингдек, Аллоҳ йўлида қилинган садақа берганни ҳам, олганни ҳам, билганни ҳам хурсанд қилади. Ҳаммага ўз даражасида фойда етказади. Ана шундай олиймақом боғу бўстони бор одам шу боғнинг ўтли бўронда куйиб тугашини, хусусан, ёши бир жойга етиб, қўлидан бир иш келмай қолган чоғида, унинг қўлига қараб турган заифҳол зурриётлари бор чоғида шундай бўлишини хоҳлайдими? Албатта, йўқ. Аллоҳ йўлида садақа қилган одам ҳам гўё ўшандай боғу бўстонга эришган бўлади. Садақаси кетидан миннат этса ва озор етказса, худди ўтли бўрон билан боғини куйдиргандек бўлади. Садақасининг савоби қолмайди)"
  },
  {
    "chapter": 2,
    "verse": 267,
    "text":
        "Эй иймон келтирганлар! Касб қилган пок нарсаларингиздан ва Биз сизларга ердан чиқариб берган нарсаларимиздан садақа қилинглар. Нопокни қасд этиб садақа қилманг. Ҳолбуки, уни ўзингиз ҳам олувчимассиз, магар кўз юмсангизгина оласиз. Ва билингки, албатта, Аллоҳ бой ва мақталган зотдир"
  },
  {
    "chapter": 2,
    "verse": 268,
    "text":
        "Шайтон сизга фақирликни ваъда қилади ва фаҳш ишларга буюради. Аллоҳ сизга ўзидан мағфират ва фазлни ваъда қилади. Ва Аллоҳ кенг қамровли, билувчи зотдир. (Шайтон бандаларни молингдан садақа қилсанг, фақир-камбағал бўлиб қоласан, деб қўрқитади. Ҳам кишиларни фаҳшга–ёмон гуноҳ ишларга, қизғанчиқликка, бахиллик ва молу дунёга ўч бўлишга буюради. Шайтоннинг гапига кирганлар фақирликдан қўрқиб, бахил бўлиб, Аллоҳнинг йўлида садақа қилмай юраверадилар)"
  },
  {
    "chapter": 2,
    "verse": 269,
    "text":
        "У зот кимни хоҳласа, ўшанга ҳикматни беради. Кимга ҳикмат берилса, унга кўп яхшилик берилган бўлади. Фақат ақл эгаларигина эсларлар. (Ҳикмат билан тасарруф қилган инсон ҳар бир нарсани ўз ўрнига қўйиб. қоиллатиб қилади. Садақада ҳам ҳаддидан ошмай, адолат билан иш юритади. Умуман, ҳикматли бўлишлик унга жуда кўп яхшилик келтиради. Бу ҳақиқатни ақл эгаларигина эслайдилар, тушуниб етадилар)"
  },
  {
    "chapter": 2,
    "verse": 270,
    "text":
        "Қилган нафақангизни ёки назрингизни Аллоҳ, албатта, билади. Золимларга ёрдамчилар йўқдир"
  },
  {
    "chapter": 2,
    "verse": 271,
    "text":
        "Садақани ошкора қилсангиз қандоқ ҳам яхши. Агар махфий қилсангиз ва фақирларга берсангиз, бу сиз учун яхшидир. Сиздан гуноҳларингизни ювади. Ва Аллоҳ қилаётган амалларингиздан хабардордир. (Ушбу ояти каримада садақани ошкора қилиш ҳам, махфий қилиш ҳам мақталмоқда. Бу ҳақдаги бошқа оят ва шаръий далилларни жамлаб ўрганиб чиққан уламоларимиз хулоса қилиб айтадиларки, садақа фарз бўлса, уни ошкора қилиш яхши, чунки бу ҳолда Аллоҳнинг амрига тоат ошкора кўринади ва ҳақдор бўлмаган кишиларга ҳам тушиб қолиши мумкинлиги олди олинади. Агар садақа ихтиёрий бўлса, уни махфий қилингани яхши. Риёдан ва манманликдан узоқда бўлинади. Садақанинг энг ҳақдори камбағал-фақир кишилардир. Исломда садақанинг жорий қилиниши ҳам ўша тоифанинг ҳимояси ва ёрдами учун бўлган)"
  },
  {
    "chapter": 2,
    "verse": 272,
    "text":
        "Уларни ҳидоятга солиш сенинг зиммангда эмас. Лекин Аллоҳ кимни хоҳласа, ҳидоятга бошлар. Нафақа қилган яхшиликларингиз ўз фойдангизга. Қилган нафақангиз, фақат Аллоҳнинг юзини исташ учундир. Нафақа қилган яхшиликларингиз ўзингизга тўлалигича қайтарилур. Сизларга зулм қилинмас"
  },
  {
    "chapter": 2,
    "verse": 273,
    "text":
        "(Садақа ва хайру-эҳсонлар) Аллоҳнинг йўлида тутилган, ер юзида касб қилишга қодир бўлмаган, иффатлари туфайли билмаган киши уларни бой деб ўйлайдиган фақирларгадир. Уларни сиймоларидан танийсан, одамлардан хиралик қилиб сўрамаслар. Нафақа қилган яхшиликларингизни, албатта, Аллоҳ билгувчидир. (Бу тоифадаги одамлар ўзларини Аллоҳ йўлида жиҳод қилишга бағишлаган кишилардир, улар нафсларини жиҳод учун тутганлар, шу сабабдан касб қилишга ҳам имконлари йўқ. Айни чоқда, иффатлари, уятлари кучли бўлганидан ўзларининг ҳожатманд эканликларини яшириб юрадилар. Асл ҳолни билмаган одам уларни сиртларидан кўриб бой деб ўйлайди. Нафақани худди ана ўшаларга қилиш керак. Улар ўзлари асл ҳолларини беркитсалар, одамлардан хиралик билан тиланмасалар, қандай қилиб топамиз уларни? «Уларни сиймоларидан танийсан»)"
  },
  {
    "chapter": 2,
    "verse": 274,
    "text":
        "Кечасию кундузи молларини нафақа қиладиганларнинг ажрлари Роббилари ҳузуридадир. Уларга хавф йўқ ва улар хафа ҳам бўлмаслар. («Кечасию кундузи» дейишдан мурод ҳамма вақт назарда тутилмоқда; «молларини» деган сўз замирида эса, ҳамма тур моллар ва ҳамма тур эҳсон қилувчиларга ишора бор. Уларнинг ажрлари энг олиймақом жойда–Роббилари ҳузурида эканлиги таъкидланмоқда)"
  },
  {
    "chapter": 2,
    "verse": 275,
    "text":
        "Рибони ейдиганлар (қабрларидан) фақат шайтон уриб жинни бўлган кишидек довдираб турарлар. Бундай бўлиши уларнинг, тижорат ҳам рибога ўхшаш-да, деганлари учундир. Ва ҳолбуки, Аллоҳ тижоратни ҳалол, рибони ҳаром қилган. Кимки Роббидан мавъиза келганда тўхтаса, аввал ўтгани ўзига ва унинг иши Аллоҳнинг Ўзига ҳавола. Кимки яна (рибога) қайтса, ана ўшалар дўзах эгаларидир. Улар унда абадий қолурлар"
  },
  {
    "chapter": 2,
    "verse": 276,
    "text":
        "Аллоҳ рибони доимо нуқсонга учратади ва садақаларни зиёда қилади. Ва Аллоҳ ҳар бир кофир, гуноҳкорни хуш кўрмас. (Судхўрнинг пули ҳисоб жиҳатидан кўп бўлса ҳам Аллоҳ унинг баракасини кўтариб, егани ўзига юқмайдиган қилиб қўяди. Судхўрни турли касалликларга дучор қилади, тинчлигини, хотиржамлигини олади. Яна биз билмайдиган кўп бало-офатларга дучор қилади. Шунингдек, сиртдан қараганда, садақа қилган кишиларнинг моли камайганга ўхшайди. Аслида эса, иш бунинг тескариси бўлади: Аллоҳ «садақаларни зиёда қилади». Агар ҳисобда садақа қилувчининг моли ҳажми оз бўлса ҳам, Аллоҳ унга барака ато қилади, бало-офатлардан сақлайди, ўзини тинч, хотирини жам қилади)"
  },
  {
    "chapter": 2,
    "verse": 277,
    "text":
        "Албатта, иймон келтирган, яхши амалларни қилган, намозни қоим қилиб, закот берганларнинг ажрлари Роббилари ҳузуридадир. Уларга хавф йўқ ва улар хафа ҳам бўлмаслар. (Ҳақиқий иймон эгаси бўлган кишилар доимо яхши амалларни қиладилар, хусусан, намозни вақтида яхшилаб адо этадилар. Иқтисодий соҳада эса, закот берадилар. Рибохўрлар одамларнинг пешона тери билан топган даромадларини ҳаром йўл билан ўзлаштириб олаётган бўлсалар, мўминлар ўзлари пешона тери билан топган ҳалол молларидан закот чиқариб одамларга, шундай еб кетарга берадилар. Қайтариб олиш ёки ўрнига бошқа нарса олиш умидлари ҳам йўқ. Уларнинг бирдан-бир умидлари «закот берганларнинг ажрлари Роббилари ҳузуридадир», деган ваъдададир. Улар икки дунёда эминлик ва бахт-саодатда бўлурлар)"
  },
  {
    "chapter": 2,
    "verse": 278,
    "text":
        "Эй иймон келтирганлар! Агар мўмин бўлсангиз, Аллоҳга тақво қилинг ва рибонинг сарқитини ҳам тарк қилинг"
  },
  {
    "chapter": 2,
    "verse": 279,
    "text":
        "Агар ундоқ қилмасангиз, Аллоҳ ва Унинг Расули томонидан бўладиган урушга ишонаверинг. Агар тавба қилсангиз, сармоянгиз ўзингизга, зулм қилмассиз ва сизга ҳам зулм қилинмас"
  },
  {
    "chapter": 2,
    "verse": 280,
    "text":
        "Агар ночор бўлса, бойигунча интизор бўлинг. Садақа қилмоғингиз, гар билсангиз, ўзингиз учун яхшидир"
  },
  {
    "chapter": 2,
    "verse": 281,
    "text":
        "Аллоҳга қайтариладиган кунингиздан қўрқинг. Сўнгра ҳар бир жон қилганига яраша тўлиқ оладир. Уларга зулм қилинмас"
  },
  {
    "chapter": 2,
    "verse": 282,
    "text":
        "Эй иймон келтирганлар! Маълум муддатга қарз олди-берди қилган вақтингизда, уни ёзиб қўйинг. Орангизда бир ёзувчи адолат билан ёзсин. Ҳеч бир ёзувчи Аллоҳ билдирганидек қилиб ёзишдан бош тортмасин. Бас, ёзсин ва ҳақ зиммасига тушган киши айтиб турсин, Роббига тақво қилсин ва ундан ҳеч нарсани камайтирмасин. Агар ҳақ зиммасига тушган киши эси паст, заиф ёки айтиб тура олмайдиган бўлса, унинг валийси адолат билан айтиб турсин. Эркакларингиздан икки кишини гувоҳ қилинг. Агар икки эр киши бўлмаса, ўзингиз рози бўладиган гувоҳлардан бир эр киши ва икки аёл киши бўлсин. Иккови(аёл)дан бирорталари адашса, бирлари бошқасининг эсига солади. Ва чақирилган вақтда гувоҳлар бош тортмасинлар. Кичик бўлса ҳам, катта бўлса ҳам, муддатигача ёзишингизни малол олманг. Шундоқ қилмоғингиз Аллоҳнинг ҳузурида адолатлироқ, гувоҳликка кучлироқ ва шубҳаланмаслигингиз учун яқинроқдир. Магар ораларингизда юриб турган нақд савдо бўлса, ёзмасангиз ҳам, сизга гуноҳ бўлмас. Олди-сотди қилганингизда, гувоҳ келтиринг ва ёзувчи ҳам, гувоҳ ҳам зарар тортмасин. Агар (аксини) қилсангиз, албатта, бу фосиқлигингиздир. Аллоҳга тақво қилинг. Ва Аллоҳ сизга илм беради. Аллоҳ ҳар бир нарсани билувчи зотдир. (Ояти карима «ҳақ зиммасига тушган киши» деганда қарз олувчини назарда тутган. Демак, ўртадаги киши келиб қарз олди-бердини ёзаётган вақтда матнни қарз олувчи айтиб туради. Аввало, қарз олаётганини эътироф қилади. Қарзнинг миқдорини, шартини ва муддатини айтади. Бу нарсаларни қарз берувчи айтиб турса, ўз фойдасига буриб юбормасин, деган эҳтиёт чораси туфайли шундай қилинади. Қарз олувчи муҳтож бўлиб тургани учун бундай қилмаслиги аниқроқ. Чунки у муомаланинг тезроқ амалга ошишига муҳтож. Шундай бўлса ҳам, ояти карима яна бир бор, уни Роббига тақво қилишга ва ҳеч нарсани камайтирмасликка даъват қилмоқда. Агар қарз олаётган одам эси паст, молиявий ишлар тадбирини билмайдиган бўлса, заифлиги (ёши кичикдир ёки ўта кексадир, касалдир) туфайли ёки тилидаги айби, билмаслиги ва бошқа мавжуд айблар туфайли айтиб тура олмаса, унинг валийси адолат билан айтиб турсин. Чунки валийлар бошқа ишларда ҳам ўз қарамоғидагиларнинг масъулиятини оладилар. Молиявий олди-берди катта аҳамиятга эгадир, чунки бунда орага молу пул аралашади. Бундай ҳолда биров бошқасининг ҳақини еб кетишининг йўлини ҳар жиҳатдан тўсиш лозим. Бунда адолатли котиб ёздириб қўйиш билан кифояланмай, яна мусулмонлардан икки эркак кишини гувоҳ қилишга ҳам амр бўлмоқда. Исломда гувоҳликка доимо адолатли кишилар ўтиши зарур, бу нарса бошқа жойларда кўп таъкидлангани учун бу ерда қайта айтилмади. Аммо барибир бу шарт бекор бўлмайди. Чунки шариат ўлчовида адолатсиз бўлган кишининг гувоҳлиги қабул қилинмайди"
  },
  {
    "chapter": 2,
    "verse": 283,
    "text":
        "Агар сафарда бўлсангиз ва ёзувчи топа олмасангиз, бас, қўлга олинадиган гаров бўлсин. Агар баъзингиз баъзингизга ишонсангиз, бас, ишонилган омонатни адо қилсин, Аллоҳга, Роббисига тақво қилсин. Гувоҳликни беркитманг! Ким уни беркитса, унинг қалби гуноҳкордир. Ва Аллоҳ қилаётган амалларингизни билувчи зотдир"
  },
  {
    "chapter": 2,
    "verse": 284,
    "text":
        "Осмонлару ердаги нарсалар Аллоҳникидир. Агар ичингиздаги нарсаларни ошкор қилсангиз ҳам, махфий қилсангиз ҳам, сизларни Аллоҳ ҳисоб-китоб қилади. Ва кимни хоҳласа, мағфират қилар, кимни хоҳласа, азоблар. Ва У ҳар бир нарсага қодирдир. (Борлиқ Аллоҳнинг мулкидир. Мулкида жараён этаётган ҳар бир ишдан У огоҳдир. Жумладан, бандаларнинг яширин ниятларини ҳам, ошкора ишларини ҳам яхши билади. Ва ҳаммасини ҳисоб-китоб қилиб, хоҳлаганини кечиб юборади, хоҳлаганини азоблайди)"
  },
  {
    "chapter": 2,
    "verse": 285,
    "text":
        "Пайғамбар унга ўз Роббидан туширилган нарсага иймон келтирди ва мўминлар ҳам. Барча Аллоҳга, Унинг фаришталарига, китобларига, Пайғамбарларига иймон келтирди. Унинг Пайғамбарларининг бирорталарини ажратмаймиз. Ва эшитдик ва итоат қилдик, эй Роббимиз мағфаратингни сўраймиз ва қайтиб бориш Сенгадир, дедилар. (Ушбу ояти карима ва кейинги оят иккалови суранинг хулосасини мужассам қилгандир. Бу икки оятнинг ҳар бир сўзи улкан маъно англатади. Уларда ақида, иймон хусусиятлари, банданинг ўз Робби билан бўладиган ҳоли, фарз қилинган амалларга муносабат ва бошқалар келган)"
  },
  {
    "chapter": 2,
    "verse": 286,
    "text":
        "Аллоҳ ҳеч бир жонни тоқатидан ташқари нарсага таклиф қилмас. Фойдаси ҳам касбидан, зарари ҳам касбидан. Эй Роббимиз, агар унутсак ёки хато қилсак, (иқобга) тутмагин. Эй Роббимиз, биздан олдингиларга юклаганга ўхшаш оғирликни бизга юкламагин. Эй Роббимиз, бизга тоқатимз етмайдиган нарсани юкламагин. Бизни афв эт, мағфират қил ва раҳм эт. Сен ҳожамизсан. Бас, кофир қавмларга бизни ғолиб қил. (Ҳамма нарсани дақиқ-дақиқларигача билувчи Аллоҳ ҳар бир жонни ҳам нимага ярайдию нимага ярамайди–яхши билади. Бандаларига меҳрибонлигидан имкони ва ҳаққи бўлса ҳам, ҳеч бир жонни тоқатидан ташқари нарсага таклиф қилмайди. Аллоҳнинг буйруқлари ва қайтариқлари банданинг имкони даражаси доирасида бўлади. Ана ўша таклифга амал қилишига қараб, бошқа ҳеч бир нарсага қарамасдан, банданинг жазоси ёки мукофоти белгиланади. Имом Аҳмад ривоят қилган ҳадисда Пайғамбар алайҳиссалом: «Сураи Бақаранинг икки оятини ўқи, улар менга аршнинг остидаги хазинадан берилган», деганлар. Бошқа бир ҳадисда: «Ким Бақара сураси охиридаги икки оятни бир кечада ўқиса, кифоя қилади», деганлар)"
  }
];

List Arabic = [
  {
    "number": 0,
    "audio": "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/8.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/8.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/8.mp3"
    ],
    "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
    "numberInSurah": 0,
    "juz": 0,
    "manzil": 0,
    "page": 0,
    "ruku": 0,
    "hizbQuarter": 0,
    "sajda": false
  },
  {
    "number": 8,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/8.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/8.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/8.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/8.mp3"
    ],
    "text": "الٓمٓ",
    "numberInSurah": 1,
    "juz": 1,
    "manzil": 1,
    "page": 2,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 9,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/9.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/9.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/9.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/9.mp3"
    ],
    "text": "ذَٰلِكَ ٱلْكِتَٰبُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًۭى لِّلْمُتَّقِينَ",
    "numberInSurah": 2,
    "juz": 1,
    "manzil": 1,
    "page": 2,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 10,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/10.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/10.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/10.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/10.mp3"
    ],
    "text":
        "ٱلَّذِينَ يُؤْمِنُونَ بِٱلْغَيْبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَ",
    "numberInSurah": 3,
    "juz": 1,
    "manzil": 1,
    "page": 2,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 11,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/11.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/11.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/11.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/11.mp3"
    ],
    "text":
        "وَٱلَّذِينَ يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ وَبِٱلْءَاخِرَةِ هُمْ يُوقِنُونَ",
    "numberInSurah": 4,
    "juz": 1,
    "manzil": 1,
    "page": 2,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 12,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/12.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/12.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/12.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/12.mp3"
    ],
    "text":
        "أُو۟لَٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "numberInSurah": 5,
    "juz": 1,
    "manzil": 1,
    "page": 2,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 13,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/13.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/13.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/13.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/13.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
    "numberInSurah": 6,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 14,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/14.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/14.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/14.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/14.mp3"
    ],
    "text":
        "خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰٓ أَبْصَٰرِهِمْ غِشَٰوَةٌۭ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌۭ",
    "numberInSurah": 7,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 2,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 15,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/15.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/15.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/15.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/15.mp3"
    ],
    "text":
        "وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلْيَوْمِ ٱلْءَاخِرِ وَمَا هُم بِمُؤْمِنِينَ",
    "numberInSurah": 8,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 16,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/16.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/16.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/16.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/16.mp3"
    ],
    "text":
        "يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "numberInSurah": 9,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 17,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/17.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/17.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/17.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/17.mp3"
    ],
    "text":
        "فِى قُلُوبِهِم مَّرَضٌۭ فَزَادَهُمُ ٱللَّهُ مَرَضًۭا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْذِبُونَ",
    "numberInSurah": 10,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 18,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/18.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/18.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/18.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/18.mp3"
    ],
    "text":
        "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ قَالُوٓا۟ إِنَّمَا نَحْنُ مُصْلِحُونَ",
    "numberInSurah": 11,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 19,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/19.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/19.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/19.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/19.mp3"
    ],
    "text": "أَلَآ إِنَّهُمْ هُمُ ٱلْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ",
    "numberInSurah": 12,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 20,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/20.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/20.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/20.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/20.mp3"
    ],
    "text":
        "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟ أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ ۗ أَلَآ إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعْلَمُونَ",
    "numberInSurah": 13,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 21,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/21.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/21.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/21.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/21.mp3"
    ],
    "text":
        "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَوْا۟ إِلَىٰ شَيَٰطِينِهِمْ قَالُوٓا۟ إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ",
    "numberInSurah": 14,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 22,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/22.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/22.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/22.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/22.mp3"
    ],
    "text":
        "ٱللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِى طُغْيَٰنِهِمْ يَعْمَهُونَ",
    "numberInSurah": 15,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 23,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/23.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/23.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/23.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/23.mp3"
    ],
    "text":
        "أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلضَّلَٰلَةَ بِٱلْهُدَىٰ فَمَا رَبِحَت تِّجَٰرَتُهُمْ وَمَا كَانُوا۟ مُهْتَدِينَ",
    "numberInSurah": 16,
    "juz": 1,
    "manzil": 1,
    "page": 3,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 24,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/24.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/24.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/24.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/24.mp3"
    ],
    "text":
        "مَثَلُهُمْ كَمَثَلِ ٱلَّذِى ٱسْتَوْقَدَ نَارًۭا فَلَمَّآ أَضَآءَتْ مَا حَوْلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِى ظُلُمَٰتٍۢ لَّا يُبْصِرُونَ",
    "numberInSurah": 17,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 25,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/25.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/25.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/25.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/25.mp3"
    ],
    "text": "صُمٌّۢ بُكْمٌ عُمْىٌۭ فَهُمْ لَا يَرْجِعُونَ",
    "numberInSurah": 18,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 26,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/26.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/26.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/26.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/26.mp3"
    ],
    "text":
        "أَوْ كَصَيِّبٍۢ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٌۭ وَرَعْدٌۭ وَبَرْقٌۭ يَجْعَلُونَ أَصَٰبِعَهُمْ فِىٓ ءَاذَانِهِم مِّنَ ٱلصَّوَٰعِقِ حَذَرَ ٱلْمَوْتِ ۚ وَٱللَّهُ مُحِيطٌۢ بِٱلْكَٰفِرِينَ",
    "numberInSurah": 19,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 27,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/27.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/27.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/27.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/27.mp3"
    ],
    "text":
        "يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَٰرَهُمْ ۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ ۚ وَلَوْ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَٰرِهِمْ ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "numberInSurah": 20,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 3,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 28,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/28.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/28.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/28.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/28.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلنَّاسُ ٱعْبُدُوا۟ رَبَّكُمُ ٱلَّذِى خَلَقَكُمْ وَٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
    "numberInSurah": 21,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 4,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 29,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/29.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/29.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/29.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/29.mp3"
    ],
    "text":
        "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ فِرَٰشًۭا وَٱلسَّمَآءَ بِنَآءًۭ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءًۭ فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزْقًۭا لَّكُمْ ۖ فَلَا تَجْعَلُوا۟ لِلَّهِ أَندَادًۭا وَأَنتُمْ تَعْلَمُونَ",
    "numberInSurah": 22,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 4,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 30,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/30.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/30.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/30.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/30.mp3"
    ],
    "text":
        "وَإِن كُنتُمْ فِى رَيْبٍۢ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا۟ بِسُورَةٍۢ مِّن مِّثْلِهِۦ وَٱدْعُوا۟ شُهَدَآءَكُم مِّن دُونِ ٱللَّهِ إِن كُنتُمْ صَٰدِقِينَ",
    "numberInSurah": 23,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 4,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 31,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/31.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/31.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/31.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/31.mp3"
    ],
    "text":
        "فَإِن لَّمْ تَفْعَلُوا۟ وَلَن تَفْعَلُوا۟ فَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِى وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَٰفِرِينَ",
    "numberInSurah": 24,
    "juz": 1,
    "manzil": 1,
    "page": 4,
    "ruku": 4,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 32,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/32.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/32.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/32.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/32.mp3"
    ],
    "text":
        "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ جَنَّٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍۢ رِّزْقًۭا ۙ قَالُوا۟ هَٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَٰبِهًۭا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌۭ مُّطَهَّرَةٌۭ ۖ وَهُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 25,
    "juz": 1,
    "manzil": 1,
    "page": 5,
    "ruku": 4,
    "hizbQuarter": 1,
    "sajda": false
  },
  {
    "number": 33,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/33.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/33.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/33.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/33.mp3"
    ],
    "text":
        "۞ إِنَّ ٱللَّهَ لَا يَسْتَحْىِۦٓ أَن يَضْرِبَ مَثَلًۭا مَّا بَعُوضَةًۭ فَمَا فَوْقَهَا ۚ فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ فَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۖ وَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلًۭا ۘ يُضِلُّ بِهِۦ كَثِيرًۭا وَيَهْدِى بِهِۦ كَثِيرًۭا ۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلْفَٰسِقِينَ",
    "numberInSurah": 26,
    "juz": 1,
    "manzil": 1,
    "page": 5,
    "ruku": 4,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 34,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/34.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/34.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/34.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/34.mp3"
    ],
    "text":
        "ٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ ۚ أُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
    "numberInSurah": 27,
    "juz": 1,
    "manzil": 1,
    "page": 5,
    "ruku": 4,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 35,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/35.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/35.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/35.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/35.mp3"
    ],
    "text":
        "كَيْفَ تَكْفُرُونَ بِٱللَّهِ وَكُنتُمْ أَمْوَٰتًۭا فَأَحْيَٰكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
    "numberInSurah": 28,
    "juz": 1,
    "manzil": 1,
    "page": 5,
    "ruku": 4,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 36,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/36.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/36.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/36.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/36.mp3"
    ],
    "text":
        "هُوَ ٱلَّذِى خَلَقَ لَكُم مَّا فِى ٱلْأَرْضِ جَمِيعًۭا ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبْعَ سَمَٰوَٰتٍۢ ۚ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "numberInSurah": 29,
    "juz": 1,
    "manzil": 1,
    "page": 5,
    "ruku": 4,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 37,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/37.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/37.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/37.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/37.mp3"
    ],
    "text":
        "وَإِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى جَاعِلٌۭ فِى ٱلْأَرْضِ خَلِيفَةًۭ ۖ قَالُوٓا۟ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ ٱلدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّىٓ أَعْلَمُ مَا لَا تَعْلَمُونَ",
    "numberInSurah": 30,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 38,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/38.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/38.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/38.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/38.mp3"
    ],
    "text":
        "وَعَلَّمَ ءَادَمَ ٱلْأَسْمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى ٱلْمَلَٰٓئِكَةِ فَقَالَ أَنۢبِـُٔونِى بِأَسْمَآءِ هَٰٓؤُلَآءِ إِن كُنتُمْ صَٰدِقِينَ",
    "numberInSurah": 31,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 39,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/39.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/39.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/39.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/39.mp3"
    ],
    "text":
        "قَالُوا۟ سُبْحَٰنَكَ لَا عِلْمَ لَنَآ إِلَّا مَا عَلَّمْتَنَآ ۖ إِنَّكَ أَنتَ ٱلْعَلِيمُ ٱلْحَكِيمُ",
    "numberInSurah": 32,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 40,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/40.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/40.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/40.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/40.mp3"
    ],
    "text":
        "قَالَ يَٰٓـَٔادَمُ أَنۢبِئْهُم بِأَسْمَآئِهِمْ ۖ فَلَمَّآ أَنۢبَأَهُم بِأَسْمَآئِهِمْ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّىٓ أَعْلَمُ غَيْبَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَأَعْلَمُ مَا تُبْدُونَ وَمَا كُنتُمْ تَكْتُمُونَ",
    "numberInSurah": 33,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 41,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/41.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/41.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/41.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/41.mp3"
    ],
    "text":
        "وَإِذْ قُلْنَا لِلْمَلَٰٓئِكَةِ ٱسْجُدُوا۟ لِءَادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ أَبَىٰ وَٱسْتَكْبَرَ وَكَانَ مِنَ ٱلْكَٰفِرِينَ",
    "numberInSurah": 34,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 42,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/42.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/42.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/42.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/42.mp3"
    ],
    "text":
        "وَقُلْنَا يَٰٓـَٔادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ",
    "numberInSurah": 35,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 43,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/43.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/43.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/43.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/43.mp3"
    ],
    "text":
        "فَأَزَلَّهُمَا ٱلشَّيْطَٰنُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ ۖ وَقُلْنَا ٱهْبِطُوا۟ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّۭ ۖ وَلَكُمْ فِى ٱلْأَرْضِ مُسْتَقَرٌّۭ وَمَتَٰعٌ إِلَىٰ حِينٍۢ",
    "numberInSurah": 36,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 44,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/44.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/44.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/44.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/44.mp3"
    ],
    "text":
        "فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٍۢ فَتَابَ عَلَيْهِ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "numberInSurah": 37,
    "juz": 1,
    "manzil": 1,
    "page": 6,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 45,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/45.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/45.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/45.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/45.mp3"
    ],
    "text":
        "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًۭا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًۭى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "numberInSurah": 38,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 46,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/46.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/46.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/46.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/46.mp3"
    ],
    "text":
        "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَٰتِنَآ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 39,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 5,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 47,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/47.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/47.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/47.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/47.mp3"
    ],
    "text":
        "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا۟ بِعَهْدِىٓ أُوفِ بِعَهْدِكُمْ وَإِيَّٰىَ فَٱرْهَبُونِ",
    "numberInSurah": 40,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 48,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/48.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/48.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/48.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/48.mp3"
    ],
    "text":
        "وَءَامِنُوا۟ بِمَآ أَنزَلْتُ مُصَدِّقًۭا لِّمَا مَعَكُمْ وَلَا تَكُونُوٓا۟ أَوَّلَ كَافِرٍۭ بِهِۦ ۖ وَلَا تَشْتَرُوا۟ بِـَٔايَٰتِى ثَمَنًۭا قَلِيلًۭا وَإِيَّٰىَ فَٱتَّقُونِ",
    "numberInSurah": 41,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 49,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/49.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/49.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/49.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/49.mp3"
    ],
    "text":
        "وَلَا تَلْبِسُوا۟ ٱلْحَقَّ بِٱلْبَٰطِلِ وَتَكْتُمُوا۟ ٱلْحَقَّ وَأَنتُمْ تَعْلَمُونَ",
    "numberInSurah": 42,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 50,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/50.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/50.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/50.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/50.mp3"
    ],
    "text":
        "وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱرْكَعُوا۟ مَعَ ٱلرَّٰكِعِينَ",
    "numberInSurah": 43,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 2,
    "sajda": false
  },
  {
    "number": 51,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/51.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/51.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/51.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/51.mp3"
    ],
    "text":
        "۞ أَتَأْمُرُونَ ٱلنَّاسَ بِٱلْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ ٱلْكِتَٰبَ ۚ أَفَلَا تَعْقِلُونَ",
    "numberInSurah": 44,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 52,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/52.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/52.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/52.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/52.mp3"
    ],
    "text":
        "وَٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلْخَٰشِعِينَ",
    "numberInSurah": 45,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 53,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/53.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/53.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/53.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/53.mp3"
    ],
    "text":
        "ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُوا۟ رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَٰجِعُونَ",
    "numberInSurah": 46,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 6,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 54,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/54.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/54.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/54.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/54.mp3"
    ],
    "text":
        "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ",
    "numberInSurah": 47,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 55,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/55.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/55.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/55.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/55.mp3"
    ],
    "text":
        "وَٱتَّقُوا۟ يَوْمًۭا لَّا تَجْزِى نَفْسٌ عَن نَّفْسٍۢ شَيْـًۭٔا وَلَا يُقْبَلُ مِنْهَا شَفَٰعَةٌۭ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌۭ وَلَا هُمْ يُنصَرُونَ",
    "numberInSurah": 48,
    "juz": 1,
    "manzil": 1,
    "page": 7,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 56,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/56.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/56.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/56.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/56.mp3"
    ],
    "text":
        "وَإِذْ نَجَّيْنَٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌۭ مِّن رَّبِّكُمْ عَظِيمٌۭ",
    "numberInSurah": 49,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 57,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/57.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/57.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/57.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/57.mp3"
    ],
    "text":
        "وَإِذْ فَرَقْنَا بِكُمُ ٱلْبَحْرَ فَأَنجَيْنَٰكُمْ وَأَغْرَقْنَآ ءَالَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ",
    "numberInSurah": 50,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 58,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/58.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/58.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/58.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/58.mp3"
    ],
    "text":
        "وَإِذْ وَٰعَدْنَا مُوسَىٰٓ أَرْبَعِينَ لَيْلَةًۭ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَٰلِمُونَ",
    "numberInSurah": 51,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 59,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/59.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/59.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/59.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/59.mp3"
    ],
    "text":
        "ثُمَّ عَفَوْنَا عَنكُم مِّنۢ بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ",
    "numberInSurah": 52,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 60,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/60.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/60.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/60.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/60.mp3"
    ],
    "text":
        "وَإِذْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَٱلْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ",
    "numberInSurah": 53,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 61,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/61.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/61.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/61.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/61.mp3"
    ],
    "text":
        "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَٰقَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلْعِجْلَ فَتُوبُوٓا۟ إِلَىٰ بَارِئِكُمْ فَٱقْتُلُوٓا۟ أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌۭ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "numberInSurah": 54,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 62,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/62.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/62.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/62.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/62.mp3"
    ],
    "text":
        "وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهْرَةًۭ فَأَخَذَتْكُمُ ٱلصَّٰعِقَةُ وَأَنتُمْ تَنظُرُونَ",
    "numberInSurah": 55,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 63,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/63.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/63.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/63.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/63.mp3"
    ],
    "text":
        "ثُمَّ بَعَثْنَٰكُم مِّنۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
    "numberInSurah": 56,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 64,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/64.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/64.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/64.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/64.mp3"
    ],
    "text":
        "وَظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ ۖ كُلُوا۟ مِن طَيِّبَٰتِ مَا رَزَقْنَٰكُمْ ۖ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
    "numberInSurah": 57,
    "juz": 1,
    "manzil": 1,
    "page": 8,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 65,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/65.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/65.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/65.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/65.mp3"
    ],
    "text":
        "وَإِذْ قُلْنَا ٱدْخُلُوا۟ هَٰذِهِ ٱلْقَرْيَةَ فَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًۭا وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًۭا وَقُولُوا۟ حِطَّةٌۭ نَّغْفِرْ لَكُمْ خَطَٰيَٰكُمْ ۚ وَسَنَزِيدُ ٱلْمُحْسِنِينَ",
    "numberInSurah": 58,
    "juz": 1,
    "manzil": 1,
    "page": 9,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 66,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/66.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/66.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/66.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/66.mp3"
    ],
    "text":
        "فَبَدَّلَ ٱلَّذِينَ ظَلَمُوا۟ قَوْلًا غَيْرَ ٱلَّذِى قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى ٱلَّذِينَ ظَلَمُوا۟ رِجْزًۭا مِّنَ ٱلسَّمَآءِ بِمَا كَانُوا۟ يَفْسُقُونَ",
    "numberInSurah": 59,
    "juz": 1,
    "manzil": 1,
    "page": 9,
    "ruku": 7,
    "hizbQuarter": 3,
    "sajda": false
  },
  {
    "number": 67,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/67.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/67.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/67.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/67.mp3"
    ],
    "text":
        "۞ وَإِذِ ٱسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِۦ فَقُلْنَا ٱضْرِب بِّعَصَاكَ ٱلْحَجَرَ ۖ فَٱنفَجَرَتْ مِنْهُ ٱثْنَتَا عَشْرَةَ عَيْنًۭا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍۢ مَّشْرَبَهُمْ ۖ كُلُوا۟ وَٱشْرَبُوا۟ مِن رِّزْقِ ٱللَّهِ وَلَا تَعْثَوْا۟ فِى ٱلْأَرْضِ مُفْسِدِينَ",
    "numberInSurah": 60,
    "juz": 1,
    "manzil": 1,
    "page": 9,
    "ruku": 8,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 68,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/68.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/68.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/68.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/68.mp3"
    ],
    "text":
        "وَإِذْ قُلْتُمْ يَٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍۢ وَٰحِدٍۢ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ۚ ٱهْبِطُوا۟ مِصْرًۭا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍۢ مِّنَ ٱللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّۦنَ بِغَيْرِ ٱلْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
    "numberInSurah": 61,
    "juz": 1,
    "manzil": 1,
    "page": 9,
    "ruku": 8,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 69,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/69.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/69.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/69.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/69.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَعَمِلَ صَٰلِحًۭا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "numberInSurah": 62,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 70,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/70.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/70.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/70.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/70.mp3"
    ],
    "text":
        "وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَٰكُم بِقُوَّةٍۢ وَٱذْكُرُوا۟ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
    "numberInSurah": 63,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 71,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/71.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/71.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/71.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/71.mp3"
    ],
    "text":
        "ثُمَّ تَوَلَّيْتُم مِّنۢ بَعْدِ ذَٰلِكَ ۖ فَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَكُنتُم مِّنَ ٱلْخَٰسِرِينَ",
    "numberInSurah": 64,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 72,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/72.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/72.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/72.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/72.mp3"
    ],
    "text":
        "وَلَقَدْ عَلِمْتُمُ ٱلَّذِينَ ٱعْتَدَوْا۟ مِنكُمْ فِى ٱلسَّبْتِ فَقُلْنَا لَهُمْ كُونُوا۟ قِرَدَةً خَٰسِـِٔينَ",
    "numberInSurah": 65,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 73,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/73.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/73.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/73.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/73.mp3"
    ],
    "text":
        "فَجَعَلْنَٰهَا نَكَٰلًۭا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةًۭ لِّلْمُتَّقِينَ",
    "numberInSurah": 66,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 74,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/74.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/74.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/74.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/74.mp3"
    ],
    "text":
        "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦٓ إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا۟ بَقَرَةًۭ ۖ قَالُوٓا۟ أَتَتَّخِذُنَا هُزُوًۭا ۖ قَالَ أَعُوذُ بِٱللَّهِ أَنْ أَكُونَ مِنَ ٱلْجَٰهِلِينَ",
    "numberInSurah": 67,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 75,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/75.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/75.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/75.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/75.mp3"
    ],
    "text":
        "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ لَّا فَارِضٌۭ وَلَا بِكْرٌ عَوَانٌۢ بَيْنَ ذَٰلِكَ ۖ فَٱفْعَلُوا۟ مَا تُؤْمَرُونَ",
    "numberInSurah": 68,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 76,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/76.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/76.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/76.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/76.mp3"
    ],
    "text":
        "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ صَفْرَآءُ فَاقِعٌۭ لَّوْنُهَا تَسُرُّ ٱلنَّٰظِرِينَ",
    "numberInSurah": 69,
    "juz": 1,
    "manzil": 1,
    "page": 10,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 77,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/77.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/77.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/77.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/77.mp3"
    ],
    "text":
        "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ إِنَّ ٱلْبَقَرَ تَشَٰبَهَ عَلَيْنَا وَإِنَّآ إِن شَآءَ ٱللَّهُ لَمُهْتَدُونَ",
    "numberInSurah": 70,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 78,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/78.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/78.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/78.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/78.mp3"
    ],
    "text":
        "قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ لَّا ذَلُولٌۭ تُثِيرُ ٱلْأَرْضَ وَلَا تَسْقِى ٱلْحَرْثَ مُسَلَّمَةٌۭ لَّا شِيَةَ فِيهَا ۚ قَالُوا۟ ٱلْـَٰٔنَ جِئْتَ بِٱلْحَقِّ ۚ فَذَبَحُوهَا وَمَا كَادُوا۟ يَفْعَلُونَ",
    "numberInSurah": 71,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 9,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 79,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/79.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/79.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/79.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/79.mp3"
    ],
    "text":
        "وَإِذْ قَتَلْتُمْ نَفْسًۭا فَٱدَّٰرَْٰٔتُمْ فِيهَا ۖ وَٱللَّهُ مُخْرِجٌۭ مَّا كُنتُمْ تَكْتُمُونَ",
    "numberInSurah": 72,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 10,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 80,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/80.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/80.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/80.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/80.mp3"
    ],
    "text":
        "فَقُلْنَا ٱضْرِبُوهُ بِبَعْضِهَا ۚ كَذَٰلِكَ يُحْىِ ٱللَّهُ ٱلْمَوْتَىٰ وَيُرِيكُمْ ءَايَٰتِهِۦ لَعَلَّكُمْ تَعْقِلُونَ",
    "numberInSurah": 73,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 10,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 81,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/81.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/81.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/81.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/81.mp3"
    ],
    "text":
        "ثُمَّ قَسَتْ قُلُوبُكُم مِّنۢ بَعْدِ ذَٰلِكَ فَهِىَ كَٱلْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةًۭ ۚ وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلْأَنْهَٰرُ ۚ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ ٱلْمَآءُ ۚ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
    "numberInSurah": 74,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 10,
    "hizbQuarter": 4,
    "sajda": false
  },
  {
    "number": 82,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/82.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/82.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/82.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/82.mp3"
    ],
    "text":
        "۞ أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌۭ مِّنْهُمْ يَسْمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ",
    "numberInSurah": 75,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 83,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/83.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/83.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/83.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/83.mp3"
    ],
    "text":
        "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍۢ قَالُوٓا۟ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيْكُمْ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ",
    "numberInSurah": 76,
    "juz": 1,
    "manzil": 1,
    "page": 11,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 84,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/84.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/84.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/84.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/84.mp3"
    ],
    "text":
        "أَوَلَا يَعْلَمُونَ أَنَّ ٱللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
    "numberInSurah": 77,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 85,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/85.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/85.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/85.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/85.mp3"
    ],
    "text":
        "وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ ٱلْكِتَٰبَ إِلَّآ أَمَانِىَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ",
    "numberInSurah": 78,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 86,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/86.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/86.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/86.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/86.mp3"
    ],
    "text":
        "فَوَيْلٌۭ لِّلَّذِينَ يَكْتُبُونَ ٱلْكِتَٰبَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِندِ ٱللَّهِ لِيَشْتَرُوا۟ بِهِۦ ثَمَنًۭا قَلِيلًۭا ۖ فَوَيْلٌۭ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌۭ لَّهُم مِّمَّا يَكْسِبُونَ",
    "numberInSurah": 79,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 87,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/87.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/87.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/87.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/87.mp3"
    ],
    "text":
        "وَقَالُوا۟ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامًۭا مَّعْدُودَةًۭ ۚ قُلْ أَتَّخَذْتُمْ عِندَ ٱللَّهِ عَهْدًۭا فَلَن يُخْلِفَ ٱللَّهُ عَهْدَهُۥٓ ۖ أَمْ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "numberInSurah": 80,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 88,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/88.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/88.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/88.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/88.mp3"
    ],
    "text":
        "بَلَىٰ مَن كَسَبَ سَيِّئَةًۭ وَأَحَٰطَتْ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 81,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 89,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/89.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/89.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/89.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/89.mp3"
    ],
    "text":
        "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 82,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 10,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 90,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/90.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/90.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/90.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/90.mp3"
    ],
    "text":
        "وَإِذْ أَخَذْنَا مِيثَٰقَ بَنِىٓ إِسْرَٰٓءِيلَ لَا تَعْبُدُونَ إِلَّا ٱللَّهَ وَبِٱلْوَٰلِدَيْنِ إِحْسَانًۭا وَذِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَقُولُوا۟ لِلنَّاسِ حُسْنًۭا وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًۭا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ",
    "numberInSurah": 83,
    "juz": 1,
    "manzil": 1,
    "page": 12,
    "ruku": 11,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 91,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/91.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/91.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/91.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/91.mp3"
    ],
    "text":
        "وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ لَا تَسْفِكُونَ دِمَآءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَٰرِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ",
    "numberInSurah": 84,
    "juz": 1,
    "manzil": 1,
    "page": 13,
    "ruku": 11,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 92,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/92.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/92.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/92.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/92.mp3"
    ],
    "text":
        "ثُمَّ أَنتُمْ هَٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًۭا مِّنكُم مِّن دِيَٰرِهِمْ تَظَٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَٰرَىٰ تُفَٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَٰبِ وَتَكْفُرُونَ بِبَعْضٍۢ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌۭ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
    "numberInSurah": 85,
    "juz": 1,
    "manzil": 1,
    "page": 13,
    "ruku": 11,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 93,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/93.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/93.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/93.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/93.mp3"
    ],
    "text":
        "أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلْحَيَوٰةَ ٱلدُّنْيَا بِٱلْءَاخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنصَرُونَ",
    "numberInSurah": 86,
    "juz": 1,
    "manzil": 1,
    "page": 13,
    "ruku": 11,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 94,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/94.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/94.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/94.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/94.mp3"
    ],
    "text":
        "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَٰبَ وَقَفَّيْنَا مِنۢ بَعْدِهِۦ بِٱلرُّسُلِ ۖ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ ٱلْقُدُسِ ۗ أَفَكُلَّمَا جَآءَكُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُكُمُ ٱسْتَكْبَرْتُمْ فَفَرِيقًۭا كَذَّبْتُمْ وَفَرِيقًۭا تَقْتُلُونَ",
    "numberInSurah": 87,
    "juz": 1,
    "manzil": 1,
    "page": 13,
    "ruku": 12,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 95,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/95.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/95.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/95.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/95.mp3"
    ],
    "text":
        "وَقَالُوا۟ قُلُوبُنَا غُلْفٌۢ ۚ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفْرِهِمْ فَقَلِيلًۭا مَّا يُؤْمِنُونَ",
    "numberInSurah": 88,
    "juz": 1,
    "manzil": 1,
    "page": 13,
    "ruku": 12,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 96,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/96.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/96.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/96.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/96.mp3"
    ],
    "text":
        "وَلَمَّا جَآءَهُمْ كِتَٰبٌۭ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌۭ لِّمَا مَعَهُمْ وَكَانُوا۟ مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى ٱلَّذِينَ كَفَرُوا۟ فَلَمَّا جَآءَهُم مَّا عَرَفُوا۟ كَفَرُوا۟ بِهِۦ ۚ فَلَعْنَةُ ٱللَّهِ عَلَى ٱلْكَٰفِرِينَ",
    "numberInSurah": 89,
    "juz": 1,
    "manzil": 1,
    "page": 14,
    "ruku": 12,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 97,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/97.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/97.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/97.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/97.mp3"
    ],
    "text":
        "بِئْسَمَا ٱشْتَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ أَن يَكْفُرُوا۟ بِمَآ أَنزَلَ ٱللَّهُ بَغْيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضْلِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٍۢ ۚ وَلِلْكَٰفِرِينَ عَذَابٌۭ مُّهِينٌۭ",
    "numberInSurah": 90,
    "juz": 1,
    "manzil": 1,
    "page": 14,
    "ruku": 12,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 98,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/98.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/98.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/98.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/98.mp3"
    ],
    "text":
        "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ بِمَآ أَنزَلَ ٱللَّهُ قَالُوا۟ نُؤْمِنُ بِمَآ أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلْحَقُّ مُصَدِّقًۭا لِّمَا مَعَهُمْ ۗ قُلْ فَلِمَ تَقْتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ",
    "numberInSurah": 91,
    "juz": 1,
    "manzil": 1,
    "page": 14,
    "ruku": 12,
    "hizbQuarter": 5,
    "sajda": false
  },
  {
    "number": 99,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/99.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/99.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/99.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/99.mp3"
    ],
    "text":
        "۞ وَلَقَدْ جَآءَكُم مُّوسَىٰ بِٱلْبَيِّنَٰتِ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَٰلِمُونَ",
    "numberInSurah": 92,
    "juz": 1,
    "manzil": 1,
    "page": 14,
    "ruku": 12,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 100,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/100.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/100.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/100.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/100.mp3"
    ],
    "text":
        "وَإِذْ أَخَذْنَا مِيثَٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَٰكُم بِقُوَّةٍۢ وَٱسْمَعُوا۟ ۖ قَالُوا۟ سَمِعْنَا وَعَصَيْنَا وَأُشْرِبُوا۟ فِى قُلُوبِهِمُ ٱلْعِجْلَ بِكُفْرِهِمْ ۚ قُلْ بِئْسَمَا يَأْمُرُكُم بِهِۦٓ إِيمَٰنُكُمْ إِن كُنتُم مُّؤْمِنِينَ",
    "numberInSurah": 93,
    "juz": 1,
    "manzil": 1,
    "page": 14,
    "ruku": 12,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 101,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/101.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/101.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/101.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/101.mp3"
    ],
    "text":
        "قُلْ إِن كَانَتْ لَكُمُ ٱلدَّارُ ٱلْءَاخِرَةُ عِندَ ٱللَّهِ خَالِصَةًۭ مِّن دُونِ ٱلنَّاسِ فَتَمَنَّوُا۟ ٱلْمَوْتَ إِن كُنتُمْ صَٰدِقِينَ",
    "numberInSurah": 94,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 12,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 102,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/102.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/102.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/102.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/102.mp3"
    ],
    "text":
        "وَلَن يَتَمَنَّوْهُ أَبَدًۢا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّٰلِمِينَ",
    "numberInSurah": 95,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 12,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 103,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/103.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/103.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/103.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/103.mp3"
    ],
    "text":
        "وَلَتَجِدَنَّهُمْ أَحْرَصَ ٱلنَّاسِ عَلَىٰ حَيَوٰةٍۢ وَمِنَ ٱلَّذِينَ أَشْرَكُوا۟ ۚ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍۢ وَمَا هُوَ بِمُزَحْزِحِهِۦ مِنَ ٱلْعَذَابِ أَن يُعَمَّرَ ۗ وَٱللَّهُ بَصِيرٌۢ بِمَا يَعْمَلُونَ",
    "numberInSurah": 96,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 12,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 104,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/104.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/104.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/104.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/104.mp3"
    ],
    "text":
        "قُلْ مَن كَانَ عَدُوًّۭا لِّجِبْرِيلَ فَإِنَّهُۥ نَزَّلَهُۥ عَلَىٰ قَلْبِكَ بِإِذْنِ ٱللَّهِ مُصَدِّقًۭا لِّمَا بَيْنَ يَدَيْهِ وَهُدًۭى وَبُشْرَىٰ لِلْمُؤْمِنِينَ",
    "numberInSurah": 97,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 105,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/105.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/105.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/105.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/105.mp3"
    ],
    "text":
        "مَن كَانَ عَدُوًّۭا لِّلَّهِ وَمَلَٰٓئِكَتِهِۦ وَرُسُلِهِۦ وَجِبْرِيلَ وَمِيكَىٰلَ فَإِنَّ ٱللَّهَ عَدُوٌّۭ لِّلْكَٰفِرِينَ",
    "numberInSurah": 98,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 106,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/106.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/106.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/106.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/106.mp3"
    ],
    "text":
        "وَلَقَدْ أَنزَلْنَآ إِلَيْكَ ءَايَٰتٍۭ بَيِّنَٰتٍۢ ۖ وَمَا يَكْفُرُ بِهَآ إِلَّا ٱلْفَٰسِقُونَ",
    "numberInSurah": 99,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 107,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/107.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/107.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/107.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/107.mp3"
    ],
    "text":
        "أَوَكُلَّمَا عَٰهَدُوا۟ عَهْدًۭا نَّبَذَهُۥ فَرِيقٌۭ مِّنْهُم ۚ بَلْ أَكْثَرُهُمْ لَا يُؤْمِنُونَ",
    "numberInSurah": 100,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 108,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/108.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/108.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/108.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/108.mp3"
    ],
    "text":
        "وَلَمَّا جَآءَهُمْ رَسُولٌۭ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌۭ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌۭ مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ كِتَٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ",
    "numberInSurah": 101,
    "juz": 1,
    "manzil": 1,
    "page": 15,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 109,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/109.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/109.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/109.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/109.mp3"
    ],
    "text":
        "وَٱتَّبَعُوا۟ مَا تَتْلُوا۟ ٱلشَّيَٰطِينُ عَلَىٰ مُلْكِ سُلَيْمَٰنَ ۖ وَمَا كَفَرَ سُلَيْمَٰنُ وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُوا۟ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحْرَ وَمَآ أُنزِلَ عَلَى ٱلْمَلَكَيْنِ بِبَابِلَ هَٰرُوتَ وَمَٰرُوتَ ۚ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحْنُ فِتْنَةٌۭ فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيْنَ ٱلْمَرْءِ وَزَوْجِهِۦ ۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنْ أَحَدٍ إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ ۚ وَلَقَدْ عَلِمُوا۟ لَمَنِ ٱشْتَرَىٰهُ مَا لَهُۥ فِى ٱلْءَاخِرَةِ مِنْ خَلَٰقٍۢ ۚ وَلَبِئْسَ مَا شَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ",
    "numberInSurah": 102,
    "juz": 1,
    "manzil": 1,
    "page": 16,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 110,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/110.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/110.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/110.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/110.mp3"
    ],
    "text":
        "وَلَوْ أَنَّهُمْ ءَامَنُوا۟ وَٱتَّقَوْا۟ لَمَثُوبَةٌۭ مِّنْ عِندِ ٱللَّهِ خَيْرٌۭ ۖ لَّوْ كَانُوا۟ يَعْلَمُونَ",
    "numberInSurah": 103,
    "juz": 1,
    "manzil": 1,
    "page": 16,
    "ruku": 13,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 111,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/111.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/111.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/111.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/111.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقُولُوا۟ رَٰعِنَا وَقُولُوا۟ ٱنظُرْنَا وَٱسْمَعُوا۟ ۗ وَلِلْكَٰفِرِينَ عَذَابٌ أَلِيمٌۭ",
    "numberInSurah": 104,
    "juz": 1,
    "manzil": 1,
    "page": 16,
    "ruku": 14,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 112,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/112.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/112.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/112.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/112.mp3"
    ],
    "text":
        "مَّا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَلَا ٱلْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍۢ مِّن رَّبِّكُمْ ۗ وَٱللَّهُ يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "numberInSurah": 105,
    "juz": 1,
    "manzil": 1,
    "page": 16,
    "ruku": 14,
    "hizbQuarter": 6,
    "sajda": false
  },
  {
    "number": 113,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/113.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/113.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/113.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/113.mp3"
    ],
    "text":
        "۞ مَا نَنسَخْ مِنْ ءَايَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍۢ مِّنْهَآ أَوْ مِثْلِهَآ ۗ أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
    "numberInSurah": 106,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 114,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/114.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/114.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/114.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/114.mp3"
    ],
    "text":
        "أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۗ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِىٍّۢ وَلَا نَصِيرٍ",
    "numberInSurah": 107,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 115,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/115.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/115.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/115.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/115.mp3"
    ],
    "text":
        "أَمْ تُرِيدُونَ أَن تَسْـَٔلُوا۟ رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ ۗ وَمَن يَتَبَدَّلِ ٱلْكُفْرَ بِٱلْإِيمَٰنِ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
    "numberInSurah": 108,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 116,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/116.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/116.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/116.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/116.mp3"
    ],
    "text":
        "وَدَّ كَثِيرٌۭ مِّنْ أَهْلِ ٱلْكِتَٰبِ لَوْ يَرُدُّونَكُم مِّنۢ بَعْدِ إِيمَٰنِكُمْ كُفَّارًا حَسَدًۭا مِّنْ عِندِ أَنفُسِهِم مِّنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ ٱلْحَقُّ ۖ فَٱعْفُوا۟ وَٱصْفَحُوا۟ حَتَّىٰ يَأْتِىَ ٱللَّهُ بِأَمْرِهِۦٓ ۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "numberInSurah": 109,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 117,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/117.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/117.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/117.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/117.mp3"
    ],
    "text":
        "وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ۚ وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنْ خَيْرٍۢ تَجِدُوهُ عِندَ ٱللَّهِ ۗ إِنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌۭ",
    "numberInSurah": 110,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 118,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/118.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/118.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/118.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/118.mp3"
    ],
    "text":
        "وَقَالُوا۟ لَن يَدْخُلَ ٱلْجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوْ نَصَٰرَىٰ ۗ تِلْكَ أَمَانِيُّهُمْ ۗ قُلْ هَاتُوا۟ بُرْهَٰنَكُمْ إِن كُنتُمْ صَٰدِقِينَ",
    "numberInSurah": 111,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 119,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/119.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/119.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/119.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/119.mp3"
    ],
    "text":
        "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌۭ فَلَهُۥٓ أَجْرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "numberInSurah": 112,
    "juz": 1,
    "manzil": 1,
    "page": 17,
    "ruku": 14,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 120,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/120.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/120.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/120.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/120.mp3"
    ],
    "text":
        "وَقَالَتِ ٱلْيَهُودُ لَيْسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَىْءٍۢ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيْسَتِ ٱلْيَهُودُ عَلَىٰ شَىْءٍۢ وَهُمْ يَتْلُونَ ٱلْكِتَٰبَ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعْلَمُونَ مِثْلَ قَوْلِهِمْ ۚ فَٱللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "numberInSurah": 113,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 121,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/121.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/121.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/121.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/121.mp3"
    ],
    "text":
        "وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذْكَرَ فِيهَا ٱسْمُهُۥ وَسَعَىٰ فِى خَرَابِهَآ ۚ أُو۟لَٰٓئِكَ مَا كَانَ لَهُمْ أَن يَدْخُلُوهَآ إِلَّا خَآئِفِينَ ۚ لَهُمْ فِى ٱلدُّنْيَا خِزْىٌۭ وَلَهُمْ فِى ٱلْءَاخِرَةِ عَذَابٌ عَظِيمٌۭ",
    "numberInSurah": 114,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 122,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/122.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/122.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/122.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/122.mp3"
    ],
    "text":
        "وَلِلَّهِ ٱلْمَشْرِقُ وَٱلْمَغْرِبُ ۚ فَأَيْنَمَا تُوَلُّوا۟ فَثَمَّ وَجْهُ ٱللَّهِ ۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٌۭ",
    "numberInSurah": 115,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 123,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/123.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/123.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/123.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/123.mp3"
    ],
    "text":
        "وَقَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدًۭا ۗ سُبْحَٰنَهُۥ ۖ بَل لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۖ كُلٌّۭ لَّهُۥ قَٰنِتُونَ",
    "numberInSurah": 116,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 124,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/124.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/124.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/124.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/124.mp3"
    ],
    "text":
        "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۖ وَإِذَا قَضَىٰٓ أَمْرًۭا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
    "numberInSurah": 117,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 125,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/125.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/125.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/125.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/125.mp3"
    ],
    "text":
        "وَقَالَ ٱلَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا ٱللَّهُ أَوْ تَأْتِينَآ ءَايَةٌۭ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبْلِهِم مِّثْلَ قَوْلِهِمْ ۘ تَشَٰبَهَتْ قُلُوبُهُمْ ۗ قَدْ بَيَّنَّا ٱلْءَايَٰتِ لِقَوْمٍۢ يُوقِنُونَ",
    "numberInSurah": 118,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 126,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/126.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/126.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/126.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/126.mp3"
    ],
    "text":
        "إِنَّآ أَرْسَلْنَٰكَ بِٱلْحَقِّ بَشِيرًۭا وَنَذِيرًۭا ۖ وَلَا تُسْـَٔلُ عَنْ أَصْحَٰبِ ٱلْجَحِيمِ",
    "numberInSurah": 119,
    "juz": 1,
    "manzil": 1,
    "page": 18,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 127,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/127.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/127.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/127.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/127.mp3"
    ],
    "text":
        "وَلَن تَرْضَىٰ عَنكَ ٱلْيَهُودُ وَلَا ٱلنَّصَٰرَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ ۗ قُلْ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلْهُدَىٰ ۗ وَلَئِنِ ٱتَّبَعْتَ أَهْوَآءَهُم بَعْدَ ٱلَّذِى جَآءَكَ مِنَ ٱلْعِلْمِ ۙ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِىٍّۢ وَلَا نَصِيرٍ",
    "numberInSurah": 120,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 128,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/128.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/128.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/128.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/128.mp3"
    ],
    "text":
        "ٱلَّذِينَ ءَاتَيْنَٰهُمُ ٱلْكِتَٰبَ يَتْلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُو۟لَٰٓئِكَ يُؤْمِنُونَ بِهِۦ ۗ وَمَن يَكْفُرْ بِهِۦ فَأُو۟لَٰٓئِكَ هُمُ ٱلْخَٰسِرُونَ",
    "numberInSurah": 121,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 15,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 129,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/129.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/129.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/129.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/129.mp3"
    ],
    "text":
        "يَٰبَنِىٓ إِسْرَٰٓءِيلَ ٱذْكُرُوا۟ نِعْمَتِىَ ٱلَّتِىٓ أَنْعَمْتُ عَلَيْكُمْ وَأَنِّى فَضَّلْتُكُمْ عَلَى ٱلْعَٰلَمِينَ",
    "numberInSurah": 122,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 16,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 130,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/130.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/130.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/130.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/130.mp3"
    ],
    "text":
        "وَٱتَّقُوا۟ يَوْمًۭا لَّا تَجْزِى نَفْسٌ عَن نَّفْسٍۢ شَيْـًۭٔا وَلَا يُقْبَلُ مِنْهَا عَدْلٌۭ وَلَا تَنفَعُهَا شَفَٰعَةٌۭ وَلَا هُمْ يُنصَرُونَ",
    "numberInSurah": 123,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 16,
    "hizbQuarter": 7,
    "sajda": false
  },
  {
    "number": 131,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/131.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/131.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/131.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/131.mp3"
    ],
    "text":
        "۞ وَإِذِ ٱبْتَلَىٰٓ إِبْرَٰهِۦمَ رَبُّهُۥ بِكَلِمَٰتٍۢ فَأَتَمَّهُنَّ ۖ قَالَ إِنِّى جَاعِلُكَ لِلنَّاسِ إِمَامًۭا ۖ قَالَ وَمِن ذُرِّيَّتِى ۖ قَالَ لَا يَنَالُ عَهْدِى ٱلظَّٰلِمِينَ",
    "numberInSurah": 124,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 16,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 132,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/132.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/132.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/132.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/132.mp3"
    ],
    "text":
        "وَإِذْ جَعَلْنَا ٱلْبَيْتَ مَثَابَةًۭ لِّلنَّاسِ وَأَمْنًۭا وَٱتَّخِذُوا۟ مِن مَّقَامِ إِبْرَٰهِۦمَ مُصَلًّۭى ۖ وَعَهِدْنَآ إِلَىٰٓ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ أَن طَهِّرَا بَيْتِىَ لِلطَّآئِفِينَ وَٱلْعَٰكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ",
    "numberInSurah": 125,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 16,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 133,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/133.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/133.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/133.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/133.mp3"
    ],
    "text":
        "وَإِذْ قَالَ إِبْرَٰهِۦمُ رَبِّ ٱجْعَلْ هَٰذَا بَلَدًا ءَامِنًۭا وَٱرْزُقْ أَهْلَهُۥ مِنَ ٱلثَّمَرَٰتِ مَنْ ءَامَنَ مِنْهُم بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ۖ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُۥ قَلِيلًۭا ثُمَّ أَضْطَرُّهُۥٓ إِلَىٰ عَذَابِ ٱلنَّارِ ۖ وَبِئْسَ ٱلْمَصِيرُ",
    "numberInSurah": 126,
    "juz": 1,
    "manzil": 1,
    "page": 19,
    "ruku": 16,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 134,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/134.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/134.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/134.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/134.mp3"
    ],
    "text":
        "وَإِذْ يَرْفَعُ إِبْرَٰهِۦمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَٰعِيلُ رَبَّنَا تَقَبَّلْ مِنَّآ ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "numberInSurah": 127,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 16,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 135,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/135.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/135.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/135.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/135.mp3"
    ],
    "text":
        "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةًۭ مُّسْلِمَةًۭ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ ۖ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "numberInSurah": 128,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 16,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 136,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/136.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/136.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/136.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/136.mp3"
    ],
    "text":
        "رَبَّنَا وَٱبْعَثْ فِيهِمْ رَسُولًۭا مِّنْهُمْ يَتْلُوا۟ عَلَيْهِمْ ءَايَٰتِكَ وَيُعَلِّمُهُمُ ٱلْكِتَٰبَ وَٱلْحِكْمَةَ وَيُزَكِّيهِمْ ۚ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "numberInSurah": 129,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 16,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 137,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/137.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/137.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/137.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/137.mp3"
    ],
    "text":
        "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَٰهِۦمَ إِلَّا مَن سَفِهَ نَفْسَهُۥ ۚ وَلَقَدِ ٱصْطَفَيْنَٰهُ فِى ٱلدُّنْيَا ۖ وَإِنَّهُۥ فِى ٱلْءَاخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ",
    "numberInSurah": 130,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 138,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/138.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/138.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/138.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/138.mp3"
    ],
    "text":
        "إِذْ قَالَ لَهُۥ رَبُّهُۥٓ أَسْلِمْ ۖ قَالَ أَسْلَمْتُ لِرَبِّ ٱلْعَٰلَمِينَ",
    "numberInSurah": 131,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 139,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/139.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/139.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/139.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/139.mp3"
    ],
    "text":
        "وَوَصَّىٰ بِهَآ إِبْرَٰهِۦمُ بَنِيهِ وَيَعْقُوبُ يَٰبَنِىَّ إِنَّ ٱللَّهَ ٱصْطَفَىٰ لَكُمُ ٱلدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
    "numberInSurah": 132,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 140,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/140.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/140.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/140.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/140.mp3"
    ],
    "text":
        "أَمْ كُنتُمْ شُهَدَآءَ إِذْ حَضَرَ يَعْقُوبَ ٱلْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِنۢ بَعْدِى قَالُوا۟ نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ ءَابَآئِكَ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ إِلَٰهًۭا وَٰحِدًۭا وَنَحْنُ لَهُۥ مُسْلِمُونَ",
    "numberInSurah": 133,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 141,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/141.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/141.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/141.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/141.mp3"
    ],
    "text":
        "تِلْكَ أُمَّةٌۭ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْـَٔلُونَ عَمَّا كَانُوا۟ يَعْمَلُونَ",
    "numberInSurah": 134,
    "juz": 1,
    "manzil": 1,
    "page": 20,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 142,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/142.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/142.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/142.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/142.mp3"
    ],
    "text":
        "وَقَالُوا۟ كُونُوا۟ هُودًا أَوْ نَصَٰرَىٰ تَهْتَدُوا۟ ۗ قُلْ بَلْ مِلَّةَ إِبْرَٰهِۦمَ حَنِيفًۭا ۖ وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
    "numberInSurah": 135,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 143,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/143.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/143.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/143.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/143.mp3"
    ],
    "text":
        "قُولُوٓا۟ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيْنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ وَيَعْقُوبَ وَٱلْأَسْبَاطِ وَمَآ أُوتِىَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِىَ ٱلنَّبِيُّونَ مِن رَّبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّنْهُمْ وَنَحْنُ لَهُۥ مُسْلِمُونَ",
    "numberInSurah": 136,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 144,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/144.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/144.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/144.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/144.mp3"
    ],
    "text":
        "فَإِنْ ءَامَنُوا۟ بِمِثْلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهْتَدَوا۟ ۖ وَّإِن تَوَلَّوْا۟ فَإِنَّمَا هُمْ فِى شِقَاقٍۢ ۖ فَسَيَكْفِيكَهُمُ ٱللَّهُ ۚ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "numberInSurah": 137,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 145,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/145.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/145.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/145.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/145.mp3"
    ],
    "text":
        "صِبْغَةَ ٱللَّهِ ۖ وَمَنْ أَحْسَنُ مِنَ ٱللَّهِ صِبْغَةًۭ ۖ وَنَحْنُ لَهُۥ عَٰبِدُونَ",
    "numberInSurah": 138,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 146,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/146.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/146.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/146.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/146.mp3"
    ],
    "text":
        "قُلْ أَتُحَآجُّونَنَا فِى ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَآ أَعْمَٰلُنَا وَلَكُمْ أَعْمَٰلُكُمْ وَنَحْنُ لَهُۥ مُخْلِصُونَ",
    "numberInSurah": 139,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 147,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/147.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/147.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/147.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/147.mp3"
    ],
    "text":
        "أَمْ تَقُولُونَ إِنَّ إِبْرَٰهِۦمَ وَإِسْمَٰعِيلَ وَإِسْحَٰقَ وَيَعْقُوبَ وَٱلْأَسْبَاطَ كَانُوا۟ هُودًا أَوْ نَصَٰرَىٰ ۗ قُلْ ءَأَنتُمْ أَعْلَمُ أَمِ ٱللَّهُ ۗ وَمَنْ أَظْلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
    "numberInSurah": 140,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 148,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/148.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/148.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/148.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/148.mp3"
    ],
    "text":
        "تِلْكَ أُمَّةٌۭ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْـَٔلُونَ عَمَّا كَانُوا۟ يَعْمَلُونَ",
    "numberInSurah": 141,
    "juz": 1,
    "manzil": 1,
    "page": 21,
    "ruku": 17,
    "hizbQuarter": 8,
    "sajda": false
  },
  {
    "number": 149,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/149.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/149.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/149.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/149.mp3"
    ],
    "text":
        "۞ سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمْ عَن قِبْلَتِهِمُ ٱلَّتِى كَانُوا۟ عَلَيْهَا ۚ قُل لِّلَّهِ ٱلْمَشْرِقُ وَٱلْمَغْرِبُ ۚ يَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
    "numberInSurah": 142,
    "juz": 2,
    "manzil": 1,
    "page": 22,
    "ruku": 18,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 150,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/150.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/150.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/150.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/150.mp3"
    ],
    "text":
        "وَكَذَٰلِكَ جَعَلْنَٰكُمْ أُمَّةًۭ وَسَطًۭا لِّتَكُونُوا۟ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًۭا ۗ وَمَا جَعَلْنَا ٱلْقِبْلَةَ ٱلَّتِى كُنتَ عَلَيْهَآ إِلَّا لِنَعْلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيْهِ ۚ وَإِن كَانَتْ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُ ۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمْ ۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٌۭ رَّحِيمٌۭ",
    "numberInSurah": 143,
    "juz": 2,
    "manzil": 1,
    "page": 22,
    "ruku": 18,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 151,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/151.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/151.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/151.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/151.mp3"
    ],
    "text":
        "قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِى ٱلسَّمَآءِ ۖ فَلَنُوَلِّيَنَّكَ قِبْلَةًۭ تَرْضَىٰهَا ۚ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ ۗ وَإِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ لَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعْمَلُونَ",
    "numberInSurah": 144,
    "juz": 2,
    "manzil": 1,
    "page": 22,
    "ruku": 18,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 152,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/152.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/152.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/152.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/152.mp3"
    ],
    "text":
        "وَلَئِنْ أَتَيْتَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ بِكُلِّ ءَايَةٍۢ مَّا تَبِعُوا۟ قِبْلَتَكَ ۚ وَمَآ أَنتَ بِتَابِعٍۢ قِبْلَتَهُمْ ۚ وَمَا بَعْضُهُم بِتَابِعٍۢ قِبْلَةَ بَعْضٍۢ ۚ وَلَئِنِ ٱتَّبَعْتَ أَهْوَآءَهُم مِّنۢ بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ ۙ إِنَّكَ إِذًۭا لَّمِنَ ٱلظَّٰلِمِينَ",
    "numberInSurah": 145,
    "juz": 2,
    "manzil": 1,
    "page": 22,
    "ruku": 18,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 153,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/153.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/153.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/153.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/153.mp3"
    ],
    "text":
        "ٱلَّذِينَ ءَاتَيْنَٰهُمُ ٱلْكِتَٰبَ يَعْرِفُونَهُۥ كَمَا يَعْرِفُونَ أَبْنَآءَهُمْ ۖ وَإِنَّ فَرِيقًۭا مِّنْهُمْ لَيَكْتُمُونَ ٱلْحَقَّ وَهُمْ يَعْلَمُونَ",
    "numberInSurah": 146,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 18,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 154,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/154.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/154.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/154.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/154.mp3"
    ],
    "text": "ٱلْحَقُّ مِن رَّبِّكَ ۖ فَلَا تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ",
    "numberInSurah": 147,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 18,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 155,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/155.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/155.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/155.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/155.mp3"
    ],
    "text":
        "وَلِكُلٍّۢ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَٱسْتَبِقُوا۟ ٱلْخَيْرَٰتِ ۚ أَيْنَ مَا تَكُونُوا۟ يَأْتِ بِكُمُ ٱللَّهُ جَمِيعًا ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "numberInSurah": 148,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 19,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 156,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/156.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/156.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/156.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/156.mp3"
    ],
    "text":
        "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۖ وَإِنَّهُۥ لَلْحَقُّ مِن رَّبِّكَ ۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعْمَلُونَ",
    "numberInSurah": 149,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 19,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 157,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/157.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/157.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/157.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/157.mp3"
    ],
    "text":
        "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِى وَلِأُتِمَّ نِعْمَتِى عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
    "numberInSurah": 150,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 19,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 158,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/158.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/158.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/158.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/158.mp3"
    ],
    "text":
        "كَمَآ أَرْسَلْنَا فِيكُمْ رَسُولًۭا مِّنكُمْ يَتْلُوا۟ عَلَيْكُمْ ءَايَٰتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ ٱلْكِتَٰبَ وَٱلْحِكْمَةَ وَيُعَلِّمُكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
    "numberInSurah": 151,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 19,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 159,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/159.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/159.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/159.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/159.mp3"
    ],
    "text": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ",
    "numberInSurah": 152,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 19,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 160,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/160.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/160.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/160.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/160.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ",
    "numberInSurah": 153,
    "juz": 2,
    "manzil": 1,
    "page": 23,
    "ruku": 20,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 161,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/161.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/161.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/161.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/161.mp3"
    ],
    "text":
        "وَلَا تَقُولُوا۟ لِمَن يُقْتَلُ فِى سَبِيلِ ٱللَّهِ أَمْوَٰتٌۢ ۚ بَلْ أَحْيَآءٌۭ وَلَٰكِن لَّا تَشْعُرُونَ",
    "numberInSurah": 154,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 162,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/162.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/162.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/162.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/162.mp3"
    ],
    "text":
        "وَلَنَبْلُوَنَّكُم بِشَىْءٍۢ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍۢ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّٰبِرِينَ",
    "numberInSurah": 155,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 163,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/163.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/163.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/163.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/163.mp3"
    ],
    "text":
        "ٱلَّذِينَ إِذَآ أَصَٰبَتْهُم مُّصِيبَةٌۭ قَالُوٓا۟ إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَٰجِعُونَ",
    "numberInSurah": 156,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 164,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/164.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/164.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/164.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/164.mp3"
    ],
    "text":
        "أُو۟لَٰٓئِكَ عَلَيْهِمْ صَلَوَٰتٌۭ مِّن رَّبِّهِمْ وَرَحْمَةٌۭ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُهْتَدُونَ",
    "numberInSurah": 157,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 9,
    "sajda": false
  },
  {
    "number": 165,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/165.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/165.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/165.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/165.mp3"
    ],
    "text":
        "۞ إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ مِن شَعَآئِرِ ٱللَّهِ ۖ فَمَنْ حَجَّ ٱلْبَيْتَ أَوِ ٱعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا ۚ وَمَن تَطَوَّعَ خَيْرًۭا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ",
    "numberInSurah": 158,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 166,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/166.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/166.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/166.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/166.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ يَكْتُمُونَ مَآ أَنزَلْنَا مِنَ ٱلْبَيِّنَٰتِ وَٱلْهُدَىٰ مِنۢ بَعْدِ مَا بَيَّنَّٰهُ لِلنَّاسِ فِى ٱلْكِتَٰبِ ۙ أُو۟لَٰٓئِكَ يَلْعَنُهُمُ ٱللَّهُ وَيَلْعَنُهُمُ ٱللَّٰعِنُونَ",
    "numberInSurah": 159,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 167,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/167.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/167.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/167.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/167.mp3"
    ],
    "text":
        "إِلَّا ٱلَّذِينَ تَابُوا۟ وَأَصْلَحُوا۟ وَبَيَّنُوا۟ فَأُو۟لَٰٓئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "numberInSurah": 160,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 168,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/168.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/168.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/168.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/168.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ أُو۟لَٰٓئِكَ عَلَيْهِمْ لَعْنَةُ ٱللَّهِ وَٱلْمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
    "numberInSurah": 161,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 169,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/169.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/169.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/169.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/169.mp3"
    ],
    "text":
        "خَٰلِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
    "numberInSurah": 162,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 170,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/170.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/170.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/170.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/170.mp3"
    ],
    "text":
        "وَإِلَٰهُكُمْ إِلَٰهٌۭ وَٰحِدٌۭ ۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحْمَٰنُ ٱلرَّحِيمُ",
    "numberInSurah": 163,
    "juz": 2,
    "manzil": 1,
    "page": 24,
    "ruku": 20,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 171,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/171.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/171.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/171.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/171.mp3"
    ],
    "text":
        "إِنَّ فِى خَلْقِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَٱلْفُلْكِ ٱلَّتِى تَجْرِى فِى ٱلْبَحْرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٍۢ فَأَحْيَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍۢ وَتَصْرِيفِ ٱلرِّيَٰحِ وَٱلسَّحَابِ ٱلْمُسَخَّرِ بَيْنَ ٱلسَّمَآءِ وَٱلْأَرْضِ لَءَايَٰتٍۢ لِّقَوْمٍۢ يَعْقِلُونَ",
    "numberInSurah": 164,
    "juz": 2,
    "manzil": 1,
    "page": 25,
    "ruku": 21,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 172,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/172.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/172.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/172.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/172.mp3"
    ],
    "text":
        "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادًۭا يُحِبُّونَهُمْ كَحُبِّ ٱللَّهِ ۖ وَٱلَّذِينَ ءَامَنُوٓا۟ أَشَدُّ حُبًّۭا لِّلَّهِ ۗ وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوٓا۟ إِذْ يَرَوْنَ ٱلْعَذَابَ أَنَّ ٱلْقُوَّةَ لِلَّهِ جَمِيعًۭا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلْعَذَابِ",
    "numberInSurah": 165,
    "juz": 2,
    "manzil": 1,
    "page": 25,
    "ruku": 21,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 173,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/173.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/173.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/173.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/173.mp3"
    ],
    "text":
        "إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُوا۟ مِنَ ٱلَّذِينَ ٱتَّبَعُوا۟ وَرَأَوُا۟ ٱلْعَذَابَ وَتَقَطَّعَتْ بِهِمُ ٱلْأَسْبَابُ",
    "numberInSurah": 166,
    "juz": 2,
    "manzil": 1,
    "page": 25,
    "ruku": 21,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 174,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/174.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/174.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/174.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/174.mp3"
    ],
    "text":
        "وَقَالَ ٱلَّذِينَ ٱتَّبَعُوا۟ لَوْ أَنَّ لَنَا كَرَّةًۭ فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُوا۟ مِنَّا ۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعْمَٰلَهُمْ حَسَرَٰتٍ عَلَيْهِمْ ۖ وَمَا هُم بِخَٰرِجِينَ مِنَ ٱلنَّارِ",
    "numberInSurah": 167,
    "juz": 2,
    "manzil": 1,
    "page": 25,
    "ruku": 21,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 175,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/175.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/175.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/175.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/175.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُوا۟ مِمَّا فِى ٱلْأَرْضِ حَلَٰلًۭا طَيِّبًۭا وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَٰنِ ۚ إِنَّهُۥ لَكُمْ عَدُوٌّۭ مُّبِينٌ",
    "numberInSurah": 168,
    "juz": 2,
    "manzil": 1,
    "page": 25,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 176,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/176.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/176.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/176.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/176.mp3"
    ],
    "text":
        "إِنَّمَا يَأْمُرُكُم بِٱلسُّوٓءِ وَٱلْفَحْشَآءِ وَأَن تَقُولُوا۟ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "numberInSurah": 169,
    "juz": 2,
    "manzil": 1,
    "page": 25,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 177,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/177.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/177.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/177.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/177.mp3"
    ],
    "text":
        "وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُوا۟ مَآ أَنزَلَ ٱللَّهُ قَالُوا۟ بَلْ نَتَّبِعُ مَآ أَلْفَيْنَا عَلَيْهِ ءَابَآءَنَآ ۗ أَوَلَوْ كَانَ ءَابَآؤُهُمْ لَا يَعْقِلُونَ شَيْـًۭٔا وَلَا يَهْتَدُونَ",
    "numberInSurah": 170,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 178,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/178.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/178.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/178.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/178.mp3"
    ],
    "text":
        "وَمَثَلُ ٱلَّذِينَ كَفَرُوا۟ كَمَثَلِ ٱلَّذِى يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَآءًۭ وَنِدَآءًۭ ۚ صُمٌّۢ بُكْمٌ عُمْىٌۭ فَهُمْ لَا يَعْقِلُونَ",
    "numberInSurah": 171,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 179,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/179.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/179.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/179.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/179.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُلُوا۟ مِن طَيِّبَٰتِ مَا رَزَقْنَٰكُمْ وَٱشْكُرُوا۟ لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ",
    "numberInSurah": 172,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 180,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/180.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/180.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/180.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/180.mp3"
    ],
    "text":
        "إِنَّمَا حَرَّمَ عَلَيْكُمُ ٱلْمَيْتَةَ وَٱلدَّمَ وَلَحْمَ ٱلْخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيْرِ ٱللَّهِ ۖ فَمَنِ ٱضْطُرَّ غَيْرَ بَاغٍۢ وَلَا عَادٍۢ فَلَآ إِثْمَ عَلَيْهِ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌ",
    "numberInSurah": 173,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 181,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/181.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/181.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/181.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/181.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ يَكْتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلْكِتَٰبِ وَيَشْتَرُونَ بِهِۦ ثَمَنًۭا قَلِيلًا ۙ أُو۟لَٰٓئِكَ مَا يَأْكُلُونَ فِى بُطُونِهِمْ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوْمَ ٱلْقِيَٰمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
    "numberInSurah": 174,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 182,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/182.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/182.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/182.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/182.mp3"
    ],
    "text":
        "أُو۟لَٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلضَّلَٰلَةَ بِٱلْهُدَىٰ وَٱلْعَذَابَ بِٱلْمَغْفِرَةِ ۚ فَمَآ أَصْبَرَهُمْ عَلَى ٱلنَّارِ",
    "numberInSurah": 175,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 183,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/183.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/183.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/183.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/183.mp3"
    ],
    "text":
        "ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلْكِتَٰبَ بِٱلْحَقِّ ۗ وَإِنَّ ٱلَّذِينَ ٱخْتَلَفُوا۟ فِى ٱلْكِتَٰبِ لَفِى شِقَاقٍۭ بَعِيدٍۢ",
    "numberInSurah": 176,
    "juz": 2,
    "manzil": 1,
    "page": 26,
    "ruku": 22,
    "hizbQuarter": 10,
    "sajda": false
  },
  {
    "number": 184,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/184.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/184.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/184.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/184.mp3"
    ],
    "text":
        "۞ لَّيْسَ ٱلْبِرَّ أَن تُوَلُّوا۟ وُجُوهَكُمْ قِبَلَ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ وَلَٰكِنَّ ٱلْبِرَّ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ وَٱلْمَلَٰٓئِكَةِ وَٱلْكِتَٰبِ وَٱلنَّبِيِّۦنَ وَءَاتَى ٱلْمَالَ عَلَىٰ حُبِّهِۦ ذَوِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينَ وَٱبْنَ ٱلسَّبِيلِ وَٱلسَّآئِلِينَ وَفِى ٱلرِّقَابِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَٱلْمُوفُونَ بِعَهْدِهِمْ إِذَا عَٰهَدُوا۟ ۖ وَٱلصَّٰبِرِينَ فِى ٱلْبَأْسَآءِ وَٱلضَّرَّآءِ وَحِينَ ٱلْبَأْسِ ۗ أُو۟لَٰٓئِكَ ٱلَّذِينَ صَدَقُوا۟ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُتَّقُونَ",
    "numberInSurah": 177,
    "juz": 2,
    "manzil": 1,
    "page": 27,
    "ruku": 23,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 185,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/185.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/185.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/185.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/185.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُتِبَ عَلَيْكُمُ ٱلْقِصَاصُ فِى ٱلْقَتْلَى ۖ ٱلْحُرُّ بِٱلْحُرِّ وَٱلْعَبْدُ بِٱلْعَبْدِ وَٱلْأُنثَىٰ بِٱلْأُنثَىٰ ۚ فَمَنْ عُفِىَ لَهُۥ مِنْ أَخِيهِ شَىْءٌۭ فَٱتِّبَاعٌۢ بِٱلْمَعْرُوفِ وَأَدَآءٌ إِلَيْهِ بِإِحْسَٰنٍۢ ۗ ذَٰلِكَ تَخْفِيفٌۭ مِّن رَّبِّكُمْ وَرَحْمَةٌۭ ۗ فَمَنِ ٱعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٌۭ",
    "numberInSurah": 178,
    "juz": 2,
    "manzil": 1,
    "page": 27,
    "ruku": 23,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 186,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/186.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/186.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/186.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/186.mp3"
    ],
    "text":
        "وَلَكُمْ فِى ٱلْقِصَاصِ حَيَوٰةٌۭ يَٰٓأُو۟لِى ٱلْأَلْبَٰبِ لَعَلَّكُمْ تَتَّقُونَ",
    "numberInSurah": 179,
    "juz": 2,
    "manzil": 1,
    "page": 27,
    "ruku": 23,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 187,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/187.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/187.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/187.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/187.mp3"
    ],
    "text":
        "كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ ٱلْمَوْتُ إِن تَرَكَ خَيْرًا ٱلْوَصِيَّةُ لِلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ بِٱلْمَعْرُوفِ ۖ حَقًّا عَلَى ٱلْمُتَّقِينَ",
    "numberInSurah": 180,
    "juz": 2,
    "manzil": 1,
    "page": 27,
    "ruku": 23,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 188,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/188.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/188.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/188.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/188.mp3"
    ],
    "text":
        "فَمَنۢ بَدَّلَهُۥ بَعْدَمَا سَمِعَهُۥ فَإِنَّمَآ إِثْمُهُۥ عَلَى ٱلَّذِينَ يُبَدِّلُونَهُۥٓ ۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌۭ",
    "numberInSurah": 181,
    "juz": 2,
    "manzil": 1,
    "page": 27,
    "ruku": 23,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 189,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/189.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/189.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/189.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/189.mp3"
    ],
    "text":
        "فَمَنْ خَافَ مِن مُّوصٍۢ جَنَفًا أَوْ إِثْمًۭا فَأَصْلَحَ بَيْنَهُمْ فَلَآ إِثْمَ عَلَيْهِ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "numberInSurah": 182,
    "juz": 2,
    "manzil": 1,
    "page": 28,
    "ruku": 23,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 190,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/190.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/190.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/190.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/190.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُتِبَ عَلَيْكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
    "numberInSurah": 183,
    "juz": 2,
    "manzil": 1,
    "page": 28,
    "ruku": 24,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 191,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/191.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/191.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/191.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/191.mp3"
    ],
    "text":
        "أَيَّامًۭا مَّعْدُودَٰتٍۢ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَىٰ سَفَرٍۢ فَعِدَّةٌۭ مِّنْ أَيَّامٍ أُخَرَ ۚ وَعَلَى ٱلَّذِينَ يُطِيقُونَهُۥ فِدْيَةٌۭ طَعَامُ مِسْكِينٍۢ ۖ فَمَن تَطَوَّعَ خَيْرًۭا فَهُوَ خَيْرٌۭ لَّهُۥ ۚ وَأَن تَصُومُوا۟ خَيْرٌۭ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
    "numberInSurah": 184,
    "juz": 2,
    "manzil": 1,
    "page": 28,
    "ruku": 24,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 192,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/192.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/192.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/192.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/192.mp3"
    ],
    "text":
        "شَهْرُ رَمَضَانَ ٱلَّذِىٓ أُنزِلَ فِيهِ ٱلْقُرْءَانُ هُدًۭى لِّلنَّاسِ وَبَيِّنَٰتٍۢ مِّنَ ٱلْهُدَىٰ وَٱلْفُرْقَانِ ۚ فَمَن شَهِدَ مِنكُمُ ٱلشَّهْرَ فَلْيَصُمْهُ ۖ وَمَن كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍۢ فَعِدَّةٌۭ مِّنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ ٱللَّهُ بِكُمُ ٱلْيُسْرَ وَلَا يُرِيدُ بِكُمُ ٱلْعُسْرَ وَلِتُكْمِلُوا۟ ٱلْعِدَّةَ وَلِتُكَبِّرُوا۟ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ",
    "numberInSurah": 185,
    "juz": 2,
    "manzil": 1,
    "page": 28,
    "ruku": 24,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 193,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/193.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/193.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/193.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/193.mp3"
    ],
    "text":
        "وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ",
    "numberInSurah": 186,
    "juz": 2,
    "manzil": 1,
    "page": 28,
    "ruku": 24,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 194,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/194.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/194.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/194.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/194.mp3"
    ],
    "text":
        "أُحِلَّ لَكُمْ لَيْلَةَ ٱلصِّيَامِ ٱلرَّفَثُ إِلَىٰ نِسَآئِكُمْ ۚ هُنَّ لِبَاسٌۭ لَّكُمْ وَأَنتُمْ لِبَاسٌۭ لَّهُنَّ ۗ عَلِمَ ٱللَّهُ أَنَّكُمْ كُنتُمْ تَخْتَانُونَ أَنفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنكُمْ ۖ فَٱلْـَٰٔنَ بَٰشِرُوهُنَّ وَٱبْتَغُوا۟ مَا كَتَبَ ٱللَّهُ لَكُمْ ۚ وَكُلُوا۟ وَٱشْرَبُوا۟ حَتَّىٰ يَتَبَيَّنَ لَكُمُ ٱلْخَيْطُ ٱلْأَبْيَضُ مِنَ ٱلْخَيْطِ ٱلْأَسْوَدِ مِنَ ٱلْفَجْرِ ۖ ثُمَّ أَتِمُّوا۟ ٱلصِّيَامَ إِلَى ٱلَّيْلِ ۚ وَلَا تُبَٰشِرُوهُنَّ وَأَنتُمْ عَٰكِفُونَ فِى ٱلْمَسَٰجِدِ ۗ تِلْكَ حُدُودُ ٱللَّهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ ءَايَٰتِهِۦ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ",
    "numberInSurah": 187,
    "juz": 2,
    "manzil": 1,
    "page": 29,
    "ruku": 24,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 195,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/195.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/195.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/195.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/195.mp3"
    ],
    "text":
        "وَلَا تَأْكُلُوٓا۟ أَمْوَٰلَكُم بَيْنَكُم بِٱلْبَٰطِلِ وَتُدْلُوا۟ بِهَآ إِلَى ٱلْحُكَّامِ لِتَأْكُلُوا۟ فَرِيقًۭا مِّنْ أَمْوَٰلِ ٱلنَّاسِ بِٱلْإِثْمِ وَأَنتُمْ تَعْلَمُونَ",
    "numberInSurah": 188,
    "juz": 2,
    "manzil": 1,
    "page": 29,
    "ruku": 24,
    "hizbQuarter": 11,
    "sajda": false
  },
  {
    "number": 196,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/196.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/196.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/196.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/196.mp3"
    ],
    "text":
        "۞ يَسْـَٔلُونَكَ عَنِ ٱلْأَهِلَّةِ ۖ قُلْ هِىَ مَوَٰقِيتُ لِلنَّاسِ وَٱلْحَجِّ ۗ وَلَيْسَ ٱلْبِرُّ بِأَن تَأْتُوا۟ ٱلْبُيُوتَ مِن ظُهُورِهَا وَلَٰكِنَّ ٱلْبِرَّ مَنِ ٱتَّقَىٰ ۗ وَأْتُوا۟ ٱلْبُيُوتَ مِنْ أَبْوَٰبِهَا ۚ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
    "numberInSurah": 189,
    "juz": 2,
    "manzil": 1,
    "page": 29,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 197,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/197.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/197.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/197.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/197.mp3"
    ],
    "text":
        "وَقَٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ ٱلَّذِينَ يُقَٰتِلُونَكُمْ وَلَا تَعْتَدُوٓا۟ ۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُعْتَدِينَ",
    "numberInSurah": 190,
    "juz": 2,
    "manzil": 1,
    "page": 29,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 198,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/198.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/198.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/198.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/198.mp3"
    ],
    "text":
        "وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ ۚ وَٱلْفِتْنَةُ أَشَدُّ مِنَ ٱلْقَتْلِ ۚ وَلَا تُقَٰتِلُوهُمْ عِندَ ٱلْمَسْجِدِ ٱلْحَرَامِ حَتَّىٰ يُقَٰتِلُوكُمْ فِيهِ ۖ فَإِن قَٰتَلُوكُمْ فَٱقْتُلُوهُمْ ۗ كَذَٰلِكَ جَزَآءُ ٱلْكَٰفِرِينَ",
    "numberInSurah": 191,
    "juz": 2,
    "manzil": 1,
    "page": 30,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 199,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/199.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/199.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/199.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/199.mp3"
    ],
    "text": "فَإِنِ ٱنتَهَوْا۟ فَإِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "numberInSurah": 192,
    "juz": 2,
    "manzil": 1,
    "page": 30,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 200,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/200.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/200.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/200.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/200.mp3"
    ],
    "text":
        "وَقَٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌۭ وَيَكُونَ ٱلدِّينُ لِلَّهِ ۖ فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّٰلِمِينَ",
    "numberInSurah": 193,
    "juz": 2,
    "manzil": 1,
    "page": 30,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 201,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/201.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/201.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/201.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/201.mp3"
    ],
    "text":
        "ٱلشَّهْرُ ٱلْحَرَامُ بِٱلشَّهْرِ ٱلْحَرَامِ وَٱلْحُرُمَٰتُ قِصَاصٌۭ ۚ فَمَنِ ٱعْتَدَىٰ عَلَيْكُمْ فَٱعْتَدُوا۟ عَلَيْهِ بِمِثْلِ مَا ٱعْتَدَىٰ عَلَيْكُمْ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ مَعَ ٱلْمُتَّقِينَ",
    "numberInSurah": 194,
    "juz": 2,
    "manzil": 1,
    "page": 30,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 202,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/202.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/202.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/202.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/202.mp3"
    ],
    "text":
        "وَأَنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ ۛ وَأَحْسِنُوٓا۟ ۛ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ",
    "numberInSurah": 195,
    "juz": 2,
    "manzil": 1,
    "page": 30,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 203,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/203.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/203.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/203.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/203.mp3"
    ],
    "text":
        "وَأَتِمُّوا۟ ٱلْحَجَّ وَٱلْعُمْرَةَ لِلَّهِ ۚ فَإِنْ أُحْصِرْتُمْ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْىِ ۖ وَلَا تَحْلِقُوا۟ رُءُوسَكُمْ حَتَّىٰ يَبْلُغَ ٱلْهَدْىُ مَحِلَّهُۥ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ بِهِۦٓ أَذًۭى مِّن رَّأْسِهِۦ فَفِدْيَةٌۭ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍۢ ۚ فَإِذَآ أَمِنتُمْ فَمَن تَمَتَّعَ بِٱلْعُمْرَةِ إِلَى ٱلْحَجِّ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْىِ ۚ فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلَٰثَةِ أَيَّامٍۢ فِى ٱلْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ ۗ تِلْكَ عَشَرَةٌۭ كَامِلَةٌۭ ۗ ذَٰلِكَ لِمَن لَّمْ يَكُنْ أَهْلُهُۥ حَاضِرِى ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "numberInSurah": 196,
    "juz": 2,
    "manzil": 1,
    "page": 30,
    "ruku": 25,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 204,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/204.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/204.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/204.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/204.mp3"
    ],
    "text":
        "ٱلْحَجُّ أَشْهُرٌۭ مَّعْلُومَٰتٌۭ ۚ فَمَن فَرَضَ فِيهِنَّ ٱلْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِى ٱلْحَجِّ ۗ وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍۢ يَعْلَمْهُ ٱللَّهُ ۗ وَتَزَوَّدُوا۟ فَإِنَّ خَيْرَ ٱلزَّادِ ٱلتَّقْوَىٰ ۚ وَٱتَّقُونِ يَٰٓأُو۟لِى ٱلْأَلْبَٰبِ",
    "numberInSurah": 197,
    "juz": 2,
    "manzil": 1,
    "page": 31,
    "ruku": 26,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 205,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/205.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/205.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/205.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/205.mp3"
    ],
    "text":
        "لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُوا۟ فَضْلًۭا مِّن رَّبِّكُمْ ۚ فَإِذَآ أَفَضْتُم مِّنْ عَرَفَٰتٍۢ فَٱذْكُرُوا۟ ٱللَّهَ عِندَ ٱلْمَشْعَرِ ٱلْحَرَامِ ۖ وَٱذْكُرُوهُ كَمَا هَدَىٰكُمْ وَإِن كُنتُم مِّن قَبْلِهِۦ لَمِنَ ٱلضَّآلِّينَ",
    "numberInSurah": 198,
    "juz": 2,
    "manzil": 1,
    "page": 31,
    "ruku": 26,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 206,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/206.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/206.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/206.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/206.mp3"
    ],
    "text":
        "ثُمَّ أَفِيضُوا۟ مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ وَٱسْتَغْفِرُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "numberInSurah": 199,
    "juz": 2,
    "manzil": 1,
    "page": 31,
    "ruku": 26,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 207,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/207.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/207.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/207.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/207.mp3"
    ],
    "text":
        "فَإِذَا قَضَيْتُم مَّنَٰسِكَكُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَذِكْرِكُمْ ءَابَآءَكُمْ أَوْ أَشَدَّ ذِكْرًۭا ۗ فَمِنَ ٱلنَّاسِ مَن يَقُولُ رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا وَمَا لَهُۥ فِى ٱلْءَاخِرَةِ مِنْ خَلَٰقٍۢ",
    "numberInSurah": 200,
    "juz": 2,
    "manzil": 1,
    "page": 31,
    "ruku": 26,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 208,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/208.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/208.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/208.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/208.mp3"
    ],
    "text":
        "وَمِنْهُم مَّن يَقُولُ رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا حَسَنَةًۭ وَفِى ٱلْءَاخِرَةِ حَسَنَةًۭ وَقِنَا عَذَابَ ٱلنَّارِ",
    "numberInSurah": 201,
    "juz": 2,
    "manzil": 1,
    "page": 31,
    "ruku": 26,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 209,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/209.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/209.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/209.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/209.mp3"
    ],
    "text":
        "أُو۟لَٰٓئِكَ لَهُمْ نَصِيبٌۭ مِّمَّا كَسَبُوا۟ ۚ وَٱللَّهُ سَرِيعُ ٱلْحِسَابِ",
    "numberInSurah": 202,
    "juz": 2,
    "manzil": 1,
    "page": 31,
    "ruku": 26,
    "hizbQuarter": 12,
    "sajda": false
  },
  {
    "number": 210,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/210.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/210.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/210.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/210.mp3"
    ],
    "text":
        "۞ وَٱذْكُرُوا۟ ٱللَّهَ فِىٓ أَيَّامٍۢ مَّعْدُودَٰتٍۢ ۚ فَمَن تَعَجَّلَ فِى يَوْمَيْنِ فَلَآ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلَآ إِثْمَ عَلَيْهِ ۚ لِمَنِ ٱتَّقَىٰ ۗ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ",
    "numberInSurah": 203,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 211,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/211.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/211.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/211.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/211.mp3"
    ],
    "text":
        "وَمِنَ ٱلنَّاسِ مَن يُعْجِبُكَ قَوْلُهُۥ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَيُشْهِدُ ٱللَّهَ عَلَىٰ مَا فِى قَلْبِهِۦ وَهُوَ أَلَدُّ ٱلْخِصَامِ",
    "numberInSurah": 204,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 212,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/212.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/212.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/212.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/212.mp3"
    ],
    "text":
        "وَإِذَا تَوَلَّىٰ سَعَىٰ فِى ٱلْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ ٱلْحَرْثَ وَٱلنَّسْلَ ۗ وَٱللَّهُ لَا يُحِبُّ ٱلْفَسَادَ",
    "numberInSurah": 205,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 213,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/213.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/213.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/213.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/213.mp3"
    ],
    "text":
        "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتْهُ ٱلْعِزَّةُ بِٱلْإِثْمِ ۚ فَحَسْبُهُۥ جَهَنَّمُ ۚ وَلَبِئْسَ ٱلْمِهَادُ",
    "numberInSurah": 206,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 214,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/214.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/214.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/214.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/214.mp3"
    ],
    "text":
        "وَمِنَ ٱلنَّاسِ مَن يَشْرِى نَفْسَهُ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ ۗ وَٱللَّهُ رَءُوفٌۢ بِٱلْعِبَادِ",
    "numberInSurah": 207,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 215,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/215.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/215.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/215.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/215.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱدْخُلُوا۟ فِى ٱلسِّلْمِ كَآفَّةًۭ وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَٰنِ ۚ إِنَّهُۥ لَكُمْ عَدُوٌّۭ مُّبِينٌۭ",
    "numberInSurah": 208,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 216,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/216.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/216.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/216.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/216.mp3"
    ],
    "text":
        "فَإِن زَلَلْتُم مِّنۢ بَعْدِ مَا جَآءَتْكُمُ ٱلْبَيِّنَٰتُ فَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
    "numberInSurah": 209,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 217,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/217.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/217.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/217.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/217.mp3"
    ],
    "text":
        "هَلْ يَنظُرُونَ إِلَّآ أَن يَأْتِيَهُمُ ٱللَّهُ فِى ظُلَلٍۢ مِّنَ ٱلْغَمَامِ وَٱلْمَلَٰٓئِكَةُ وَقُضِىَ ٱلْأَمْرُ ۚ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "numberInSurah": 210,
    "juz": 2,
    "manzil": 1,
    "page": 32,
    "ruku": 26,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 218,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/218.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/218.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/218.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/218.mp3"
    ],
    "text":
        "سَلْ بَنِىٓ إِسْرَٰٓءِيلَ كَمْ ءَاتَيْنَٰهُم مِّنْ ءَايَةٍۭ بَيِّنَةٍۢ ۗ وَمَن يُبَدِّلْ نِعْمَةَ ٱللَّهِ مِنۢ بَعْدِ مَا جَآءَتْهُ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "numberInSurah": 211,
    "juz": 2,
    "manzil": 1,
    "page": 33,
    "ruku": 27,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 219,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/219.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/219.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/219.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/219.mp3"
    ],
    "text":
        "زُيِّنَ لِلَّذِينَ كَفَرُوا۟ ٱلْحَيَوٰةُ ٱلدُّنْيَا وَيَسْخَرُونَ مِنَ ٱلَّذِينَ ءَامَنُوا۟ ۘ وَٱلَّذِينَ ٱتَّقَوْا۟ فَوْقَهُمْ يَوْمَ ٱلْقِيَٰمَةِ ۗ وَٱللَّهُ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍۢ",
    "numberInSurah": 212,
    "juz": 2,
    "manzil": 1,
    "page": 33,
    "ruku": 27,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 220,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/220.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/220.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/220.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/220.mp3"
    ],
    "text":
        "كَانَ ٱلنَّاسُ أُمَّةًۭ وَٰحِدَةًۭ فَبَعَثَ ٱللَّهُ ٱلنَّبِيِّۦنَ مُبَشِّرِينَ وَمُنذِرِينَ وَأَنزَلَ مَعَهُمُ ٱلْكِتَٰبَ بِٱلْحَقِّ لِيَحْكُمَ بَيْنَ ٱلنَّاسِ فِيمَا ٱخْتَلَفُوا۟ فِيهِ ۚ وَمَا ٱخْتَلَفَ فِيهِ إِلَّا ٱلَّذِينَ أُوتُوهُ مِنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَٰتُ بَغْيًۢا بَيْنَهُمْ ۖ فَهَدَى ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ لِمَا ٱخْتَلَفُوا۟ فِيهِ مِنَ ٱلْحَقِّ بِإِذْنِهِۦ ۗ وَٱللَّهُ يَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍ",
    "numberInSurah": 213,
    "juz": 2,
    "manzil": 1,
    "page": 33,
    "ruku": 27,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 221,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/221.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/221.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/221.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/221.mp3"
    ],
    "text":
        "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا۟ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْا۟ مِن قَبْلِكُم ۖ مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُوا۟ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ مَتَىٰ نَصْرُ ٱللَّهِ ۗ أَلَآ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌۭ",
    "numberInSurah": 214,
    "juz": 2,
    "manzil": 1,
    "page": 33,
    "ruku": 27,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 222,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/222.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/222.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/222.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/222.mp3"
    ],
    "text":
        "يَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ ۖ قُلْ مَآ أَنفَقْتُم مِّنْ خَيْرٍۢ فَلِلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَٱبْنِ ٱلسَّبِيلِ ۗ وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌۭ",
    "numberInSurah": 215,
    "juz": 2,
    "manzil": 1,
    "page": 33,
    "ruku": 27,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 223,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/223.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/223.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/223.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/223.mp3"
    ],
    "text":
        "كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ وَهُوَ كُرْهٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًۭٔا وَهُوَ خَيْرٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تُحِبُّوا۟ شَيْـًۭٔا وَهُوَ شَرٌّۭ لَّكُمْ ۗ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
    "numberInSurah": 216,
    "juz": 2,
    "manzil": 1,
    "page": 34,
    "ruku": 27,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 224,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/224.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/224.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/224.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/224.mp3"
    ],
    "text":
        "يَسْـَٔلُونَكَ عَنِ ٱلشَّهْرِ ٱلْحَرَامِ قِتَالٍۢ فِيهِ ۖ قُلْ قِتَالٌۭ فِيهِ كَبِيرٌۭ ۖ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفْرٌۢ بِهِۦ وَٱلْمَسْجِدِ ٱلْحَرَامِ وَإِخْرَاجُ أَهْلِهِۦ مِنْهُ أَكْبَرُ عِندَ ٱللَّهِ ۚ وَٱلْفِتْنَةُ أَكْبَرُ مِنَ ٱلْقَتْلِ ۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمْ حَتَّىٰ يَرُدُّوكُمْ عَن دِينِكُمْ إِنِ ٱسْتَطَٰعُوا۟ ۚ وَمَن يَرْتَدِدْ مِنكُمْ عَن دِينِهِۦ فَيَمُتْ وَهُوَ كَافِرٌۭ فَأُو۟لَٰٓئِكَ حَبِطَتْ أَعْمَٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ ۖ وَأُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 217,
    "juz": 2,
    "manzil": 1,
    "page": 34,
    "ruku": 28,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 225,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/225.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/225.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/225.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/225.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَاجَرُوا۟ وَجَٰهَدُوا۟ فِى سَبِيلِ ٱللَّهِ أُو۟لَٰٓئِكَ يَرْجُونَ رَحْمَتَ ٱللَّهِ ۚ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ",
    "numberInSurah": 218,
    "juz": 2,
    "manzil": 1,
    "page": 34,
    "ruku": 28,
    "hizbQuarter": 13,
    "sajda": false
  },
  {
    "number": 226,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/226.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/226.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/226.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/226.mp3"
    ],
    "text":
        "۞ يَسْـَٔلُونَكَ عَنِ ٱلْخَمْرِ وَٱلْمَيْسِرِ ۖ قُلْ فِيهِمَآ إِثْمٌۭ كَبِيرٌۭ وَمَنَٰفِعُ لِلنَّاسِ وَإِثْمُهُمَآ أَكْبَرُ مِن نَّفْعِهِمَا ۗ وَيَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ قُلِ ٱلْعَفْوَ ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْءَايَٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
    "numberInSurah": 219,
    "juz": 2,
    "manzil": 1,
    "page": 34,
    "ruku": 28,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 227,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/227.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/227.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/227.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/227.mp3"
    ],
    "text":
        "فِى ٱلدُّنْيَا وَٱلْءَاخِرَةِ ۗ وَيَسْـَٔلُونَكَ عَنِ ٱلْيَتَٰمَىٰ ۖ قُلْ إِصْلَاحٌۭ لَّهُمْ خَيْرٌۭ ۖ وَإِن تُخَالِطُوهُمْ فَإِخْوَٰنُكُمْ ۚ وَٱللَّهُ يَعْلَمُ ٱلْمُفْسِدَ مِنَ ٱلْمُصْلِحِ ۚ وَلَوْ شَآءَ ٱللَّهُ لَأَعْنَتَكُمْ ۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌۭ",
    "numberInSurah": 220,
    "juz": 2,
    "manzil": 1,
    "page": 35,
    "ruku": 28,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 228,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/228.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/228.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/228.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/228.mp3"
    ],
    "text":
        "وَلَا تَنكِحُوا۟ ٱلْمُشْرِكَٰتِ حَتَّىٰ يُؤْمِنَّ ۚ وَلَأَمَةٌۭ مُّؤْمِنَةٌ خَيْرٌۭ مِّن مُّشْرِكَةٍۢ وَلَوْ أَعْجَبَتْكُمْ ۗ وَلَا تُنكِحُوا۟ ٱلْمُشْرِكِينَ حَتَّىٰ يُؤْمِنُوا۟ ۚ وَلَعَبْدٌۭ مُّؤْمِنٌ خَيْرٌۭ مِّن مُّشْرِكٍۢ وَلَوْ أَعْجَبَكُمْ ۗ أُو۟لَٰٓئِكَ يَدْعُونَ إِلَى ٱلنَّارِ ۖ وَٱللَّهُ يَدْعُوٓا۟ إِلَى ٱلْجَنَّةِ وَٱلْمَغْفِرَةِ بِإِذْنِهِۦ ۖ وَيُبَيِّنُ ءَايَٰتِهِۦ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ",
    "numberInSurah": 221,
    "juz": 2,
    "manzil": 1,
    "page": 35,
    "ruku": 28,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 229,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/229.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/229.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/229.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/229.mp3"
    ],
    "text":
        "وَيَسْـَٔلُونَكَ عَنِ ٱلْمَحِيضِ ۖ قُلْ هُوَ أَذًۭى فَٱعْتَزِلُوا۟ ٱلنِّسَآءَ فِى ٱلْمَحِيضِ ۖ وَلَا تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ ۖ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ ٱللَّهُ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلْمُتَطَهِّرِينَ",
    "numberInSurah": 222,
    "juz": 2,
    "manzil": 1,
    "page": 35,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 230,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/230.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/230.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/230.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/230.mp3"
    ],
    "text":
        "نِسَآؤُكُمْ حَرْثٌۭ لَّكُمْ فَأْتُوا۟ حَرْثَكُمْ أَنَّىٰ شِئْتُمْ ۖ وَقَدِّمُوا۟ لِأَنفُسِكُمْ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُم مُّلَٰقُوهُ ۗ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "numberInSurah": 223,
    "juz": 2,
    "manzil": 1,
    "page": 35,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 231,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/231.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/231.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/231.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/231.mp3"
    ],
    "text":
        "وَلَا تَجْعَلُوا۟ ٱللَّهَ عُرْضَةًۭ لِّأَيْمَٰنِكُمْ أَن تَبَرُّوا۟ وَتَتَّقُوا۟ وَتُصْلِحُوا۟ بَيْنَ ٱلنَّاسِ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌۭ",
    "numberInSurah": 224,
    "juz": 2,
    "manzil": 1,
    "page": 35,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 232,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/232.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/232.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/232.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/232.mp3"
    ],
    "text":
        "لَّا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغْوِ فِىٓ أَيْمَٰنِكُمْ وَلَٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ ۗ وَٱللَّهُ غَفُورٌ حَلِيمٌۭ",
    "numberInSurah": 225,
    "juz": 2,
    "manzil": 1,
    "page": 36,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 233,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/233.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/233.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/233.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/233.mp3"
    ],
    "text":
        "لِّلَّذِينَ يُؤْلُونَ مِن نِّسَآئِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍۢ ۖ فَإِن فَآءُو فَإِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "numberInSurah": 226,
    "juz": 2,
    "manzil": 1,
    "page": 36,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 234,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/234.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/234.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/234.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/234.mp3"
    ],
    "text": "وَإِنْ عَزَمُوا۟ ٱلطَّلَٰقَ فَإِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌۭ",
    "numberInSurah": 227,
    "juz": 2,
    "manzil": 1,
    "page": 36,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 235,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/235.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/235.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/235.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/235.mp3"
    ],
    "text":
        "وَٱلْمُطَلَّقَٰتُ يَتَرَبَّصْنَ بِأَنفُسِهِنَّ ثَلَٰثَةَ قُرُوٓءٍۢ ۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ مَا خَلَقَ ٱللَّهُ فِىٓ أَرْحَامِهِنَّ إِن كُنَّ يُؤْمِنَّ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ۚ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِى ذَٰلِكَ إِنْ أَرَادُوٓا۟ إِصْلَٰحًۭا ۚ وَلَهُنَّ مِثْلُ ٱلَّذِى عَلَيْهِنَّ بِٱلْمَعْرُوفِ ۚ وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌۭ ۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ",
    "numberInSurah": 228,
    "juz": 2,
    "manzil": 1,
    "page": 36,
    "ruku": 29,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 236,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/236.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/236.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/236.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/236.mp3"
    ],
    "text":
        "ٱلطَّلَٰقُ مَرَّتَانِ ۖ فَإِمْسَاكٌۢ بِمَعْرُوفٍ أَوْ تَسْرِيحٌۢ بِإِحْسَٰنٍۢ ۗ وَلَا يَحِلُّ لَكُمْ أَن تَأْخُذُوا۟ مِمَّآ ءَاتَيْتُمُوهُنَّ شَيْـًٔا إِلَّآ أَن يَخَافَآ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِ ۖ فَإِنْ خِفْتُمْ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِ فَلَا جُنَاحَ عَلَيْهِمَا فِيمَا ٱفْتَدَتْ بِهِۦ ۗ تِلْكَ حُدُودُ ٱللَّهِ فَلَا تَعْتَدُوهَا ۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَأُو۟لَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
    "numberInSurah": 229,
    "juz": 2,
    "manzil": 1,
    "page": 36,
    "ruku": 30,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 237,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/237.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/237.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/237.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/237.mp3"
    ],
    "text":
        "فَإِن طَلَّقَهَا فَلَا تَحِلُّ لَهُۥ مِنۢ بَعْدُ حَتَّىٰ تَنكِحَ زَوْجًا غَيْرَهُۥ ۗ فَإِن طَلَّقَهَا فَلَا جُنَاحَ عَلَيْهِمَآ أَن يَتَرَاجَعَآ إِن ظَنَّآ أَن يُقِيمَا حُدُودَ ٱللَّهِ ۗ وَتِلْكَ حُدُودُ ٱللَّهِ يُبَيِّنُهَا لِقَوْمٍۢ يَعْلَمُونَ",
    "numberInSurah": 230,
    "juz": 2,
    "manzil": 1,
    "page": 36,
    "ruku": 30,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 238,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/238.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/238.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/238.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/238.mp3"
    ],
    "text":
        "وَإِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَبَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍۢ ۚ وَلَا تُمْسِكُوهُنَّ ضِرَارًۭا لِّتَعْتَدُوا۟ ۚ وَمَن يَفْعَلْ ذَٰلِكَ فَقَدْ ظَلَمَ نَفْسَهُۥ ۚ وَلَا تَتَّخِذُوٓا۟ ءَايَٰتِ ٱللَّهِ هُزُوًۭا ۚ وَٱذْكُرُوا۟ نِعْمَتَ ٱللَّهِ عَلَيْكُمْ وَمَآ أَنزَلَ عَلَيْكُم مِّنَ ٱلْكِتَٰبِ وَٱلْحِكْمَةِ يَعِظُكُم بِهِۦ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "numberInSurah": 231,
    "juz": 2,
    "manzil": 1,
    "page": 37,
    "ruku": 30,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 239,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/239.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/239.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/239.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/239.mp3"
    ],
    "text":
        "وَإِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَن يَنكِحْنَ أَزْوَٰجَهُنَّ إِذَا تَرَٰضَوْا۟ بَيْنَهُم بِٱلْمَعْرُوفِ ۗ ذَٰلِكَ يُوعَظُ بِهِۦ مَن كَانَ مِنكُمْ يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ۗ ذَٰلِكُمْ أَزْكَىٰ لَكُمْ وَأَطْهَرُ ۗ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
    "numberInSurah": 232,
    "juz": 2,
    "manzil": 1,
    "page": 37,
    "ruku": 31,
    "hizbQuarter": 14,
    "sajda": false
  },
  {
    "number": 240,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/240.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/240.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/240.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/240.mp3"
    ],
    "text":
        "۞ وَٱلْوَٰلِدَٰتُ يُرْضِعْنَ أَوْلَٰدَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَن يُتِمَّ ٱلرَّضَاعَةَ ۚ وَعَلَى ٱلْمَوْلُودِ لَهُۥ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِٱلْمَعْرُوفِ ۚ لَا تُكَلَّفُ نَفْسٌ إِلَّا وُسْعَهَا ۚ لَا تُضَآرَّ وَٰلِدَةٌۢ بِوَلَدِهَا وَلَا مَوْلُودٌۭ لَّهُۥ بِوَلَدِهِۦ ۚ وَعَلَى ٱلْوَارِثِ مِثْلُ ذَٰلِكَ ۗ فَإِنْ أَرَادَا فِصَالًا عَن تَرَاضٍۢ مِّنْهُمَا وَتَشَاوُرٍۢ فَلَا جُنَاحَ عَلَيْهِمَا ۗ وَإِنْ أَرَدتُّمْ أَن تَسْتَرْضِعُوٓا۟ أَوْلَٰدَكُمْ فَلَا جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُم مَّآ ءَاتَيْتُم بِٱلْمَعْرُوفِ ۗ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌۭ",
    "numberInSurah": 233,
    "juz": 2,
    "manzil": 1,
    "page": 37,
    "ruku": 31,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 241,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/241.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/241.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/241.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/241.mp3"
    ],
    "text":
        "وَٱلَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَٰجًۭا يَتَرَبَّصْنَ بِأَنفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍۢ وَعَشْرًۭا ۖ فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِىٓ أَنفُسِهِنَّ بِٱلْمَعْرُوفِ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌۭ",
    "numberInSurah": 234,
    "juz": 2,
    "manzil": 1,
    "page": 38,
    "ruku": 31,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 242,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/242.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/242.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/242.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/242.mp3"
    ],
    "text":
        "وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُم بِهِۦ مِنْ خِطْبَةِ ٱلنِّسَآءِ أَوْ أَكْنَنتُمْ فِىٓ أَنفُسِكُمْ ۚ عَلِمَ ٱللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّآ أَن تَقُولُوا۟ قَوْلًۭا مَّعْرُوفًۭا ۚ وَلَا تَعْزِمُوا۟ عُقْدَةَ ٱلنِّكَاحِ حَتَّىٰ يَبْلُغَ ٱلْكِتَٰبُ أَجَلَهُۥ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ يَعْلَمُ مَا فِىٓ أَنفُسِكُمْ فَٱحْذَرُوهُ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٌۭ",
    "numberInSurah": 235,
    "juz": 2,
    "manzil": 1,
    "page": 38,
    "ruku": 31,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 243,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/243.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/243.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/243.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/243.mp3"
    ],
    "text":
        "لَّا جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ ٱلنِّسَآءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُوا۟ لَهُنَّ فَرِيضَةًۭ ۚ وَمَتِّعُوهُنَّ عَلَى ٱلْمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلْمُقْتِرِ قَدَرُهُۥ مَتَٰعًۢا بِٱلْمَعْرُوفِ ۖ حَقًّا عَلَى ٱلْمُحْسِنِينَ",
    "numberInSurah": 236,
    "juz": 2,
    "manzil": 1,
    "page": 38,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 244,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/244.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/244.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/244.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/244.mp3"
    ],
    "text":
        "وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةًۭ فَنِصْفُ مَا فَرَضْتُمْ إِلَّآ أَن يَعْفُونَ أَوْ يَعْفُوَا۟ ٱلَّذِى بِيَدِهِۦ عُقْدَةُ ٱلنِّكَاحِ ۚ وَأَن تَعْفُوٓا۟ أَقْرَبُ لِلتَّقْوَىٰ ۚ وَلَا تَنسَوُا۟ ٱلْفَضْلَ بَيْنَكُمْ ۚ إِنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "numberInSurah": 237,
    "juz": 2,
    "manzil": 1,
    "page": 38,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 245,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/245.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/245.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/245.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/245.mp3"
    ],
    "text":
        "حَٰفِظُوا۟ عَلَى ٱلصَّلَوَٰتِ وَٱلصَّلَوٰةِ ٱلْوُسْطَىٰ وَقُومُوا۟ لِلَّهِ قَٰنِتِينَ",
    "numberInSurah": 238,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 246,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/246.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/246.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/246.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/246.mp3"
    ],
    "text":
        "فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًۭا ۖ فَإِذَآ أَمِنتُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَمَا عَلَّمَكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
    "numberInSurah": 239,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 247,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/247.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/247.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/247.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/247.mp3"
    ],
    "text":
        "وَٱلَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَٰجًۭا وَصِيَّةًۭ لِّأَزْوَٰجِهِم مَّتَٰعًا إِلَى ٱلْحَوْلِ غَيْرَ إِخْرَاجٍۢ ۚ فَإِنْ خَرَجْنَ فَلَا جُنَاحَ عَلَيْكُمْ فِى مَا فَعَلْنَ فِىٓ أَنفُسِهِنَّ مِن مَّعْرُوفٍۢ ۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌۭ",
    "numberInSurah": 240,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 248,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/248.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/248.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/248.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/248.mp3"
    ],
    "text":
        "وَلِلْمُطَلَّقَٰتِ مَتَٰعٌۢ بِٱلْمَعْرُوفِ ۖ حَقًّا عَلَى ٱلْمُتَّقِينَ",
    "numberInSurah": 241,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 249,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/249.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/249.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/249.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/249.mp3"
    ],
    "text":
        "كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَٰتِهِۦ لَعَلَّكُمْ تَعْقِلُونَ",
    "numberInSurah": 242,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 32,
    "hizbQuarter": 15,
    "sajda": false
  },
  {
    "number": 250,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/250.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/250.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/250.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/250.mp3"
    ],
    "text":
        "۞ أَلَمْ تَرَ إِلَى ٱلَّذِينَ خَرَجُوا۟ مِن دِيَٰرِهِمْ وَهُمْ أُلُوفٌ حَذَرَ ٱلْمَوْتِ فَقَالَ لَهُمُ ٱللَّهُ مُوتُوا۟ ثُمَّ أَحْيَٰهُمْ ۚ إِنَّ ٱللَّهَ لَذُو فَضْلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَشْكُرُونَ",
    "numberInSurah": 243,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 33,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 251,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/251.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/251.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/251.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/251.mp3"
    ],
    "text":
        "وَقَٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌۭ",
    "numberInSurah": 244,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 33,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 252,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/252.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/252.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/252.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/252.mp3"
    ],
    "text":
        "مَّن ذَا ٱلَّذِى يُقْرِضُ ٱللَّهَ قَرْضًا حَسَنًۭا فَيُضَٰعِفَهُۥ لَهُۥٓ أَضْعَافًۭا كَثِيرَةًۭ ۚ وَٱللَّهُ يَقْبِضُ وَيَبْصُۜطُ وَإِلَيْهِ تُرْجَعُونَ",
    "numberInSurah": 245,
    "juz": 2,
    "manzil": 1,
    "page": 39,
    "ruku": 33,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 253,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/253.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/253.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/253.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/253.mp3"
    ],
    "text":
        "أَلَمْ تَرَ إِلَى ٱلْمَلَإِ مِنۢ بَنِىٓ إِسْرَٰٓءِيلَ مِنۢ بَعْدِ مُوسَىٰٓ إِذْ قَالُوا۟ لِنَبِىٍّۢ لَّهُمُ ٱبْعَثْ لَنَا مَلِكًۭا نُّقَٰتِلْ فِى سَبِيلِ ٱللَّهِ ۖ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ أَلَّا تُقَٰتِلُوا۟ ۖ قَالُوا۟ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِى سَبِيلِ ٱللَّهِ وَقَدْ أُخْرِجْنَا مِن دِيَٰرِنَا وَأَبْنَآئِنَا ۖ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ تَوَلَّوْا۟ إِلَّا قَلِيلًۭا مِّنْهُمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّٰلِمِينَ",
    "numberInSurah": 246,
    "juz": 2,
    "manzil": 1,
    "page": 40,
    "ruku": 33,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 254,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/254.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/254.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/254.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/254.mp3"
    ],
    "text":
        "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ ٱللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًۭا ۚ قَالُوٓا۟ أَنَّىٰ يَكُونُ لَهُ ٱلْمُلْكُ عَلَيْنَا وَنَحْنُ أَحَقُّ بِٱلْمُلْكِ مِنْهُ وَلَمْ يُؤْتَ سَعَةًۭ مِّنَ ٱلْمَالِ ۚ قَالَ إِنَّ ٱللَّهَ ٱصْطَفَىٰهُ عَلَيْكُمْ وَزَادَهُۥ بَسْطَةًۭ فِى ٱلْعِلْمِ وَٱلْجِسْمِ ۖ وَٱللَّهُ يُؤْتِى مُلْكَهُۥ مَن يَشَآءُ ۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌۭ",
    "numberInSurah": 247,
    "juz": 2,
    "manzil": 1,
    "page": 40,
    "ruku": 33,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 255,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/255.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/255.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/255.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/255.mp3"
    ],
    "text":
        "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ ءَايَةَ مُلْكِهِۦٓ أَن يَأْتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٌۭ مِّن رَّبِّكُمْ وَبَقِيَّةٌۭ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحْمِلُهُ ٱلْمَلَٰٓئِكَةُ ۚ إِنَّ فِى ذَٰلِكَ لَءَايَةًۭ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ",
    "numberInSurah": 248,
    "juz": 2,
    "manzil": 1,
    "page": 40,
    "ruku": 33,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 256,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/256.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/256.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/256.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/256.mp3"
    ],
    "text":
        "فَلَمَّا فَصَلَ طَالُوتُ بِٱلْجُنُودِ قَالَ إِنَّ ٱللَّهَ مُبْتَلِيكُم بِنَهَرٍۢ فَمَن شَرِبَ مِنْهُ فَلَيْسَ مِنِّى وَمَن لَّمْ يَطْعَمْهُ فَإِنَّهُۥ مِنِّىٓ إِلَّا مَنِ ٱغْتَرَفَ غُرْفَةًۢ بِيَدِهِۦ ۚ فَشَرِبُوا۟ مِنْهُ إِلَّا قَلِيلًۭا مِّنْهُمْ ۚ فَلَمَّا جَاوَزَهُۥ هُوَ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ قَالُوا۟ لَا طَاقَةَ لَنَا ٱلْيَوْمَ بِجَالُوتَ وَجُنُودِهِۦ ۚ قَالَ ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُوا۟ ٱللَّهِ كَم مِّن فِئَةٍۢ قَلِيلَةٍ غَلَبَتْ فِئَةًۭ كَثِيرَةًۢ بِإِذْنِ ٱللَّهِ ۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ",
    "numberInSurah": 249,
    "juz": 2,
    "manzil": 1,
    "page": 41,
    "ruku": 34,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 257,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/257.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/257.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/257.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/257.mp3"
    ],
    "text":
        "وَلَمَّا بَرَزُوا۟ لِجَالُوتَ وَجُنُودِهِۦ قَالُوا۟ رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًۭا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
    "numberInSurah": 250,
    "juz": 2,
    "manzil": 1,
    "page": 41,
    "ruku": 34,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 258,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/258.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/258.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/258.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/258.mp3"
    ],
    "text":
        "فَهَزَمُوهُم بِإِذْنِ ٱللَّهِ وَقَتَلَ دَاوُۥدُ جَالُوتَ وَءَاتَىٰهُ ٱللَّهُ ٱلْمُلْكَ وَٱلْحِكْمَةَ وَعَلَّمَهُۥ مِمَّا يَشَآءُ ۗ وَلَوْلَا دَفْعُ ٱللَّهِ ٱلنَّاسَ بَعْضَهُم بِبَعْضٍۢ لَّفَسَدَتِ ٱلْأَرْضُ وَلَٰكِنَّ ٱللَّهَ ذُو فَضْلٍ عَلَى ٱلْعَٰلَمِينَ",
    "numberInSurah": 251,
    "juz": 2,
    "manzil": 1,
    "page": 41,
    "ruku": 34,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 259,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/259.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/259.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/259.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/259.mp3"
    ],
    "text":
        "تِلْكَ ءَايَٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ ۚ وَإِنَّكَ لَمِنَ ٱلْمُرْسَلِينَ",
    "numberInSurah": 252,
    "juz": 2,
    "manzil": 1,
    "page": 41,
    "ruku": 34,
    "hizbQuarter": 16,
    "sajda": false
  },
  {
    "number": 260,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/260.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/260.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/260.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/260.mp3"
    ],
    "text":
        "۞ تِلْكَ ٱلرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍۢ ۘ مِّنْهُم مَّن كَلَّمَ ٱللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَٰتٍۢ ۚ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ ٱلْقُدُسِ ۗ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلَ ٱلَّذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَٰتُ وَلَٰكِنِ ٱخْتَلَفُوا۟ فَمِنْهُم مَّنْ ءَامَنَ وَمِنْهُم مَّن كَفَرَ ۚ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلُوا۟ وَلَٰكِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ",
    "numberInSurah": 253,
    "juz": 3,
    "manzil": 1,
    "page": 42,
    "ruku": 34,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 261,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/261.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/261.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/261.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/261.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِمَّا رَزَقْنَٰكُم مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌۭ لَّا بَيْعٌۭ فِيهِ وَلَا خُلَّةٌۭ وَلَا شَفَٰعَةٌۭ ۗ وَٱلْكَٰفِرُونَ هُمُ ٱلظَّٰلِمُونَ",
    "numberInSurah": 254,
    "juz": 3,
    "manzil": 1,
    "page": 42,
    "ruku": 35,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 262,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/262.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/262.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/262.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/262.mp3"
    ],
    "text":
        "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌۭ وَلَا نَوْمٌۭ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍۢ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
    "numberInSurah": 255,
    "juz": 3,
    "manzil": 1,
    "page": 42,
    "ruku": 35,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 263,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/263.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/263.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/263.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/263.mp3"
    ],
    "text":
        "لَآ إِكْرَاهَ فِى ٱلدِّينِ ۖ قَد تَّبَيَّنَ ٱلرُّشْدُ مِنَ ٱلْغَىِّ ۚ فَمَن يَكْفُرْ بِٱلطَّٰغُوتِ وَيُؤْمِنۢ بِٱللَّهِ فَقَدِ ٱسْتَمْسَكَ بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ لَا ٱنفِصَامَ لَهَا ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "numberInSurah": 256,
    "juz": 3,
    "manzil": 1,
    "page": 42,
    "ruku": 35,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 264,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/264.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/264.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/264.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/264.mp3"
    ],
    "text":
        "ٱللَّهُ وَلِىُّ ٱلَّذِينَ ءَامَنُوا۟ يُخْرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ ۖ وَٱلَّذِينَ كَفَرُوٓا۟ أَوْلِيَآؤُهُمُ ٱلطَّٰغُوتُ يُخْرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِ ۗ أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 257,
    "juz": 3,
    "manzil": 1,
    "page": 43,
    "ruku": 35,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 265,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/265.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/265.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/265.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/265.mp3"
    ],
    "text":
        "أَلَمْ تَرَ إِلَى ٱلَّذِى حَآجَّ إِبْرَٰهِۦمَ فِى رَبِّهِۦٓ أَنْ ءَاتَىٰهُ ٱللَّهُ ٱلْمُلْكَ إِذْ قَالَ إِبْرَٰهِۦمُ رَبِّىَ ٱلَّذِى يُحْىِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحْىِۦ وَأُمِيتُ ۖ قَالَ إِبْرَٰهِۦمُ فَإِنَّ ٱللَّهَ يَأْتِى بِٱلشَّمْسِ مِنَ ٱلْمَشْرِقِ فَأْتِ بِهَا مِنَ ٱلْمَغْرِبِ فَبُهِتَ ٱلَّذِى كَفَرَ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّٰلِمِينَ",
    "numberInSurah": 258,
    "juz": 3,
    "manzil": 1,
    "page": 43,
    "ruku": 36,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 266,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/266.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/266.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/266.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/266.mp3"
    ],
    "text":
        "أَوْ كَٱلَّذِى مَرَّ عَلَىٰ قَرْيَةٍۢ وَهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحْىِۦ هَٰذِهِ ٱللَّهُ بَعْدَ مَوْتِهَا ۖ فَأَمَاتَهُ ٱللَّهُ مِا۟ئَةَ عَامٍۢ ثُمَّ بَعَثَهُۥ ۖ قَالَ كَمْ لَبِثْتَ ۖ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍۢ ۖ قَالَ بَل لَّبِثْتَ مِا۟ئَةَ عَامٍۢ فَٱنظُرْ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ ۖ وَٱنظُرْ إِلَىٰ حِمَارِكَ وَلِنَجْعَلَكَ ءَايَةًۭ لِّلنَّاسِ ۖ وَٱنظُرْ إِلَى ٱلْعِظَامِ كَيْفَ نُنشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًۭا ۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعْلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "numberInSurah": 259,
    "juz": 3,
    "manzil": 1,
    "page": 43,
    "ruku": 36,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 267,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/267.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/267.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/267.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/267.mp3"
    ],
    "text":
        "وَإِذْ قَالَ إِبْرَٰهِۦمُ رَبِّ أَرِنِى كَيْفَ تُحْىِ ٱلْمَوْتَىٰ ۖ قَالَ أَوَلَمْ تُؤْمِن ۖ قَالَ بَلَىٰ وَلَٰكِن لِّيَطْمَئِنَّ قَلْبِى ۖ قَالَ فَخُذْ أَرْبَعَةًۭ مِّنَ ٱلطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ ٱجْعَلْ عَلَىٰ كُلِّ جَبَلٍۢ مِّنْهُنَّ جُزْءًۭا ثُمَّ ٱدْعُهُنَّ يَأْتِينَكَ سَعْيًۭا ۚ وَٱعْلَمْ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌۭ",
    "numberInSurah": 260,
    "juz": 3,
    "manzil": 1,
    "page": 44,
    "ruku": 36,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 268,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/268.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/268.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/268.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/268.mp3"
    ],
    "text":
        "مَّثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ كَمَثَلِ حَبَّةٍ أَنۢبَتَتْ سَبْعَ سَنَابِلَ فِى كُلِّ سُنۢبُلَةٍۢ مِّا۟ئَةُ حَبَّةٍۢ ۗ وَٱللَّهُ يُضَٰعِفُ لِمَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
    "numberInSurah": 261,
    "juz": 3,
    "manzil": 1,
    "page": 44,
    "ruku": 37,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 269,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/269.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/269.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/269.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/269.mp3"
    ],
    "text":
        "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّۭا وَلَآ أَذًۭى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "numberInSurah": 262,
    "juz": 3,
    "manzil": 1,
    "page": 44,
    "ruku": 37,
    "hizbQuarter": 17,
    "sajda": false
  },
  {
    "number": 270,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/270.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/270.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/270.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/270.mp3"
    ],
    "text":
        "۞ قَوْلٌۭ مَّعْرُوفٌۭ وَمَغْفِرَةٌ خَيْرٌۭ مِّن صَدَقَةٍۢ يَتْبَعُهَآ أَذًۭى ۗ وَٱللَّهُ غَنِىٌّ حَلِيمٌۭ",
    "numberInSurah": 263,
    "juz": 3,
    "manzil": 1,
    "page": 44,
    "ruku": 37,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 271,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/271.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/271.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/271.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/271.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تُبْطِلُوا۟ صَدَقَٰتِكُم بِٱلْمَنِّ وَٱلْأَذَىٰ كَٱلَّذِى يُنفِقُ مَالَهُۥ رِئَآءَ ٱلنَّاسِ وَلَا يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْءَاخِرِ ۖ فَمَثَلُهُۥ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌۭ فَأَصَابَهُۥ وَابِلٌۭ فَتَرَكَهُۥ صَلْدًۭا ۖ لَّا يَقْدِرُونَ عَلَىٰ شَىْءٍۢ مِّمَّا كَسَبُوا۟ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْكَٰفِرِينَ",
    "numberInSurah": 264,
    "juz": 3,
    "manzil": 1,
    "page": 44,
    "ruku": 37,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 272,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/272.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/272.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/272.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/272.mp3"
    ],
    "text":
        "وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمُ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ وَتَثْبِيتًۭا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍۭ بِرَبْوَةٍ أَصَابَهَا وَابِلٌۭ فَـَٔاتَتْ أُكُلَهَا ضِعْفَيْنِ فَإِن لَّمْ يُصِبْهَا وَابِلٌۭ فَطَلٌّۭ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "numberInSurah": 265,
    "juz": 3,
    "manzil": 1,
    "page": 45,
    "ruku": 37,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 273,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/273.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/273.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/273.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/273.mp3"
    ],
    "text":
        "أَيَوَدُّ أَحَدُكُمْ أَن تَكُونَ لَهُۥ جَنَّةٌۭ مِّن نَّخِيلٍۢ وَأَعْنَابٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ لَهُۥ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَأَصَابَهُ ٱلْكِبَرُ وَلَهُۥ ذُرِّيَّةٌۭ ضُعَفَآءُ فَأَصَابَهَآ إِعْصَارٌۭ فِيهِ نَارٌۭ فَٱحْتَرَقَتْ ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْءَايَٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
    "numberInSurah": 266,
    "juz": 3,
    "manzil": 1,
    "page": 45,
    "ruku": 37,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 274,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/274.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/274.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/274.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/274.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِن طَيِّبَٰتِ مَا كَسَبْتُمْ وَمِمَّآ أَخْرَجْنَا لَكُم مِّنَ ٱلْأَرْضِ ۖ وَلَا تَيَمَّمُوا۟ ٱلْخَبِيثَ مِنْهُ تُنفِقُونَ وَلَسْتُم بِـَٔاخِذِيهِ إِلَّآ أَن تُغْمِضُوا۟ فِيهِ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَنِىٌّ حَمِيدٌ",
    "numberInSurah": 267,
    "juz": 3,
    "manzil": 1,
    "page": 45,
    "ruku": 38,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 275,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/275.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/275.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/275.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/275.mp3"
    ],
    "text":
        "ٱلشَّيْطَٰنُ يَعِدُكُمُ ٱلْفَقْرَ وَيَأْمُرُكُم بِٱلْفَحْشَآءِ ۖ وَٱللَّهُ يَعِدُكُم مَّغْفِرَةًۭ مِّنْهُ وَفَضْلًۭا ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌۭ",
    "numberInSurah": 268,
    "juz": 3,
    "manzil": 1,
    "page": 45,
    "ruku": 38,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 276,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/276.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/276.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/276.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/276.mp3"
    ],
    "text":
        "يُؤْتِى ٱلْحِكْمَةَ مَن يَشَآءُ ۚ وَمَن يُؤْتَ ٱلْحِكْمَةَ فَقَدْ أُوتِىَ خَيْرًۭا كَثِيرًۭا ۗ وَمَا يَذَّكَّرُ إِلَّآ أُو۟لُوا۟ ٱلْأَلْبَٰبِ",
    "numberInSurah": 269,
    "juz": 3,
    "manzil": 1,
    "page": 45,
    "ruku": 38,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 277,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/277.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/277.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/277.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/277.mp3"
    ],
    "text":
        "وَمَآ أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍۢ فَإِنَّ ٱللَّهَ يَعْلَمُهُۥ ۗ وَمَا لِلظَّٰلِمِينَ مِنْ أَنصَارٍ",
    "numberInSurah": 270,
    "juz": 3,
    "manzil": 1,
    "page": 46,
    "ruku": 38,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 278,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/278.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/278.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/278.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/278.mp3"
    ],
    "text":
        "إِن تُبْدُوا۟ ٱلصَّدَقَٰتِ فَنِعِمَّا هِىَ ۖ وَإِن تُخْفُوهَا وَتُؤْتُوهَا ٱلْفُقَرَآءَ فَهُوَ خَيْرٌۭ لَّكُمْ ۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمْ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌۭ",
    "numberInSurah": 271,
    "juz": 3,
    "manzil": 1,
    "page": 46,
    "ruku": 38,
    "hizbQuarter": 18,
    "sajda": false
  },
  {
    "number": 279,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/279.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/279.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/279.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/279.mp3"
    ],
    "text":
        "۞ لَّيْسَ عَلَيْكَ هُدَىٰهُمْ وَلَٰكِنَّ ٱللَّهَ يَهْدِى مَن يَشَآءُ ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ فَلِأَنفُسِكُمْ ۚ وَمَا تُنفِقُونَ إِلَّا ٱبْتِغَآءَ وَجْهِ ٱللَّهِ ۚ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لَا تُظْلَمُونَ",
    "numberInSurah": 272,
    "juz": 3,
    "manzil": 1,
    "page": 46,
    "ruku": 38,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 280,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/280.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/280.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/280.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/280.mp3"
    ],
    "text":
        "لِلْفُقَرَآءِ ٱلَّذِينَ أُحْصِرُوا۟ فِى سَبِيلِ ٱللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًۭا فِى ٱلْأَرْضِ يَحْسَبُهُمُ ٱلْجَاهِلُ أَغْنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعْرِفُهُم بِسِيمَٰهُمْ لَا يَسْـَٔلُونَ ٱلنَّاسَ إِلْحَافًۭا ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
    "numberInSurah": 273,
    "juz": 3,
    "manzil": 1,
    "page": 46,
    "ruku": 38,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 281,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/281.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/281.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/281.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/281.mp3"
    ],
    "text":
        "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّۭا وَعَلَانِيَةًۭ فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "numberInSurah": 274,
    "juz": 3,
    "manzil": 1,
    "page": 46,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 282,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/282.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/282.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/282.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/282.mp3"
    ],
    "text":
        "ٱلَّذِينَ يَأْكُلُونَ ٱلرِّبَوٰا۟ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِى يَتَخَبَّطُهُ ٱلشَّيْطَٰنُ مِنَ ٱلْمَسِّ ۚ ذَٰلِكَ بِأَنَّهُمْ قَالُوٓا۟ إِنَّمَا ٱلْبَيْعُ مِثْلُ ٱلرِّبَوٰا۟ ۗ وَأَحَلَّ ٱللَّهُ ٱلْبَيْعَ وَحَرَّمَ ٱلرِّبَوٰا۟ ۚ فَمَن جَآءَهُۥ مَوْعِظَةٌۭ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمْرُهُۥٓ إِلَى ٱللَّهِ ۖ وَمَنْ عَادَ فَأُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَٰلِدُونَ",
    "numberInSurah": 275,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 283,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/283.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/283.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/283.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/283.mp3"
    ],
    "text":
        "يَمْحَقُ ٱللَّهُ ٱلرِّبَوٰا۟ وَيُرْبِى ٱلصَّدَقَٰتِ ۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ",
    "numberInSurah": 276,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 284,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/284.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/284.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/284.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/284.mp3"
    ],
    "text":
        "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "numberInSurah": 277,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 285,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/285.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/285.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/285.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/285.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَذَرُوا۟ مَا بَقِىَ مِنَ ٱلرِّبَوٰٓا۟ إِن كُنتُم مُّؤْمِنِينَ",
    "numberInSurah": 278,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 286,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/286.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/286.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/286.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/286.mp3"
    ],
    "text":
        "فَإِن لَّمْ تَفْعَلُوا۟ فَأْذَنُوا۟ بِحَرْبٍۢ مِّنَ ٱللَّهِ وَرَسُولِهِۦ ۖ وَإِن تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَٰلِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ",
    "numberInSurah": 279,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 287,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/287.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/287.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/287.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/287.mp3"
    ],
    "text":
        "وَإِن كَانَ ذُو عُسْرَةٍۢ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍۢ ۚ وَأَن تَصَدَّقُوا۟ خَيْرٌۭ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
    "numberInSurah": 280,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 288,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/288.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/288.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/288.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/288.mp3"
    ],
    "text":
        "وَٱتَّقُوا۟ يَوْمًۭا تُرْجَعُونَ فِيهِ إِلَى ٱللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍۢ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
    "numberInSurah": 281,
    "juz": 3,
    "manzil": 1,
    "page": 47,
    "ruku": 39,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 289,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/289.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/289.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/289.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/289.mp3"
    ],
    "text":
        "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰٓ أَجَلٍۢ مُّسَمًّۭى فَٱكْتُبُوهُ ۚ وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌۢ بِٱلْعَدْلِ ۚ وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ ٱللَّهُ ۚ فَلْيَكْتُبْ وَلْيُمْلِلِ ٱلَّذِى عَلَيْهِ ٱلْحَقُّ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ وَلَا يَبْخَسْ مِنْهُ شَيْـًۭٔا ۚ فَإِن كَانَ ٱلَّذِى عَلَيْهِ ٱلْحَقُّ سَفِيهًا أَوْ ضَعِيفًا أَوْ لَا يَسْتَطِيعُ أَن يُمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهُۥ بِٱلْعَدْلِ ۚ وَٱسْتَشْهِدُوا۟ شَهِيدَيْنِ مِن رِّجَالِكُمْ ۖ فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌۭ وَٱمْرَأَتَانِ مِمَّن تَرْضَوْنَ مِنَ ٱلشُّهَدَآءِ أَن تَضِلَّ إِحْدَىٰهُمَا فَتُذَكِّرَ إِحْدَىٰهُمَا ٱلْأُخْرَىٰ ۚ وَلَا يَأْبَ ٱلشُّهَدَآءُ إِذَا مَا دُعُوا۟ ۚ وَلَا تَسْـَٔمُوٓا۟ أَن تَكْتُبُوهُ صَغِيرًا أَوْ كَبِيرًا إِلَىٰٓ أَجَلِهِۦ ۚ ذَٰلِكُمْ أَقْسَطُ عِندَ ٱللَّهِ وَأَقْوَمُ لِلشَّهَٰدَةِ وَأَدْنَىٰٓ أَلَّا تَرْتَابُوٓا۟ ۖ إِلَّآ أَن تَكُونَ تِجَٰرَةً حَاضِرَةًۭ تُدِيرُونَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَلَّا تَكْتُبُوهَا ۗ وَأَشْهِدُوٓا۟ إِذَا تَبَايَعْتُمْ ۚ وَلَا يُضَآرَّ كَاتِبٌۭ وَلَا شَهِيدٌۭ ۚ وَإِن تَفْعَلُوا۟ فَإِنَّهُۥ فُسُوقٌۢ بِكُمْ ۗ وَٱتَّقُوا۟ ٱللَّهَ ۖ وَيُعَلِّمُكُمُ ٱللَّهُ ۗ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "numberInSurah": 282,
    "juz": 3,
    "manzil": 1,
    "page": 48,
    "ruku": 40,
    "hizbQuarter": 19,
    "sajda": false
  },
  {
    "number": 290,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/290.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/290.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/290.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/290.mp3"
    ],
    "text":
        "۞ وَإِن كُنتُمْ عَلَىٰ سَفَرٍۢ وَلَمْ تَجِدُوا۟ كَاتِبًۭا فَرِهَٰنٌۭ مَّقْبُوضَةٌۭ ۖ فَإِنْ أَمِنَ بَعْضُكُم بَعْضًۭا فَلْيُؤَدِّ ٱلَّذِى ٱؤْتُمِنَ أَمَٰنَتَهُۥ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ ۗ وَلَا تَكْتُمُوا۟ ٱلشَّهَٰدَةَ ۚ وَمَن يَكْتُمْهَا فَإِنَّهُۥٓ ءَاثِمٌۭ قَلْبُهُۥ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌۭ",
    "numberInSurah": 283,
    "juz": 3,
    "manzil": 1,
    "page": 49,
    "ruku": 40,
    "hizbQuarter": 20,
    "sajda": false
  },
  {
    "number": 291,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/291.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/291.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/291.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/291.mp3"
    ],
    "text":
        "لِّلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ وَإِن تُبْدُوا۟ مَا فِىٓ أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ ٱللَّهُ ۖ فَيَغْفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ ۗ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
    "numberInSurah": 284,
    "juz": 3,
    "manzil": 1,
    "page": 49,
    "ruku": 41,
    "hizbQuarter": 20,
    "sajda": false
  },
  {
    "number": 292,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/292.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/292.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/292.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/292.mp3"
    ],
    "text":
        "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ",
    "numberInSurah": 285,
    "juz": 3,
    "manzil": 1,
    "page": 49,
    "ruku": 41,
    "hizbQuarter": 20,
    "sajda": false
  },
  {
    "number": 293,
    "audio": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/293.mp3",
    "audioSecondary": [
      "https://cdn2.islamic.network/quran/audio/128/ar.alafasy/293.mp3",
      "https://cdn.islamic.network/quran/audio/64/ar.alafasy/293.mp3",
      "https://cdn2.islamic.network/quran/audio/64/ar.alafasy/293.mp3"
    ],
    "text":
        "لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًۭا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
    "numberInSurah": 286,
    "juz": 3,
    "manzil": 1,
    "page": 49,
    "ruku": 41,
    "hizbQuarter": 20,
    "sajda": false
  }
];

String aboutSurah = """
Бақара “сигир” маъносини билдиради. Қадимда бани исроиллик бир киши ўлдирилганида, унинг қотилини топа олишмайди. Шунда Аллоҳ таоло Мусо алайҳиссаломга: “Қавмингга айт, сигир сўйиб, унинг бир бўлаги билан ўликни урсинлар”, деб буюради. Аллоҳнинг буйруғи бажарилганидан сўнг ҳалиги ўликка жон кириб, қотили кимлигини айтиб беради. Сигир билан боғлиқ воқеа келтирилгани учун бу сура Бақара деб номланган.

Бақара сураси Мадинада нозил қилинган, 286 оятдан иборат. Бақара Қуръони каримдаги энг узун сурадир. Унда эътиқод, ибодат, муомала, ахлоқ, никоҳ, талоқ, идда масалалари билан бир қаторда Мусо алайҳиссалом қиссаси, Фиръавн билан Бани Исроил ўртасидаги можаролар баён этилган. Набий соллаллоҳу алайҳи ва саллам айтадилар: “Менга Таврот ўрнига еттилик, Забур ўрнига юзлик, Инжил ўрнига масоний берилди. Мен Муфассал билан афзал қилиндим”.

Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади. Расулуллоҳ соллаллоҳу алайҳи ва саллам: “Уйларингизни қабристонга айлантириб қўйманглар! Бақара (сураси) ўқиладиган уйдан шайтон қочади”,деганлар.

Али розияллоҳу анҳудан ривоят қилинади. Расулуллоҳ соллаллоҳу алайҳи васаллам: “Ким ҳар фарз намоздан кейин Оятул Курсийни ўқиса, унинг жаннатга киришини фақат ўлим тўсиб туради, холос”, дедилар.

Расулуллоҳ соллаллоҳу алайҳи васаллам: «Инсонларнинг саййиди Одам, Арабларнинг саййиди Муҳаммад. Лекин (менда) фахрланиш йўқ, Форсларнинг саййиди Салмон, Румликларнинг саййиди Суҳайб, Қоратанлиларнинг саййиди Билол, Тоғларнинг саййиди Тур тоғи, кунларнинг саййиди Жума куни, каломларнинг саййиди Қуръон, Қуръоннинг саййиди Бақара (сурасидир), Бақаранинг саййиди Оятул Курсийдир дедилар. Ва яна «Бу оят унда ўқилган хонадонга ўттиз кун шайтон кирмайди ва сеҳргар еркак ва аёл қирқ кеча кирмайди» дедилар.

Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ҳар бир нарсанинг ўркачи (улуғи, саййиди, афзали) бўлади. Албатта Қуръооннинг ўркачи Бақара (сураси)дир. Ва унда бир оят бор бўлиб, у Қуръоннинг саййидасидир. Ва у Оятул Курсийдир»,дедилар.

Убай ибн Каъб розияллоҳу анҳудан ривоят қилинади. Набий соллаллоҳу алайҳи васаллам: “Эй Абу Мунзир, Аллоҳнинг китобидаги энг улуғ оят қайси эканини биласанми?” дедилар.

“Аллоҳ ва Унинг Расули билувчироқдир”, дедим.

“Эй Абу Мунзир, Аллоҳнинг китобидаги энг улуғ оят қайси эканини биласанми?”дедилар.

“Аллоҳу лаа илаҳа иллаа ҳуу ал-Ҳайюл Қой-йум”, дедим.

Шунда у зот: “Аллоҳга қасамки, сенга илм муборак бўлсин, эй Абу Мунзир”, дедилар (Имом Муслим, Имом Абу Довуд ривояти).

Расулуллоҳ соллаллоҳу алайҳи васаллам: “Бақара сурасининг охирги икки оятини ўқи, улар менга Аршнинг остидаги хазинадан берилган”, деганлар (Имом Аҳмад ривояти).

""";

List textSizeArabic = [
  ["الٓمٓ", 18.0],
  ["الٓمٓ", 20.0],
  ["الٓمٓ", 24.0],
  ["الٓمٓ", 26.0],
  ["الٓمٓ", 28.0],
  ["الٓمٓ", 30.0],
  ["الٓمٓ", 34.0],
  ["الٓمٓ", 38.0],
  ["الٓمٓ", 42.0],
  ["الٓمٓ", 46.0],
];
List textSizeUzbek = [
  ["Алиф Лом Мим", 16.0],
  ["Алиф Лом Мим", 18.0],
  ["Алиф Лом Мим", 20.0],
  ["Алиф Лом Мим", 24.0],
  ["Алиф Лом Мим", 26.0],
];
